# YOLOv8 with DCN v3 - STRATEGIC DCN NECK (Balanced Approach)
# Optimal balance: DCN at key fusion points only
#
# Architecture Strategy:
# - Backbone: DCN v3 at P3/P4 (scale-sensitive layers)
# - Neck FPN: DCN v3 at P4 level (main fusion point)
# - Neck PAN: DCN v3 at P4 level (critical detection scale)
# - Other neck layers: Standard C2f
#
# Benefits:
# - Best balance between performance and efficiency
# - DCN where it matters most (P4: main detection scale)
# - Minimal computational overhead (~3-5% slower)
#
# Reasoning:
# - P4 (stride 16) is the critical scale for most vehicles
# - Cars, motorcycles, vans detected at P4
# - DCN here maximizes benefit/cost ratio
#
# Expected improvement: +5-12% mAP50-95
# Best for: RECOMMENDED for most use cases (best efficiency/performance)

nc: 6
depth_multiple: 0.33
width_multiple: 0.25

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]] # 2 - standard
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, DCNv3C2f, [256, True]] # 4 - DCN v3
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, DCNv3C2f, [512, True]] # 6 - DCN v3
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]] # 8 - standard
  - [-1, 1, SPPF, [1024, 5]] # 9

head:
  # FPN (Feature Pyramid Network)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 10
  - [[-1, 6], 1, Concat, [1]] # 11 - concat P4
  - [-1, 3, DCNv3C2f, [512]] # 12 - DCN v3! (P4 fusion - CRITICAL)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 13
  - [[-1, 4], 1, Concat, [1]] # 14 - concat P3
  - [-1, 3, C2f, [256]] # 15 - Standard (P3 small objects)

  # PAN (Path Aggregation Network)
  - [-1, 1, Conv, [256, 3, 2]] # 16 - downsample
  - [[-1, 12], 1, Concat, [1]] # 17 - concat P4
  - [-1, 3, DCNv3C2f, [512]] # 18 - DCN v3! (P4 refinement - CRITICAL)

  - [-1, 1, Conv, [512, 3, 2]] # 19 - downsample
  - [[-1, 9], 1, Concat, [1]] # 20 - concat P5
  - [-1, 3, C2f, [1024]] # 21 - Standard (P5 large objects)

  # Detection head
  - [[15, 18, 21], 1, Detect, [nc]] # 22 Detect(P3, P4, P5)
