# YOLOv8 with DCN v3 - DCN PAN ONLY (Bottom-Up Pathway)
# Focus DCN on path aggregation (bottom-up) for strong feature refinement
#
# Architecture Strategy:
# - Backbone: DCN v3 at P3/P4 (scale-sensitive layers)
# - Neck FPN: Standard C2f (top-down pathway)
# - Neck PAN: DCN v3 (bottom-up pathway, feature refinement)
#
# Benefits:
# - Focuses DCN on bottom-up feature refinement
# - Better for large object detection (bottom-up helps)
# - Good for refining coarse features
#
# Trade-offs:
# - Moderate computational cost (~5-8% slower than baseline)
# - May be less effective for very small objects
#
# Expected improvement: +5-11% mAP50-95
# Best for: Large vehicle detection (buses, trucks), feature refinement focus

nc: 6
depth_multiple: 0.33
width_multiple: 0.25

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]] # 2 - standard
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, DCNv3C2f, [256, True]] # 4 - DCN v3
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, DCNv3C2f, [512, True]] # 6 - DCN v3
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]] # 8 - standard
  - [-1, 1, SPPF, [1024, 5]] # 9

head:
  # FPN (Feature Pyramid Network) - Standard C2f
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 10
  - [[-1, 6], 1, Concat, [1]] # 11 - concat P4
  - [-1, 3, C2f, [512]] # 12 - Standard (top-down P5竊単4)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 13
  - [[-1, 4], 1, Concat, [1]] # 14 - concat P3
  - [-1, 3, C2f, [256]] # 15 - Standard (top-down P4竊単3)

  # PAN (Path Aggregation Network) - DCN v3 for bottom-up refinement
  - [-1, 1, Conv, [256, 3, 2]] # 16 - downsample
  - [[-1, 12], 1, Concat, [1]] # 17 - concat P4
  - [-1, 3, DCNv3C2f, [512]] # 18 - DCN v3! (bottom-up P3竊単4)

  - [-1, 1, Conv, [512, 3, 2]] # 19 - downsample
  - [[-1, 9], 1, Concat, [1]] # 20 - concat P5
  - [-1, 3, DCNv3C2f, [1024]] # 21 - DCN v3! (bottom-up P4竊単5)

  # Detection head
  - [[15, 18, 21], 1, Detect, [nc]] # 22 Detect(P3, P4, P5)
