# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLOv8-cls image classification model with ResNet50 backbone
# Model docs: https://docs.ultralytics.com/models/yolov8
# Task docs: https://docs.ultralytics.com/tasks/classify

nc: 10 # number of classes
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

backbone:
  - [-1, 1, ResNetLayer, [3, 64, 1, True, 1]] # P1/2  Index 0
  - [-1, 1, ResNetLayer, [64, 64, 1, False, 3]] # P2/4  Index 1
  - [-1, 1, ResNetLayer, [256, 128, 2, False, 4]] # P3/8  Index 2
  - [-1, 1, ResNetLayer, [512, 256, 2, False, 6]] # P4/16  Index 3
  - [-1, 1, ResNetLayer, [1024, 512, 2, False, 3]] # P5/32  Index 4
  - [-1, 1, SPPF, [1024, 5]] # P5/32 (SPPF)  Index 5

head:
  # BiFPN Implementation
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 3], 1, BiFPN_Concat2, [1]] # Merge P4 with upsampled P5  Index 7
  - [-1, 3, C2f, [256]] # Fuse features  Index 8

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 2], 1, BiFPN_Concat2, [1]] # Merge P3 with upsampled P4  Index 10
  - [-1, 3, C2f, [256]] # Fuse features  Index 11

  # Bottom-up pathway
  - [-1, 1, Conv, [256, 3, 2]] # P3 to P4  Index 12
  - [[-1, 8, 3], 1, BiFPN_Concat3, [1]] # Merge P4 with downsampled P3  Index 13
  - [-1, 3, C2f, [256]] # Fuse features  Index 14

  - [-1, 1, Conv, [512, 3, 2]] # P4 to P5  Index 15
  - [[-1, 5], 1, BiFPN_Concat2, [1]] # Merge P5 with downsampled P4  Index 16
  - [-1, 3, C2f, [512]] # Fuse features  Index 17

  ###### iteration 2 #########
  # Second BiFPN Iteration
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # Index 18
  - [[-1, 13], 1, BiFPN_Concat2, [1]] # Merge P4 with upsampled P5  Index 19
  - [-1, 3, C2f, [256]] # Fuse features  Index 20

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # Index 21
  - [[-1, 10], 1, BiFPN_Concat2, [1]] # Merge P3 with upsampled P4  Index 22
  - [-1, 3, C2f, [256]] # Fuse features  Index 23

  # Second Bottom-Up Refinement Pathway
  - [-1, 1, Conv, [256, 3, 2]] # P3 to P4  Index 24
  - [[-1, 20, 3], 1, BiFPN_Concat3, [1]] # Merge P4 with downsampled P3  Index 25
  - [-1, 3, C2f, [256]] # Fuse features  Index 26

  - [-1, 1, Conv, [512, 3, 2]] # P4 to P5  Index 27
  - [[-1, 5], 1, BiFPN_Concat2, [1]] # Merge P5 with downsampled P4  Index 28
  - [-1, 3, C2f, [512]] # Fuse features  Index 29
  # Detection head
  - [[23, 26, 29], 1, Detect, [nc]] # Detect from P3, P4, P5

