# name: yolov8n-full-enhancement-final.yaml
# Final corrected version. Fixes the IndexError by pointing the
# Detect layer to the correct output heads.

# Parameters
nc: 80
scales:
  n: [0.33, 0.25, 1024]

# YOLOv8.0n backbone
backbone:
  # from, number, module, args
  - [-1, 1, Conv, [64, 3, 2]]          # 0
  - [-1, 1, Conv, [128, 3, 2]]         # 1
  - [-1, 3, EnhancedC2f, [128, True]]  # 2
  - [-1, 1, Conv, [256, 3, 2]]         # 3
  - [-1, 6, EnhancedC2f, [256, True]]  # 4
  - [-1, 1, Conv, [512, 3, 2]]         # 5
  - [-1, 6, EnhancedC2f, [512, True]]  # 6
  - [-1, 1, Conv, [1024, 3, 2]]        # 7
  - [-1, 3, EnhancedC2f, [1024, True]] # 8
  - [-1, 1, SPPF, [1024, 5]]           # 9

# YOLOv8.0n head with Full Enhancements
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]    # 10
  - [[-1, 6], 1, Concat, [1]]                     # 11
  - [-1, 1, FullEnhancementBlock, [1536, 16, 2]]  # 12
  - [-1, 3, EnhancedC2f, [512, False]]            # 13 (P4 Head Branch)

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]    # 14
  - [[-1, 4], 1, Concat, [1]]                     # 15
  - [-1, 1, FullEnhancementBlock, [768, 16, 2]]   # 16
  - [-1, 3, EnhancedC2f, [256, False]]            # 17 (P3 Head Output)

  - [-1, 1, Conv, [256, 3, 2]]                    # 18
  - [[-1, 13], 1, Concat, [1]]                    # 19
  - [-1, 1, FullEnhancementBlock, [768, 16, 2]]   # 20
  - [-1, 3, EnhancedC2f, [512, False]]            # 21 (P4 Head Output)

  - [-1, 1, Conv, [512, 3, 2]]                    # 22
  - [[-1, 9], 1, Concat, [1]]                     # 23
  - [-1, 1, FullEnhancementBlock, [1536, 16, 2]]  # 24
  - [-1, 3, EnhancedC2f, [1024, False]]           # 25 (P5 Head Output)

  # FINAL FIX: Connect Detect to the correct P3, P4, and P5 output layers.
  - [[17, 21, 25], 1, Detect, [nc]]               # 26