# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLOv8-reid person re-identification model (C2f backbone, no attention)
# Task docs: https://docs.ultralytics.com/tasks/reid

# Parameters
nc: 751 # number of identity classes (overridden by data=*.yaml -> nc)
scales: # 'model=yolov8l-reid.yaml' calls this with scale 'l'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 1024]
  l: [1.00, 1.00, 1024]
  x: [1.00, 1.25, 1024]

# YOLOv8.0 backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]]

# ReID head
head:
  - [-1, 1, ReID, [nc]] # ReID head
