# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLOv8-SE: YOLOv8 with Squeeze-and-Excitation (SE) channel attention
# Replaces standard C2f blocks with C2fSE blocks in the backbone and head.
# SE recalibration lets the network focus on the most informative channels,
# improving accuracy with minimal extra compute (< 1% parameter overhead).
#
# Model docs: https://docs.ultralytics.com/models/yolov8
# Task docs:  https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-se.yaml' will call yolov8-se.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024] # YOLOv8n-SE
  s: [0.33, 0.50, 1024] # YOLOv8s-SE
  m: [0.67, 0.75, 768]  # YOLOv8m-SE
  l: [1.00, 1.00, 512]  # YOLOv8l-SE
  x: [1.00, 1.25, 512]  # YOLOv8x-SE

# YOLOv8-SE backbone
# C2fSE replaces C2f at P3/P4/P5 where channel attention is most beneficial.
# The lightweight stem (P1/P2) retains standard C2f to keep early-layer cost low.
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]        # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]       # 1-P2/4
  - [-1, 3, C2f,  [128, True]]       # 2  – shallow stem, standard C2f
  - [-1, 1, Conv, [256, 3, 2]]       # 3-P3/8
  - [-1, 6, C2fSE, [256, True]]      # 4  – SE attention at P3
  - [-1, 1, Conv, [512, 3, 2]]       # 5-P4/16
  - [-1, 6, C2fSE, [512, True]]      # 6  – SE attention at P4
  - [-1, 1, Conv, [1024, 3, 2]]      # 7-P5/32
  - [-1, 3, C2fSE, [1024, True]]     # 8  – SE attention at P5
  - [-1, 1, SPPF, [1024, 5]]         # 9

# YOLOv8-SE head
# SE blocks in the neck feature aggregation paths.
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]         # cat backbone P4
  - [-1, 3, C2fSE, [512]]             # 12 – SE in top-down neck

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]         # cat backbone P3
  - [-1, 3, C2fSE, [256]]             # 15 (P3/8-small) – SE in top-down neck

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]        # cat head P4
  - [-1, 3, C2fSE, [512]]             # 18 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]         # cat head P5
  - [-1, 3, C2fSE, [1024]]            # 21 (P5/32-large)

  - [[15, 18, 21], 1, Detect, [nc]]   # Detect(P3, P4, P5)
