#liu et al

nc: 6
depth_multiple: 0.33
width_multiple: 0.25

backbone:
  # [from, number, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0  P1/2
  - [-1, 1, DeformC2f, [128, 3]] # 1  P2/4
  - [-1, 1, Conv, [128, 3, 2]] # 2  downsample -> P3/8
  - [-1, 2, C2f, [256, 6]] # 3  P3/8
  - [-1, 1, Conv, [256, 3, 2]] # 4  downsample -> P4/16
  - [-1, 2, DeformC2f, [512, 6]] # 5  P4/16
  - [-1, 1, Conv, [512, 3, 2]] # 6  downsample -> P5/32
  - [-1, 1, SPPF, [1024, 5]] # 7  P5/32

head:
  - [-1, 1, Conv, [512, 1, 1]] # 8
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 9  -> P4/16
  - [[-1, 5], 1, Concat, [1]] # 10 (P5 up + P4)

  - [-1, 2, DeformC2f, [512, 3]] # 11  P4/16
  - [-1, 1, Conv, [256, 1, 1]] # 12
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 13  -> P3/8

  - [[-1, 3], 1, Concat, [1]] # 14 (P4 up + P3)
  - [-1, 2, C2f, [256, 3]] # 15  P3/8
  - [-1, 1, Conv, [128, 1, 1]] # 16

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 17  -> P2/4
  - [[-1, 1], 1, Concat, [1]] # 18 (P3 up + P2)
  - [-1, 2, C2f, [128, 3]] # 19  P2/4

  - [[15, 11, 8], 1, Detect, [nc]] # 20 (P3, P4, P5)
