# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLOv8-cls image classification model with ResNet50 backbone
# Model docs: https://docs.ultralytics.com/models/yolov8
# Task docs: https://docs.ultralytics.com/tasks/classify

nc: 10  # number of classes
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# -----------------------------
# YOLOv8 Backbone
# -----------------------------
backbone:
  - [-1, 1, ResNetLayer, [3, 64, 1, True, 1]]   # P1/2
  - [-1, 1, ResNetLayer, [64, 64, 1, False, 3]]  # P2/4
  - [-1, 1, ResNetLayer, [256, 128, 2, False, 4]] # P3/8
  - [-1, 1, ResNetLayer, [512, 256, 2, False, 6]] # P4/16
  - [-1, 1, ResNetLayer, [1024, 512, 2, False, 3]] # P5/32

# -----------------------------
# BiFPN Implementation (Following EfficientDet Diagram)
# -----------------------------
head:
  # =====================
  # Top-Down Pathway
  # =====================
  # P5 -> P4
  - [-1, 1, Conv, [512, 1, 1]]  # Reduce channels for P5
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # Upsample to P4 size
  - [[-1, 3], 1, WeightedAdd, [512]]  # Weighted fusion of P5 and P4
  - [-1, 2, C2f, [512, False]]  # Depth reduction after fusion

  # P4 -> P3
  - [-1, 1, Conv, [256, 1, 1]]  # Reduce channels for P4
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # Upsample to P3 size
  - [[-1, 2], 1, WeightedAdd, [256]]  # Weighted fusion of P4 and P3
  - [-1, 2, C2f, [256, False]]  # Depth reduction after fusion

  # =====================
  # Bottom-Up Pathway
  # =====================
  # P3 -> P4
  - [-1, 1, Conv, [256, 3, 2]]  # Downsample to P4 size
  - [[-1, 10, 3], 1, WeightedAdd, [512]]  # Weighted fusion of P3 and P4
  - [-1, 2, C2f, [512, False]]  # Depth reduction after fusion

  # P4 -> P5
  - [-1, 1, Conv, [512, 3, 2]]  # Downsample to P5 size
  - [[-1, 6], 1, WeightedAdd, [1024]]  # Weighted fusion of P4 and P5
  - [-1, 2, C2f, [1024, False]]  # Depth reduction after fusion

  # =====================
  # Skip Connections (EfficientDet Style)
  # =====================
  # P3 -> P4
  - [[12, 15], 1, WeightedAdd, [512]]  # Skip P3 -> P4 connection
  - [-1, 2, C2f, [512, False]]  

  # P4 -> P5
  - [[16, 18], 1, WeightedAdd, [1024]]  # Skip P4 -> P5 connection
  - [-1, 2, C2f, [1024, False]]  

  # Extra Feature Fusion (EfficientDet Style)
  - [[12, 15, 18], 1, WeightedAdd, [512]]  
  - [-1, 2, C2f, [512, False]]

  # =====================
  # SPPF (After BiFPN)
  # =====================
  - [-1, 1, SPPF, [1024, 5]]

  # =====================
  # Detection head
  # =====================
  - [[13, 16, 19], 1, Detect, [nc]]


