# YOLOv8n with Enhanced C2f blocks (Lightweight Configuration)
nc: 80
scales:
  n: [0.33, 0.25, 1024]

# YOLOv8.0n backbone
backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 3, EnhancedC2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 6, EnhancedC2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 6, EnhancedC2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 3, EnhancedC2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 3, EnhancedC2f, [512, False]]
  
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 3, EnhancedC2f, [256, False]]
  
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 3, EnhancedC2f, [512, False]]
  
  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]
  - [-1, 3, EnhancedC2f, [1024, False]]
  
  - [[15, 18, 21], 1, Detect, [nc]]