# Save as: ultralytics/cfg/models/v8/yolov8n-enhanced.yaml
# YOLOv8n with Enhanced C2f blocks

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024] # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
  s: [0.33, 0.50, 1024] # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs
  m: [0.67, 0.75, 768]  # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs
  l: [1.00, 1.00, 512]  # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs
  x: [1.00, 1.25, 512]  # YOLOv8x summary: 365 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPs

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, EnhancedC2f, [128, True, True, False, True, False]] # 2 - Enhanced with SE + shuffle + adaptive fusion
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, EnhancedC2f, [256, True, True, False, True, False]] # 4 - Enhanced
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, EnhancedC2f, [512, True, True, False, True, False]] # 6 - Enhanced
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, EnhancedC2f, [1024, True, True, False, True, False]] # 8 - Enhanced
  - [-1, 1, SPPF, [1024, 5]] # 9

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 3, EnhancedC2f, [512, False, True, False, True, False]] # 12 - Enhanced in neck
  
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, EnhancedC2f, [256, False, True, False, True, False]] # 15 (P3/8-small) - Enhanced in neck
  
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]] # cat head P4
  - [-1, 3, EnhancedC2f, [512, False, True, False, True, False]] # 18 (P4/16-medium) - Enhanced in neck
  
  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]] # cat head P5
  - [-1, 3, EnhancedC2f, [1024, False, True, False, True, False]] # 21 (P5/32-large) - Enhanced in neck
  
  - [[15, 18, 21], 1, Detect, [nc]] # Detect(P3, P4, P5)

