# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLOv8-cls image classification model with ResNet50 backbone
# Model docs: https://docs.ultralytics.com/models/yolov8
# Task docs: https://docs.ultralytics.com/tasks/classify

nc: 10  # number of classes
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# -----------------------------
# YOLOv8 Backbone
# -----------------------------
backbone:
  - [-1, 1, ResNetLayer, [3, 64, 1, True, 1]]   # P1/2
  - [-1, 1, ResNetLayer, [64, 64, 1, False, 3]]  # P2/4
  - [-1, 1, ResNetLayer, [256, 128, 2, False, 4]] # P3/8
  - [-1, 1, ResNetLayer, [512, 256, 2, False, 6]] # P4/16
  - [-1, 1, ResNetLayer, [1024, 512, 2, False, 3]] # P5/32
  - [-1, 1, SPPF, [1024, 5]]  # SPPF after P5

# -----------------------------
# BiFPN Implementation (Following EfficientDet)
# -----------------------------
head:
  # =====================
  # Top-Down Pathway
  # =====================
  - [-1, 1, Conv, [512, 1, 1]]
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [-1, 5, 1, WeightedAdd, [512]]
  - [-1, 2, C2f, [512, False]]

  - [-1, 1, Conv, [256, 1, 1]]
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [-1, 4, 1, WeightedAdd, [256]]
  - [-1, 2, C2f, [256, False]]

  # =====================
  # Bottom-Up Pathway
  # =====================
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 10, 1, WeightedAdd, [512]]
  - [-1, 2, C2f, [512, False]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 6, 1, WeightedAdd, [1024]]
  - [-1, 2, C2f, [1024, False]]

  # =====================
  # Skip Connections (EfficientDet Style)
  # =====================
  - [14, 17, 1, WeightedAdd, [512]]
  - [-1, 2, C2f, [512, False]]

  - [18, 20, 1, WeightedAdd, [1024]]
  - [-1, 2, C2f, [1024, False]]

  # Extra Feature Fusion (EfficientDet Style)
  - [14, 17, 20, 1, WeightedAdd, [512]]
  - [-1, 2, C2f, [512, False]]

  # =====================
  # Detection Head
  # =====================
  - [[15, 18, 21], 1, Detect, [nc]]
