# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLOv8-ghostv2 object detection model with P3/8 - P6/64 outputs
# Model docs: https://docs.ultralytics.com/models/yolov8
# Task docs: https://docs.ultralytics.com/tasks/detect
# Employs GhostNetV2-style DFC attention in Ghost bottlenecks

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-ghostv2-p6.yaml' will call yolov8-ghostv2-p6.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# YOLOv8.0-ghostv2 backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, GhostConvV2, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C3GhostV2, [128, True, 1, 0.5, 9]]
  - [-1, 1, GhostConvV2, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C3GhostV2, [256, True, 1, 0.5, 7]]
  - [-1, 1, GhostConvV2, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C3GhostV2, [512, True, 1, 0.5, 5]]
  - [-1, 1, GhostConvV2, [768, 3, 2]] # 7-P5/32
  - [-1, 3, C3GhostV2, [768, True, 1, 0.5, 5]]
  - [-1, 1, GhostConvV2, [1024, 3, 2]] # 9-P6/64
  - [-1, 3, C3GhostV2, [1024, True, 1, 0.5, 5]]
  - [-1, 1, SPPF, [1024, 5]] # 11

# YOLOv8.0-ghostv2-p6 head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 8], 1, Concat, [1]] # cat backbone P5
  - [-1, 3, C3GhostV2, [768, True, 1, 0.5, 5]] # 14

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 3, C3GhostV2, [512, True, 1, 0.5, 5]] # 17

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, C3GhostV2, [256, True, 1, 0.5, 7]] # 20 (P3/8-small)

  - [-1, 1, GhostConvV2, [256, 3, 2]]
  - [[-1, 17], 1, Concat, [1]] # cat head P4
  - [-1, 3, C3GhostV2, [512, True, 1, 0.5, 5]] # 23 (P4/16-medium)

  - [-1, 1, GhostConvV2, [512, 3, 2]]
  - [[-1, 14], 1, Concat, [1]] # cat head P5
  - [-1, 3, C3GhostV2, [768, True, 1, 0.5, 5]] # 26 (P5/32-large)

  - [-1, 1, GhostConvV2, [768, 3, 2]]
  - [[-1, 11], 1, Concat, [1]] # cat head P6
  - [-1, 3, C3GhostV2, [1024, True, 1, 0.5, 5]] # 29 (P6/64-xlarge)

  - [[20, 23, 26, 29], 1, Detect, [nc]] # Detect(P3, P4, P5, P6)
