# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Parameters
nc: 80 # number of classes

backbone:
  # [from, number, module, args]            
  - [-1, 1, EfficientNetB1Block1, [40]]     # 0
  - [-1, 1, EfficientNetB1Block2, [112]]    # 1
  - [-1, 1, EfficientNetB1Block3, [1280]]   # 2
  - [-1, 3, C2f, [1024, True]]              # 3  
  - [-1, 1, SPPF, [1024, 5]]                # 4

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] 
  - [[-1, 1], 1, Concat, [1]] # cat backbone P4
  - [-1, 3, C2f, [512]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 0], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, C2f, [256]] # 10 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 7], 1, Concat, [1]] # cat head P4
  - [-1, 3, C2f, [512]] # 13 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 4], 1, Concat, [1]] # cat head P5
  - [-1, 3, C2f, [1024]] # 16 (P5/32-large)

  - [[10, 13, 16], 1, Detect, [nc]] # Detect(P3, P4, P5)
