# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLO26 object detection model with P3/8 - P5/32 outputs
# P4 detection head is removed; combines the aggressive family's best lever
# (widened neck, +0.0096) with C2PSA on the single P4 intermediate — the PSA
# placement that earned +0.008 on the correct family. Aggressive style:
# no second P4 intermediate. Benchmark-gated: likely 1.2-1.3 ms.
# Model docs: https://docs.ultralytics.com/models/yolo26
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
end2end: True # whether to use end-to-end mode
reg_max: 1 # DFL bins
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO26n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5, 3, True]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

# YOLO26n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, C3k2, [768, True]] # 13 widened intermediate P4/16
  - [-1, 1, C2PSA, [768]] # 14 PSA on the single P4 intermediate

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, C3k2, [384, True]] # 17 widened P3/8-small

  - [14, 1, Conv, [768, 3, 2]] # downsample PSA-enriched P4 intermediate to P5 stride
  - [[-1, 10], 1, Concat, [1]] # cat backbone P5
  - [-1, 1, C3k2, [1024, True, 0.5, True]] # 20 (P5/32-large)

  - [[17, 20], 1, Detect, [nc]] # Detect(P3, P5)
