# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Neckless variant of `deim_dinov3splus_sta_l6_xl.yaml`.
# Keeps the DINOv3 small-plus STA backbone and XL DEIM decoder, but removes the HybridEncoder/FPN/PAN neck.
# Model docs: https://docs.ultralytics.com/models/rtdetr
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes

backbone:
  # [from, repeats, module, args]
  # DEIMv2 DINOv3+STA backbone wrapper.
  # Parser args: [out_ch, name, pretrained, interaction_indexes, finetune, patch_size, use_sta, conv_inplane, hidden_dim, split]
  # If pretrained=True, loader uses official DINOv3 torch.hub URL by model name.
  # For access-gated links, set DEIMV2_DINOV3_URL to your granted direct checkpoint URL.
  - [-1, 1, DEIMDINOv3STAs, [256, dinov3_vits16plus, True, [5, 8, 11], True, 16, True, 64, 256, True]] # 0
  - [0, 1, Index, [256, 1]] # 1 P3
  - [0, 1, Index, [256, 2]] # 2 P4
  - [0, 1, Index, [256, 3]] # 3 P5

head:
  # Per-scale refinement only: no AIFI/FPN/PAN neck or cross-scale mixing.
  - [1, 1, C3k2, [256, True, 0.5, True]] # 4 P3 refine
  - [2, 1, C3k2, [256, True, 0.5, True]] # 5 P4 refine
  - [3, 1, C3k2, [256, True, 0.5, True]] # 6 P5 refine

  # DeimDecoder with XL settings from `deim_dinov3splus_sta_l6_xl.yaml`.
  # Neckless path: feed refined STA P3/P4/P5 features directly to the decoder.
  # Args: [nc, hd, nq, ndp, nh, ndl, d_ffn, dropout, act, eval_idx, nd, label_noise_ratio, box_noise_scale,
  #        learnt_init_query, enable_cuda_acceleration, one_to_many_groups, dab_sine_embedding,
  #        efficient_msdeformable_attn, query_select_method, reg_max, reg_scale, layer_scale, mlp_act,
  #        o2m_topk_mode, use_gateway, share_bbox_head, share_score_head]
  - [[4, 5, 6], 1, DeimDecoder, [nc, 256, 300, [3, 6, 3], 8, 6, 2048, 0.0, "silu", -1, 100, 0.5, 1.0, False, False, 0, False, False, "default", 32, 4.0, 1.0, "silu", "unshared", True, False, False]]

loss:
  gamma: 1.5
  alpha: 0.75
  use_fl: False
  use_vfl: False
  use_mal: True
  use_union_set: True
  reg_max: 32
  loss_gain: {class: 1, bbox: 5, giou: 2, fgl: 0.15, ddf: 1.5}
  matcher:
    cost_gain: {class: 2, bbox: 5, giou: 2}
    use_fl: True
    alpha: 0.25
    gamma: 2.0
    change_matcher: True
    iou_order_alpha: 4.0
    matcher_change_epoch: 45
