# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO26 RepMixer FastViT-FFN Attn2-P4Pooled backbone with the DEIM DINOv3s+ XL HybridEncoder neck.
# X-only Lane B cross-scale P4 arm: dense P4 queries attend to a P5-scale pooled key/value grid
# before the P5 Attn2 stage. The DEIMv2 neck/decoder matches the other UltraViT DEIM configs.
# Model docs: https://docs.ultralytics.com/models/rtdetr
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
end2end: True # whether to use end-to-end mode
reg_max: 1 # DFL bins
scales: # source classifier is x-only
  # [depth, width, max_channels]
  x: [0.35, 1.50, 512]

# UltraViT backbone: RepMixer stages 1-3 (FastViT ConvFFN) + P4 pooled MHSA + Attn2 P5 MHSA
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0 P1/2 stem
  - [-1, 1, Conv, [96, 3, 2]] # 1 P2/4 stem
  - [-1, 5, RepUltraViTBlock, [3, True, 0.00001, True]] # 2 stage1 P2/4
  - [-1, 1, Conv, [192, 3, 2]] # 3 P3/8 downsample
  - [-1, 5, RepUltraViTBlock, [3, True, 0.00001, True]] # 4 stage2 P3/8 feature
  - [-1, 1, Conv, [384, 3, 2]] # 5 P4/16 downsample
  - [-1, 20, RepUltraViTBlock, [3, True, 0.00001, True]] # 6 stage3 P4/16
  - [-1, 5, PooledMHSABlock, [0, 4, True, 0.00001, 32, 2]] # 7 P4/16 pooled-attn feature
  - [-1, 1, Conv, [1152, 3, 2]] # 8 P5/32 downsample
  - [-1, 8, MHSABlock, [0, 4, True, 0.00001, True, 32]] # 9 stage4 P5/32 feature

head:
  # DEIMv2-X HybridEncoder neck from deim_dinov3splus_sta_l6_xl.yaml.
  # Backbone P3/P4/P5 features are projected from layers 4/7/9.
  - [9, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 10 input_proj.2
  - [-1, 1, AIFI, [1024, 8]]
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 12 Y5, lateral_convs.0

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [7, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 14 input_proj.1
  - [[-2, -1], 1, Add, []]
  - [-1, 1, RepNCSPELAN5, [256, 512, 160, 4]] # 16 fpn_blocks.0
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 17 Y4, lateral_convs.1

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [4, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 19 input_proj.0
  - [[-2, -1], 1, Add, []]
  - [-1, 1, RepNCSPELAN5, [256, 512, 160, 4]] # 21 X3, fpn_blocks.1

  - [-1, 1, SCDown, [256, 3, 2, False]] # 22 downsample_convs.0
  - [[-1, 17], 1, Add, []]
  - [-1, 1, RepNCSPELAN5, [256, 512, 160, 4]] # 24 F4, pan_blocks.0

  - [-1, 1, SCDown, [256, 3, 2, False]] # 25 downsample_convs.1
  - [[-1, 12], 1, Add, []]
  - [-1, 1, RepNCSPELAN5, [256, 512, 160, 4]] # 27 F5, pan_blocks.1

  # DeimDecoder (DEIMv2-X defaults explicitly set in YAML)
  # Args: [nc, hd, nq, ndp, nh, ndl, d_ffn, dropout, act, eval_idx, nd, label_noise_ratio, box_noise_scale,
  #        learnt_init_query, enable_cuda_acceleration, one_to_many_groups, dab_sine_embedding,
  #        efficient_msdeformable_attn, query_select_method, reg_max, reg_scale, layer_scale, mlp_act,
  #        o2m_topk_mode, use_gateway, share_bbox_head, share_score_head]
  - [[21, 24, 27], 1, DeimDecoder, [nc, 256, 300, [3, 6, 3], 8, 6, 2048, 0.0, "silu", -1, 100, 0.5, 1.0, False, False, 0, False, False, "default", 32, 4.0, 1.0, "silu", "unshared", True, False, False]]

loss:
  gamma: 1.5
  alpha: 0.75
  use_fl: False
  use_vfl: False
  use_mal: True
  use_union_set: True
  reg_max: 32
  loss_gain: {class: 1, bbox: 5, giou: 2, fgl: 0.15, ddf: 1.5}
  matcher:
    cost_gain: {class: 2, bbox: 5, giou: 2}
    use_fl: True
    alpha: 0.25
    gamma: 2.0
    change_matcher: True
    iou_order_alpha: 4.0
    matcher_change_epoch: 45
