# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# X-only Lane B cross-scale P4 arm. Dense P4 queries attend to a P5-scale pooled key/value grid before P5 Attn2.

nc: 80
end2end: True
reg_max: 1

scales:
  x: [0.35, 1.50, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [96, 3, 2]]
  - [-1, 5, RepUltraViTBlock, [3, True, 0.00001, True]]
  - [-1, 1, Conv, [192, 3, 2]]
  - [-1, 5, RepUltraViTBlock, [3, True, 0.00001, True]]
  - [-1, 1, Conv, [384, 3, 2]]
  - [-1, 20, RepUltraViTBlock, [3, True, 0.00001, True]]
  - [-1, 5, PooledMHSABlock, [0, 4, True, 0.00001, 32, 2]]
  - [-1, 1, Conv, [1152, 3, 2]]
  - [-1, 8, MHSABlock, [0, 4, True, 0.00001, True, 32]]

head:
  - [9, 1, Conv, [256, 1, 1, None, 1, 1, False]]
  - [-1, 1, AIFI, [1024, 8]]
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [7, 1, Conv, [256, 1, 1, None, 1, 1, False]]
  - [[-2, -1], 1, Add, []]
  - [-1, 1, RepNCSPELAN5, [256, 512, 160, 4]]
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [4, 1, Conv, [256, 1, 1, None, 1, 1, False]]
  - [[-2, -1], 1, Add, []]
  - [-1, 1, RepNCSPELAN5, [256, 512, 160, 4]]
  - [-1, 1, SCDown, [256, 3, 2, False]]
  - [[-1, 17], 1, Add, []]
  - [-1, 1, RepNCSPELAN5, [256, 512, 160, 4]]
  - [-1, 1, SCDown, [256, 3, 2, False]]
  - [[-1, 12], 1, Add, []]
  - [-1, 1, RepNCSPELAN5, [256, 512, 160, 4]]
  - [[21, 24, 27], 1, DeimDecoder, [nc, 256, 300, [3, 6, 3], 8, 6, 2048, 0.0, "silu", -1, 100, 0.5, 1.0, False, False, 0, False, False, "default", 32, 4.0, 1.0, "silu", "unshared", True, False, False]]

loss:
  gamma: 1.5
  alpha: 0.75
  use_fl: False
  use_vfl: False
  use_mal: True
  use_union_set: True
  reg_max: 32
  loss_gain: { class: 1, bbox: 5, giou: 2, fgl: 0.15, ddf: 1.5 }
  matcher:
    cost_gain: { class: 2, bbox: 5, giou: 2 }
    use_fl: True
    alpha: 0.25
    gamma: 2.0
    change_matcher: True
    iou_order_alpha: 4.0
    matcher_change_epoch: 45
