# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO26 backbone with the DEIM DINOv3s+ XL HybridEncoder neck.
# Keeps the YOLO26 backbone from `yolo26-deim_mal.yaml`, then replaces the
# YOLO26 FPN/PAN neck with the neck from `deim_dinov3splus_sta_l6_xl.yaml`.
# Model docs: https://docs.ultralytics.com/models/rtdetr
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
end2end: True # whether to use end-to-end mode
reg_max: 1 # DFL bins
scales: # model compound scaling constants, i.e. 'model=YOLO26n.yaml' will call YOLO26.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 260 layers, 2,572,280 parameters, 2,572,280 gradients, 6.1 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 260 layers, 10,009,784 parameters, 10,009,784 gradients, 22.8 GFLOPs
  m: [0.50, 1.00, 512] # summary: 280 layers, 21,896,248 parameters, 21,896,248 gradients, 75.4 GFLOPs
  l: [1.00, 1.00, 512] # summary: 392 layers, 26,299,704 parameters, 26,299,704 gradients, 93.8 GFLOPs
  x: [1.00, 1.50, 512] # summary: 392 layers, 58,993,368 parameters, 58,993,368 gradients, 209.5 GFLOPs

# YOLO26n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3 stride-8 downsample
  - [-1, 2, C3k2, [512, False, 0.25]] # 4-P3/8 feature
  - [-1, 1, Conv, [512, 3, 2]] # 5 stride-16 downsample
  - [-1, 2, C3k2, [512, True]] # 6-P4/16 feature
  - [-1, 1, Conv, [1024, 3, 2]] # 7 stride-32 downsample
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5, 3, True]] # 9
  - [-1, 2, C2PSA, [1024]] # 10-P5/32 feature

head:
  # DEIMv2-X HybridEncoder neck from deim_dinov3splus_sta_l6_xl.yaml.
  # YOLO26 P3/P4/P5 features are projected from layers 4/6/10.
  - [10, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 11 input_proj.2
  - [-1, 1, AIFI, [1024, 8]]
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 13 Y5, lateral_convs.0

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [6, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 15 input_proj.1
  - [[-2, -1], 1, Add, []]
  - [-1, 1, RepNCSPELAN5, [256, 512, 160, 4]] # 17 fpn_blocks.0
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 18 Y4, lateral_convs.1

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [4, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 20 input_proj.0
  - [[-2, -1], 1, Add, []]
  - [-1, 1, RepNCSPELAN5, [256, 512, 160, 4]] # 22 X3, fpn_blocks.1

  - [-1, 1, SCDown, [256, 3, 2, False]] # 23 downsample_convs.0
  - [[-1, 18], 1, Add, []]
  - [-1, 1, RepNCSPELAN5, [256, 512, 160, 4]] # 25 F4, pan_blocks.0

  - [-1, 1, SCDown, [256, 3, 2, False]] # 26 downsample_convs.1
  - [[-1, 13], 1, Add, []]
  - [-1, 1, RepNCSPELAN5, [256, 512, 160, 4]] # 28 F5, pan_blocks.1

  # DeimDecoder (DEIMv2-X defaults explicitly set in YAML)
  # Args: [nc, hd, nq, ndp, nh, ndl, d_ffn, dropout, act, eval_idx, nd, label_noise_ratio, box_noise_scale,
  #        learnt_init_query, enable_cuda_acceleration, one_to_many_groups, dab_sine_embedding,
  #        efficient_msdeformable_attn, query_select_method, reg_max, reg_scale, layer_scale, mlp_act,
  #        o2m_topk_mode, use_gateway, share_bbox_head, share_score_head]
  - [[22, 25, 28], 1, DeimDecoder, [nc, 256, 300, [3, 6, 3], 8, 6, 2048, 0.0, "silu", -1, 100, 0.5, 1.0, False, False, 0, False, False, "default", 32, 4.0, 1.0, "silu", "unshared", True, False, False]]

loss:
  gamma: 1.5
  alpha: 0.75
  use_fl: False
  use_vfl: False
  use_mal: True
  use_union_set: True
  reg_max: 32
  loss_gain: {class: 1, bbox: 5, giou: 2, fgl: 0.15, ddf: 1.5}
  matcher:
    cost_gain: {class: 2, bbox: 5, giou: 2}
    use_fl: True
    alpha: 0.25
    gamma: 2.0
    change_matcher: True
    iou_order_alpha: 4.0
    matcher_change_epoch: 45
