# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Lane B candidate B1: yolo26-ultravit-repmixer-deim_mal_deimv2Neck.yaml with P5 head_dim 32 -> 64.
# Motivation: DINOv3-S+ uses 6 heads at 384 dim = 64-dim heads; ours pins 32 (Apple FastViT policy).
# Free params-wise, not latency-neutral (SDPA kernel dispatch depends on head width) -- re-gate on T4.
# Model docs: https://docs.ultralytics.com/models/rtdetr
# Task docs: https://docs.ultralytics.com/tasks/detect

nc: 80
end2end: True
reg_max: 1
scales:
  n: [0.20, 0.25, 1152]
  s: [0.20, 0.50, 1152]
  m: [0.25, 1.00, 512]
  l: [0.35, 1.00, 512]
  x: [0.35, 1.50, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [96, 3, 2]]
  - [-1, 5, RepUltraViTBlock, [3, True, 0.00001]]
  - [-1, 1, Conv, [192, 3, 2]]
  - [-1, 5, RepUltraViTBlock, [3, True, 0.00001]]
  - [-1, 1, Conv, [384, 3, 2]]
  - [-1, 20, RepUltraViTBlock, [3, True, 0.00001]]
  - [-1, 1, Conv, [1152, 3, 2]]
  - [-1, 5, MHSABlock, [0, 4, True, 0.00001, True, 64]]

head:
  - [8, 1, Conv, [256, 1, 1, None, 1, 1, False]]
  - [-1, 1, AIFI, [1024, 8]]
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [6, 1, Conv, [256, 1, 1, None, 1, 1, False]]
  - [[-2, -1], 1, Add, []]
  - [-1, 1, RepNCSPELAN5, [256, 512, 160, 4]]
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [4, 1, Conv, [256, 1, 1, None, 1, 1, False]]
  - [[-2, -1], 1, Add, []]
  - [-1, 1, RepNCSPELAN5, [256, 512, 160, 4]]

  - [-1, 1, SCDown, [256, 3, 2, False]]
  - [[-1, 16], 1, Add, []]
  - [-1, 1, RepNCSPELAN5, [256, 512, 160, 4]]

  - [-1, 1, SCDown, [256, 3, 2, False]]
  - [[-1, 11], 1, Add, []]
  - [-1, 1, RepNCSPELAN5, [256, 512, 160, 4]]

  - [
      [20, 23, 26],
      1,
      DeimDecoder,
      [
        nc,
        256,
        300,
        [3, 6, 3],
        8,
        6,
        2048,
        0.0,
        "silu",
        -1,
        100,
        0.5,
        1.0,
        False,
        False,
        0,
        False,
        False,
        "default",
        32,
        4.0,
        1.0,
        "silu",
        "unshared",
        True,
        False,
        False,
      ],
    ]

loss:
  gamma: 1.5
  alpha: 0.75
  use_fl: False
  use_vfl: False
  use_mal: True
  use_union_set: True
  reg_max: 32
  loss_gain: { class: 1, bbox: 5, giou: 2, fgl: 0.15, ddf: 1.5 }
  matcher:
    cost_gain: { class: 2, bbox: 5, giou: 2 }
    use_fl: True
    alpha: 0.25
    gamma: 2.0
    change_matcher: True
    iou_order_alpha: 4.0
    matcher_change_epoch: 45
