# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLO26 object detection model with P3/8 - P5/32 outputs
# P4 detection head is removed and P4 is NOT used as an FPN intermediate, but
# a cheap backbone-P4 lateral (Conv stride 2 to /32) is concatenated into the
# P5 head input, giving P5 medium-scale context without a P4 neck block.
# Model docs: https://docs.ultralytics.com/models/yolo26
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
end2end: True # whether to use end-to-end mode
reg_max: 1 # DFL bins
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO26n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5, 3, True]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

# YOLO26n head
head:
  - [10, 1, nn.Upsample, [None, 4, "nearest"]] # 11 P5/32 -> P3/8
  - [[-1, 4], 1, Concat, [1]] # 12 cat backbone P3
  - [-1, 2, C3k2, [256, True]] # 13 (P3/8-small)

  - [13, 1, Conv, [256, 3, 4]] # 14 P3/8 -> P5/32
  - [6, 1, Conv, [512, 3, 2]] # 15 backbone P4 lateral -> P5/32
  - [[14, 10, 15], 1, Concat, [1]] # 16 cat down-P3 + backbone P5 + backbone P4
  - [-1, 1, C3k2, [1024, True, 0.5, True]] # 17 (P5/32-large)

  - [[13, 17], 1, Detect, [nc]] # Detect(P3, P5)
