# YOLOv10 CBAM-enhanced model with integrated CBAM transitions

# Parameters
nc: 4 # number of classes
scales: # model compound scaling constants
  x: [1.00, 1.25, 512]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2: Initial downsampling
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4: Downsample
  - [-1, 3, C2f, [128, True]] # 2: Feature extraction block
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8: Downsample
  - [-1, 6, C2f, [256, True]] # 4: C2f for feature extraction
  # CBAM for shallow feature refinement
  - [-1, 1, CBAM, [256]] # 5: CBAM at shallow layer
  - [-1, 1, SCDown, [512, 3, 2]] # 6-P4/16: Scaled downsampling
  - [-1, 6, C2fCIB, [512, True]] # 7: Advanced feature extraction
  - [-1, 1, CBAM, [512]] # 8: CBAM for intermediate features
  - [-1, 1, SCDown, [1024, 3, 2]] # 9-P5/32: Scaled downsampling
  - [-1, 3, C2fCIB, [1024, True]] # 10: Deeper feature extraction
  - [-1, 1, CBAM, [1024]] # 11: CBAM for abstract features
  - [-1, 1, SPPF, [1024, 5]] # 12: Spatial Pyramid Pooling
  - [-1, 1, PSA, [1024]] # 13: Proportional Scaling Attention

head:
  # [from, repeats, module, args]
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 14: Upsample for P4
  - [[-1, 7], 1, Concat, [1]] # 15: Concatenate with backbone P4
  - [-1, 3, C2fCIB, [512, True]] # 16: Feature refinement for P4
  - [-1, 1, CBAM, [512]] # 17: CBAM after feature refinement

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 18: Upsample for P3
  - [[-1, 4], 1, Concat, [1]] # 19: Concatenate with backbone P3
  - [-1, 3, C2f, [256]] # 20: Feature refinement for P3 (small)

  - [-1, 1, Conv, [256, 3, 2]] # 21: Downsample back to P4
  - [[-1, 16], 1, Concat, [1]] # 22: Concatenate with refined P4
  - [-1, 3, C2fCIB, [512, True]] # 23: Feature refinement for P4 (medium)

  - [-1, 1, SCDown, [512, 3, 2]] # 24: Downsample for P5
  - [[-1, 13], 1, Concat, [1]] # 25: Concatenate with backbone P5
  - [-1, 3, C2fCIB, [1024, True]] # 26: Feature refinement for P5 (large)

  - [[20, 23, 26], 1, v10Detect, [nc]] # 27: Detection layers for P3, P4, P5
