# yolov10_cbam.yaml

# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv10 object detection model with CBAM

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants
  x: [1.00, 1.25, 512]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 1, CBAM, [128]] # CBAM after Conv layer
  - [-1, 3, C2f, [128, True]] # 3
  - [-1, 1, CBAM, [128]] # CBAM after C2f block
  - [-1, 1, Conv, [256, 3, 2]] # 5-P3/8
  - [-1, 1, CBAM, [256]] # CBAM after Conv layer
  - [-1, 6, C2f, [256, True]] # 7
  - [-1, 1, CBAM, [256]] # CBAM after C2f block
  - [-1, 1, SCDown, [512, 3, 2]] # 9-P4/16
  - [-1, 6, C2fCIB, [512, True]] # 10
  - [-1, 1, CBAM, [512]] # CBAM after C2fCIB block
  - [-1, 1, SCDown, [1024, 3, 2]] # 12-P5/32
  - [-1, 3, C2fCIB, [1024, True]] # 13
  - [-1, 1, CBAM, [1024]] # CBAM after C2fCIB block
  - [-1, 1, SPPF, [1024, 5]] # 15
  - [-1, 1, PSA, [1024]] # 16

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 17
  - [[-1, 10], 1, Concat, [1]] # 18 cat backbone P4
  - [-1, 3, C2fCIB, [512, True]] # 19
  - [-1, 1, CBAM, [512]] # CBAM after C2fCIB block

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 20
  - [[-1, 7], 1, Concat, [1]] # 21 cat backbone P3
  - [-1, 3, C2f, [256]] # 22 (P3/8-small)
  - [-1, 1, CBAM, [256]] # CBAM after C2f block

  - [-1, 1, Conv, [256, 3, 2]] # 23
  - [[-1, 19], 1, Concat, [1]] # 24 cat head P4
  - [-1, 3, C2fCIB, [512, True]] # 25 (P4/16-medium)
  - [-1, 1, CBAM, [512]] # CBAM after C2fCIB block

  - [-1, 1, SCDown, [512, 3, 2]] # 26
  - [[-1, 16], 1, Concat, [1]] # 27 cat head P5
  - [-1, 3, C2fCIB, [1024, True]] # 28 (P5/32-large)
  - [-1, 1, CBAM, [1024]] # CBAM after C2fCIB block

  - [[22, 25, 28], 1, v10Detect, [nc]] # 29 Detect(P3, P4, P5)
