# Parameters
nc: 80 # number of classes
scales:
  x: [1.00, 1.25, 512]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 1, CBAM, [256]] # CBAM after Conv layer
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, SCDown, [512, 3, 2]] # 5-P4/16
  - [-1, 1, CBAM, [512]] # CBAM after SCDown
  - [-1, 6, C2fCIB, [512, True]]
  - [-1, 1, SCDown, [1024, 3, 2]] # 7-P5/32
  - [-1, 1, CBAM, [1024]] # CBAM after SCDown
  - [-1, 3, C2fCIB, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 1, PSA, [1024]] # 10

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # Concatenate with backbone P4
  - [-1, 1, CBAM, [512]] # CBAM before C2fCIB
  - [-1, 3, C2fCIB, [512, True]] # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # Concatenate with backbone P3
  - [-1, 1, CBAM, [256]] # CBAM before C2f
  - [-1, 3, C2f, [256]] # 16 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]] # Concatenate with head P4
  - [-1, 1, CBAM, [512]] # CBAM before C2fCIB
  - [-1, 3, C2fCIB, [512, True]] # 19 (P4/16-medium)

  - [-1, 1, SCDown, [1024, 3, 2]] # Adjusted SCDown to match P5 channels
  - [[-1, 10], 1, Concat, [1]] # Concatenate with head P5
  - [-1, 1, CBAM, [1024]] # CBAM before C2fCIB
  - [-1, 3, C2fCIB, [1024, True]] # 22 (P5/32-large)

  - [[16, 19, 22], 1, v10Detect, [nc]] # Detect(P3, P4, P5)
