# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Parameters
nc: 80
scales:
  l: [1.00, 1.00, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, ResNetLayer, [3, 64, 1, True, 1]]      # 0-P1/2
  - [-1, 1, ResNetLayer, [64, 64, 1, False, 3]]    # 1-P2/4
  - [-1, 1, ResNetLayer, [256, 128, 2, False, 4]]  # 2-P3/8
  - [-1, 1, ResNetLayer, [512, 256, 2, False, 6]]  # 3-P4/16
  - [-1, 1, ResNetLayer, [1024, 512, 2, False, 3]] # 4-P5/32

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]     # 5
  - [[-1, 3], 1, Concat, [1]]                      # 6 - cat backbone P4 (layer 3, not 6!)
  - [-1, 2, C3k2, [512, False]]                    # 7

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]     # 8
  - [[-1, 2], 1, Concat, [1]]                      # 9 - cat backbone P3 (layer 2, not 4!)
  - [-1, 2, C3k2, [256, False]]                    # 10 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]                     # 11
  - [[-1, 7], 1, Concat, [1]]                      # 12 - cat head P4 (layer 7, not 13!)
  - [-1, 2, C3k2, [512, False]]                    # 13 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]                     # 14
  - [[-1, 4], 1, Concat, [1]]                      # 15 - cat head P5 (layer 4, not 10!)
  - [-1, 2, C3k2, [1024, True]]                    # 16 (P5/32-large)

  # RTDETRDecoder with correct indices [10, 13, 16]
  - [[10, 13, 16], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 6, 1024, 0.0]]