# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
ch: 6
nc: 1 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 319 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 319 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
  m: [0.50, 1.00, 512] # summary: 409 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
  l: [1.00, 1.00, 512] # summary: 631 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
  x: [1.00, 1.50, 512] # summary: 631 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs

# YOLO11n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, IN, []] # 0
  - [-1, 1, Multiin, [1]] # 1
  - [-2, 1, Multiin, [2]] # 2

  # double stream backbone
  # Visible branch
  - [1, 1, Conv, [32, 3, 2]] # 3-P1/2
  - [-1, 1, Conv, [64, 3, 2]] # 4-P2/4
  - [-1, 2, C3k2, [128, False, 0.25]]
  # Infrared branch
  - [2, 1, Conv, [32, 3, 2]] # 6-P1/2
  - [-1, 1, Conv, [64, 3, 2]] # 7-P2/4
  - [-1, 2, C3k2, [128, False, 0.25]]

  - [-4, 1, Conv, [128, 3, 2]] # 9-P3/8
  - [-2, 1, Conv, [128, 3, 2]] # 10-P3/8  # infrared

  - [-2, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 12-P4/16
  - [-3, 2, C3k2, [256, False, 0.25]] # infrared
  - [-1, 1, Conv, [256, 3, 2]] # 14-P4/16

  - [-3, 2, C3k2, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]] # 16-P5/32
  - [-3, 2, C3k2, [256, True]] # infrared
  - [-1, 1, Conv, [512, 3, 2]] # 18-P5/32

  - [-3, 2, C3k2, [512, True]]
  - [-1, 1, SPPF, [512, 5]] # 20
  - [-1, 2, C2PSA, [512]] # 21
  - [-4, 2, C3k2, [512, True]] # infrared
  - [-1, 1, SPPF, [512, 5]] # 23
  - [-1, 2, C2PSA, [512]] # 24

  - [[11, 13], 1, Concat, [1]] # 25
  - [[15, 17], 1, Concat, [1]] # 26
  - [[21, 24], 1, Concat, [1]] # 27

# YOLO11n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 26], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, C3k2, [256, False]] # 30

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 25], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, C3k2, [128, False]] # 33 (P3/8-small)

  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 30], 1, Concat, [1]] # cat head P4
  - [-1, 2, C3k2, [256, False]] # 36 (P4/16-medium)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 27], 1, Concat, [1]] # cat head P5
  - [-1, 2, C3k2, [512, True]] # 39 (P5/32-large)

  - [[33, 36, 39], 1, Detect, [nc]] # Detect(P3, P4, P5)
