# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license
#
# Stereo3DDet (P3-only) using YOLO11 bbox mapping (TaskAlignedAssigner positives)
#
# This config keeps the same backbone/neck as stereo3ddet_full.yaml but replaces the final head.
# Usage: model=yolo11n-stereo3ddet-full-yolo11bbox.yaml (scale 'n' will be auto-detected from filename)

stereo: true
input_channels: 6
nc: 3
scales: # model compound scaling constants, i.e. 'model=yolo11n-stereo3ddet-full-yolo11bbox.yaml' will call this file with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: matches yolo11n structure for backbone weight transfer
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  # Weight-shared backbone: processes left and right images separately (ch=3 each)
  # Features are concatenated and reduced via 1×1 conv after backbone extraction
  - [-1, 1, Conv, [64, 3, 2]]  # 3→64 channels (weight-shared, processes left/right separately)
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]  # P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]  # P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]  # P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]
  - [-1, 2, C2PSA, [1024]]

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, False]]  # 16 (P3/8)

  # P3-only YOLO11-mapped head (Detect + aux stereo/3D branches)
  # Channel will be auto-scaled by width_multiple: 256 * width_multiple
  # For scale 'n': 256 * 0.25 = 64, for scale 's': 256 * 0.50 = 128, etc.
  - [[16], 1, Stereo3DDetHeadYOLO11, [nc, 256]]
