# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Parameters
nc: 80 # number of classes
scales: # there is no scaling for this model; the following scales are used only to bypass errors in model parsing
  # [depth, width, max_channels]
  n: [1.00, 1.00, 2048]

backbone:
  # [from, number, module, args]
  - [-1, 1, ResNet50Block1, [512]] # 0
  - [-1, 1, ResNet50Block2, [1024]] # 1
  - [-1, 1, ResNet50Block3, [2048]] # 2
  - [-1, 1, SPPF, [1024, 5]] # 3
  - [-1, 2, C2PSA, [1024]] # 4

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 1], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, C3k2, [512, False]] # 7

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 0], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, C3k2, [256, False]] # 10 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 7], 1, Concat, [1]] # cat head P4
  - [-1, 2, C3k2, [512, False]] # 13 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 4], 1, Concat, [1]] # cat head P5
  - [-1, 2, C3k2, [1024, True]] # 16 (P5/32-large)

  - [[10, 13, 16], 1, Detect, [nc]] # Detect(P3, P4, P5)
