# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO11 Stereo 3D Object Detection model with P3/8 - P5/32 outputs
# Usage: model=yolo11n-stereo3ddet.yaml (scale auto-detected from filename)

# Parameters
nc: 3 # number of classes (Car, Pedestrian, Cyclist)
stereo: true # stereo mode flag
input_channels: 6 # 6-channel input (RGB left + RGB right)
scales: # model compound scaling constants, i.e. 'model=yolo11n-stereo3ddet.yaml' will call this file with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# Aux loss weights (lr_distance in log-space, targets ~-4.6 to -1.5)
# Add use_bbox_loss: false under training to disable 2D box + DFL loss (cls + aux only).
training:
  loss_weights:
    lr_distance: 2.0
    depth: 1.0
    dimensions: 1.0
    orientation: 1.0

# Mean dimensions per class [L, W, H] in meters
mean_dims:
  Car: [3.88, 1.63, 1.53]
  Pedestrian: [0.88, 0.60, 1.73]
  Cyclist: [1.72, 0.60, 1.77]

# YOLO11 backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

# YOLO11 head
head:
  # Top-down FPN
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, C3k2, [512, False]] # 13
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, C3k2, [256, False]] # 16 (P3/8)

  # Bottom-up PAN
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]] # cat head P4
  - [-1, 2, C3k2, [512, False]] # 19 (P4/16)
  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # cat head P5
  - [-1, 2, C3k2, [1024, True]] # 22 (P5/32)

  # Multi-scale head (DFL disabled — reg_max=1 hard-coded in head)
  - [[16, 19, 22], 1, Stereo3DDetHeadYOLO11, [nc]]
