# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLO11-cls image classification model
# Model docs: https://docs.ultralytics.com/models/yolo11
# Task docs: https://docs.ultralytics.com/tasks/classify

# Parameters
# n: 86 layers, 475,450 parameters, 475,450 gradients, 1.2 GFLOPs
nc: 2 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n-cls.yaml' will call yolo11-cls.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 512] # summary: 86 layers, 1633584 parameters, 1633584 gradients, 0.5 GFLOPs
  # n: [0.50, 0.25, 1024] # summary: 86 layers, 1633584 parameters, 1633584 gradients, 0.5 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 86 layers, 5545488 parameters, 5545488 gradients, 1.6 GFLOPs
  m: [0.50, 1.00, 512] # summary: 106 layers, 10455696 parameters, 10455696 gradients, 5.0 GFLOPs
  l: [1.00, 1.00, 512] # summary: 176 layers, 12937104 parameters, 12937104 gradients, 6.2 GFLOPs
  x: [1.00, 1.50, 512] # summary: 176 layers, 28458544 parameters, 28458544 gradients, 13.7 GFLOPs

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 1, C3k2, [128, False, 0.25]] # 2 (原模块重复2次改为1次，通道数256->128)
  - [-1, 1, Conv, [128, 3, 2]] # 3-P3/8 (通道数256->128)
  - [-1, 1, C3k2, [256, False, 0.25]] # 4 (原模块重复2次改为1次，通道数512->256)
  - [-1, 1, Conv, [256, 3, 2]] # 5-P4/16 (通道数512->256)
  - [-1, 1, C3k2, [256, True]]  # 6 (原模块重复2次改为1次，通道数512->256)
  - [-1, 1, Conv, [512, 3, 2]]  # 7-P5/32 (通道数1024->512)
  - [-1, 1, C3k2, [512, True]]  # 8 (原模块重复2次改为1次，通道数1024->512)
  - [-1, 1, C2PSA, [512]]      # 9 (通道数1024->512)

# YOLO11n head
head:
  - [-1, 1, Classify, [nc]] # Classify
