# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLO26 object detection model with P3/8 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/yolo26
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes

backbone:
  # [from, repeats, module, args]
  # Timm args: [model_name, pretrained, out_indices, split]
  - [-1, 1, Timm, [None, vit_small_patch16_dinov3.lvd1689m, True, [5, 8, 11], True]]
  - [0, 1, Index, [384, 1]]    # P3 1
  - [0, 1, Index, [384, 2]]    # P4 2
  - [0, 1, Index, [384, 3]]    # P5 3

# YOLO26n head
head:
  - [[-1, 2], 1, Concat, [1]] # cat backbone P4 4
  - [-1, 2, C3k2, [512, True]] # 5

  - [[-1, 1], 1, Concat, [1]] # cat backbone P3 6
  - [-1, 2, C3k2, [256, True]] # 7 

  - [-1, 1, Conv, [256, 3, 1]]
  - [[-1, 7], 1, Concat, [1]] # cat head P4 8
  - [-1, 2, C3k2, [512, True]] # 9 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 1]]
  - [[-1, 3], 1, Concat, [1]] # cat head P5 10
  - [-1, 1, C3k2, [1024, True, 0.5, True]] # 11 (P5/32-large)

  # RTDETRDecoder - ALL positional arguments must match __init__ signature
  # [nc, ch, hd, nq, ndp, nh, ndl, d_ffn, dropout, act, eval_idx, nd, label_noise_ratio, box_noise_scale, learnt_init_query]
  - [[7, 9, 11], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3, 1024, 0.0, "relu", -1, 100, 0.5, 1.0, False, False]]

loss: 
  gamma: 2.0
  alpha: 0.75
  loss_gain: {class: 1, bbox: 5, giou: 2}
  matcher:
    cost_gain: {class: 2, bbox: 5, giou: 2}
