# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics RT-DETR-ResNet50 hybrid object detection model with P3/8 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/rtdetr
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes

backbone:
  # [from, repeats, module, args]
  - [-1, 1, TorchVision, [512, resnet50, DEFAULT, True, 2, True]]
  - [0, 1, Index, [512, 6]]     # (1, 512, 80, 80)  - 1
  - [0, 1, Index, [1024, 7]]    # (1, 1024, 40, 40) - 2
  - [0, 1, Index, [2048, 8]]    # (1, 2048, 20, 20) - 3

head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 4
  - [-1, 1, AIFI, [1024, 8]]
  - [-1, 1, Conv, [256, 1, 1]] # 6

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [2, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 8
  - [[-2, -1], 1, Concat, [1]]
  - [-1, 3, RepC3, [256]] # 10
  - [-1, 1, Conv, [256, 1, 1]] # 11

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [1, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 13
  - [[-2, -1], 1, Concat, [1]] # cat backbone P4
  - [-1, 3, RepC3, [256]] # X3 (15), fpn_blocks.1

  - [-1, 1, Conv, [256, 3, 2]] # 16, downsample_convs.0
  - [[-1, 11], 1, Concat, [1]] # cat Y4
  - [-1, 3, RepC3, [256]] # F4 (18), pan_blocks.0

  - [-1, 1, Conv, [256, 3, 2]] # 19, downsample_convs.1
  - [[-1, 6], 1, Concat, [1]] # cat Y5
  - [-1, 3, RepC3, [256]] # F5 (21), pan_blocks.1

  # - [[15, 18, 21], 1, RTDETRDecoder, [nc]] # Detect(P3, P4, P5)
  - [[15, 18, 21], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 6, 1024, 0.0, "relu", -1, 200, 0.5, 1.0, False, False]]
