# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics RT-DETR-ResNet50 hybrid object detection model with P3/8 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/rtdetr
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
# Ultralytics RT-DETR with timm ResNet50 backbone

nc: 80

backbone:
  # [from, repeats, module, args]
  - [-1, 1, PResNet, [512, 50, 'variant_d', 4, [1, 2, 3], "relu", 0, True, True, True]]
  - [0, 1, Index, [512, 1]]
  - [0, 1, Index, [1024, 2]]
  - [0, 1, Index, [2048, 3]]

head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 4
  - [-1, 1, AIFI, [1024, 8]]
  - [-1, 1, Conv, [256, 1, 1]] # 6

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [2, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 8
  - [[-2, -1], 1, Concat, [1]]
  - [-1, 3, RepC3, [256]] # 10
  - [-1, 1, Conv, [256, 1, 1]] # 11

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [1, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 13
  - [[-2, -1], 1, Concat, [1]]
  - [-1, 3, RepC3, [256]] # 15

  - [-1, 1, Conv, [256, 3, 2]] # 16
  - [[-1, 11], 1, Concat, [1]]
  - [-1, 3, RepC3, [256]] # 18

  - [-1, 1, Conv, [256, 3, 2]] # 19
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 3, RepC3, [256]] # 21

  - [[15, 18, 21], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 6, 1024, 0.0, "relu", -1, 100, 0.5, 1.0, False, True, 3, True]]


loss: 
  gamma: 2.0
  alpha: 0.75
  loss_gain: {class: 1, bbox: 5, giou: 2}
  matcher:
    cost_gain: {class: 2, bbox: 5, giou: 2}