# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license
#
# Stereo3DDet (P3-only) using YOLO11 bbox mapping (TaskAlignedAssigner positives)
#
# This config keeps the same backbone/neck as stereo3ddet_full.yaml but replaces the final head.

stereo: true
input_channels: 6
nc: 3

backbone:
  - [-1, 1, StereoConv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]  # P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]  # P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]  # P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]
  - [-1, 2, C2PSA, [1024]]

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, False]]  # 16 (P3/8)

  # P3-only YOLO11-mapped head (Detect + aux stereo/3D branches)
  - [[16], 1, Stereo3DDetHeadYOLO11, [nc, 256]]



