# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO Anomaly v2 — cached prior + mask gate, with WEAKER prior augments (aug2). Identical to
# yolo26-anomaly-v2-film-gauss-cached-aug1-maskgate.yaml except every prior-robustness aug is
# roughly halved (aug1 -> aug2). Rationale: the aug1 set (distractor/erase/warp/mixup) plus
# p_drop systematically teaches the model "prior is unreliable", which drives the FiLM alpha to
# ~0.01 (prior barely moves detection). Softening the augs should let the model trust the prior
# more (alpha grows). Clean A/B vs the aug1-maskgate run — only the aug strengths differ.
# Branch: yoloa_v2_queryfilm.

nc: 80
end2end: True
reg_max: 1
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

anomaly_v2:
  mask_size: 80
  mask_mode: gauss
  sigma_factor: [0.20, 0.40]     # narrowed from [0.15,0.45]
  p_drop: 0.5
  seg_branch: false
  bb_layers: [6]
  bb_temperature: 5.0
  bb_K: 9
  bb_auto_temperature: false
  bb_calibration_target_score: 0.5
  bb_calibrate: compactness
  mb_queue_capacity: 0
  mb_cached_prior: true
  mb_cached_mask_gate: true
  mb_blend_p: 0.5
  fusion_mode: film
  film_groups: 16
  film_group_dim: 16
  # --- aug2: weaker prior-robustness augments (≈half of aug1) ---
  mask_jitter: 0.01              # aug1 0.02
  mask_box_drop_p: 0.05          # aug1 0.1
  mask_distractor_p: 0.12        # aug1 0.25
  mask_distractor_n: 1           # aug1 2
  mask_erase_p: 0.08             # aug1 0.15
  mask_warp_p: 0.08              # aug1 0.15
  mask_mixup_p: 0.08             # aug1 0.15
  mask_mixup_alpha: 0.4

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5, 3, True]]
  - [-1, 2, C2PSA, [1024]]

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, True]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 1, C3k2, [1024, True, 0.5, True]]

  - [[16, 19, 22], 1, Detect, [nc]]
