# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO Anomaly v2 SOFT-HINT + WEAKER prior augmentation (aug1).
# Same as yolo26-anomaly-v2-softhint-aug.yaml but every new prior-aug knob is ~halved. Motivation:
# at full strength the prior got so degraded the model stopped using it (prior had no effect). aug1
# keeps the prior informative enough to be leaned on, while still training some robustness.
# Only the aug strengths change vs softhint-aug (p_drop=0.5 and sigma_factor unchanged), so this is
# a clean strong-vs-weak augmentation A/B. Branch: yoloa_v2_queryfilm.

nc: 80
end2end: True
reg_max: 1
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

anomaly_v2:
  mask_size: 80
  mask_mode: gauss
  sigma_factor: [0.15, 0.45]     # per-bbox width randomization (train); midpoint at eval
  p_drop: 0.5                    # 50% of the batch trains with NO prior (unchanged)
  seg_branch: false
  bb_layers: [6]                 # memory bank for prior_mode="heatmap" (dormant during training)
  bb_temperature: 3.0
  bb_K: 9
  bb_auto_temperature: true
  bb_calibration_target_score: 0.5
  bb_calibrate: compactness
  # --- WEAKER prior-robustness augments (~half of softhint-aug) ---
  mask_jitter: 0.02              # was 0.05
  mask_box_drop_p: 0.1           # was 0.3
  mask_distractor_p: 0.25        # was 0.5
  mask_distractor_n: 2           # was 4
  mask_erase_p: 0.15             # was 0.3
  mask_warp_p: 0.15              # was 0.3
  mask_mixup_p: 0.15             # was 0.3
  mask_mixup_alpha: 0.4          # was 0.5

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5, 3, True]]
  - [-1, 2, C2PSA, [1024]]

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, True]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 1, C3k2, [1024, True, 0.5, True]]

  - [[16, 19, 22], 1, Detect, [nc]]
