# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO Anomaly v2 — softhint (bias) + pure GT-mask prior, aug3. NO cached heatmap, NO gate.
# Derived from yolo26-anomaly-v2-softhint-maskonly-aug2.yaml with two changes:
#   (1) location-honest: mask_distractor_p and mask_mixup_p set to 0 — the prior never puts
#       energy at a non-defect location, only its shape/coverage/intensity is imperfect;
#   (2) mask_mag_range [0.7, 1] — per-sample peak scaling U(0.7, 1.0), mimics the weak-peak
#       soft heatmap seen at inference (vs the binary peak-1 GT mask).
# Prior is the augmented GT gauss mask only, every batch (trainer leaves prior_mode=None ->
# _resolve_fusion_mask). bb_layers kept for inference-time bank rebuild (prior_mode="heatmap").
# Branch: yoloa_v2_queryfilm.

nc: 80
end2end: True
reg_max: 1
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

anomaly_v2:
  mask_size: 80
  mask_mode: gauss
  sigma_factor: [0.20, 0.40]
  p_drop: 0.5
  seg_branch: false
  bb_layers: [6]
  bb_temperature: 5.0
  bb_K: 9
  bb_auto_temperature: false
  bb_calibration_target_score: 0.5
  bb_calibrate: compactness
  mb_queue_capacity: 0
  mb_cached_prior: false         # NO cached heatmap channel
  mb_cached_mask_gate: false     # NO gate (prior = augmented GT mask only)
  fusion_mode: bias
  # aug3: aug2 (half-strength augs) + location-honest (distractor/mixup OFF) + magnitude scaling
  mask_jitter: 0.01
  mask_box_drop_p: 0.05
  mask_distractor_p: 0.0         # aug2 0.12 — OFF: prior never lies about location
  mask_distractor_n: 1           # unused (distractor_p=0); kept for parity
  mask_erase_p: 0.08
  mask_warp_p: 0.08
  mask_mixup_p: 0.0              # aug2 0.08 — OFF: no wrong-location soft blend
  mask_mixup_alpha: 0.4          # unused (mixup_p=0); kept for parity
  mask_mag_range: [0.7, 1]      # per-sample prior peak ~U(0.7, 1.0)

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5, 3, True]]
  - [-1, 2, C2PSA, [1024]]

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, True]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 1, C3k2, [1024, True, 0.5, True]]

  - [[16, 19, 22], 1, Detect, [nc]]
