# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO Anomaly v2 QueryFiLM (k16) + PRIOR AUGMENTATION. Identical architecture to
# yolo26-anomaly-v2-queryfilm.yaml; only the training-time input prior is degraded to look like
# the inference heatmap (memory bank), closing the train(clean sharp gauss)/infer(diffuse, noisy
# memory-bank heatmap) gap that makes inference boxes inflate to the heatmap blob and fires on
# soft background (false positives on normal samples). Augmentation hits ONLY the input prior fed
# to the FiLM branch; the per-instance QueryFiLM GT supervision masks (queryfilm_gt_sigma) stay
# clean. Magnitude weakening is intentionally OFF (mask_mag_range default [1.0, 1.0]): the
# global-FiLM sweep found peak-weakening teaches an over-large gain -> spurious soft-background
# detections, the opposite of what we want here. Width randomization (sigma_factor range) is the
# on-target axis for over-large boxes. Branch: yoloa_v2_queryfilm.

nc: 80
end2end: True
reg_max: 1
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

anomaly_v2:
  mask_size: 80
  mask_mode: gauss
  sigma_factor: [0.25, 0.75]   # per-bbox U(lo,hi) width randomization at train; midpoint at eval
  p_drop: 0.5
  seg_branch: false
  bb_layers: [6]                 # memory bank for prior_mode="heatmap" (dormant during training)
  bb_temperature: 3.0
  bb_K: 9
  bb_auto_temperature: true
  bb_calibration_target_score: 0.5
  bb_calibrate: compactness
  fusion_mode: queryfilm
  queryfilm_k: 16          # number of learned queries
  queryfilm_dim: 128       # query embedding dim D
  queryfilm_groups: 16     # FiLM groups G (must divide P3 channels)
  queryfilm_alpha_init: 1.0e-4  # LayerScale; nonzero so film_mlp gets gradient. Zero-init film head
                               # already gives exact identity at init; alpha=0 too deadlocks both
                               # (dL/dfilm ~ alpha=0, dL/dalpha ~ film=0 -> branch never escapes).
  queryfilm_w_mask: 0.05   # Dice+BCE query-mask supervision gain
  queryfilm_w_obj: 0.10    # objectness BCE gain
  queryfilm_w_overlap: 0.01  # query-collapse guard gain
  queryfilm_gt_sigma: 0.15  # gauss sigma for per-instance GT masks (sharper than the prior)
  # Prior augmentation (training only) -- degrade the input prior toward the inference heatmap:
  mask_blur_sigma_max: 2.0     # random Gaussian blur sigma -> soft edges
  mask_noise_std: 0.05         # mild additive noise (imperfect heatmap)
  # mask_mag_range left default [1.0, 1.0] (OFF): peak-weakening -> over-large gain -> FP.

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5, 3, True]]
  - [-1, 2, C2PSA, [1024]]

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, True]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 1, C3k2, [1024, True, 0.5, True]]

  - [[16, 19, 22], 1, Detect, [nc]]
