# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO Anomaly v2 — clsgrad per-scale SIGMOID gate (milder than tanh mul).
# Fork of yolo26-anomaly-clsgrad-perscale-fload-flr01-mul — IDENTICAL except fusion_apply:
#   mul -> sigmoid (p * 2*sigmoid(delta), factor in [0,2]).
# sigmoid produces milder gating than tanh at the same |delta| — the factor stays closer to 1,
# so it's less prone to over-gate (full-suppress or full-amplify) under lr0.1 near-frozen fusion.
# Clean single-var sigmoid-vs-tanh A/B.
# Branch: yoloa_clean_louis.

nc: 80
end2end: True
reg_max: 1
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

anomaly_v2:
  mask_size: 80
  mask_mode: gauss
  sigma_factor: [0.20, 0.40]
  p_drop: 0.5
  bb_layers: [6]
  fusion_mode: bias
  fusion_target: all_clsgrad
  fusion_apply: sigmoid            # p * 2*sigmoid(delta) — bounded gate in [0,2], milder than tanh
  fusion_lr_scale: 0.1
  fusion_per_scale: true
  fusion_load: runs/yoloa_clean/26l_yoloav2_v8.2_clsgrad_flr4_perscale_v1/weights/best.pt
  mask_jitter: 0.01
  mask_box_drop_p: 0.05
  mask_distractor_p: 0.0
  mask_distractor_n: 1
  mask_erase_p: 0.08
  mask_warp_p: 0.08
  mask_mixup_p: 0.08
  mask_mixup_alpha: 0.4
  mask_mag_range: [0.7, 1]
  mask_aug_passes: 2
  val_mask_prior: false
  test_val_freq: 1
  test_categories: null
  test_none_prior: true
  test_heatmap_prior: true
  test_mask_prior: false
  test_fit_cfg: ../../yoloa_fit_default.yaml
  mask_fragment_p: 0.0
  mask_fragment_n: 4
  mask_bg_blobs_p: 0.0
  mask_bg_blobs_n: 8
  mask_bg_blobs_sigma: [0.03, 0.08]
  mask_coherent_noise_p: 0.0
  mask_coherent_noise_sigma: [0.05, 0.15]
  mask_bg_blobs_amp: [0.05, 0.15]
  mask_coherent_noise_amp: [0.02, 0.06]
  mask_floor: [0.0, 0.0]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5, 3, True]]
  - [-1, 2, C2PSA, [1024]]

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, True]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 1, C3k2, [1024, True, 0.5, True]]

  - [[16, 19, 22], 1, Detect, [nc]]
