# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO Anomaly — neck-level heatmap-fusion variant.
# The anomaly heatmap is fused into each detection-scale neck feature *before*
# its C3k2 refinement block, and a standard Detect head produces the final
# predictions. This mirrors the head-level soft-hint fusion in
# yolo26-anomaly.yaml but lets the neck C3k2 modules process heatmodulated
# features directly.

nc: 80
end2end: True
reg_max: 1
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

anomaly:
  mask_size: 80
  mask_mode: gauss
  sigma_factor: [0.20, 0.40]
  p_drop: 0.5
  bb_layers: [6]
  fusion_mode: bias
  mask_jitter: 0.01
  mask_box_drop_p: 0.0
  mask_distractor_p: 0.0
  mask_distractor_n: 1
  mask_erase_p: 0.08
  mask_warp_p: 0.08
  mask_mixup_p: 0.08
  mask_mixup_alpha: 0.4
  mask_mag_range: [0.7, 1]
  mask_aug_passes: 2
  val_mask_prior: false
  test_val_freq: 1
  test_categories: null
  test_none_prior: false
  test_heatmap_prior: true

  mask_fragment_p: 0.0
  mask_fragment_n: 4
  mask_bg_blobs_p: 0.0
  mask_bg_blobs_n: 8
  mask_bg_blobs_sigma: [0.03, 0.08]
  mask_coherent_noise_p: 0.0
  mask_coherent_noise_sigma: [0.05, 0.15]
  mask_bg_blobs_amp: [0.05, 0.15]
  mask_coherent_noise_amp: [0.02, 0.06]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5, 3, True]]
  - [-1, 2, C2PSA, [1024]]

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 1, HeatmapNeckFusion, [32, 80, False]]
  - [-1, 2, C3k2, [256, True]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 1, HeatmapNeckFusion, [32, 80, False]]
  - [-1, 2, C3k2, [512, True]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 1, HeatmapNeckFusion, [32, 80, False]]
  - [-1, 1, C3k2, [1024, True, 0.5, True]]

  - [[17, 21, 25], 1, Detect, [nc]]
