# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO Anomaly v2 SOFT-HINT — yolo26 detection backbone + bounded additive bias on PAN.
# Replaces the multiplicative per-channel gate (Phase 0/2) with HeatmapBiasFusion:
# a 1-channel bounded bias added (broadcast) to PAN P3/P4/P5 before Detect.
# Branch: yoloa_v2_softhint. Spec: docs_yoloa_v2/specs/2026-06-02-softhint-fusion-design.md.

# Parameters
nc: 80
end2end: True
reg_max: 1
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# Anomaly v2 config (read by YOLOAnomalyV2Model.__init__).
anomaly_v2:
  mask_size: 80
  mask_mode: rect
  sigma_factor: 0.25
  p_drop: 0.5
  # Softhint defaults: no seg branch, no aug knobs (single-variable first run).
  seg_branch: false
  mask_shuffle_p: 0.0
  mask_noise_std: 0.0

# Backbone (identical to yolo26.yaml)
backbone:
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5, 3, True]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

# Head (identical to yolo26.yaml)
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]] # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, True]] # 16

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]] # 19

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 1, C3k2, [1024, True, 0.5, True]] # 22

  - [[16, 19, 22], 1, Detect, [nc]]
