# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO Anomaly v2 QueryFiLM — softmax + foreground/background (null-slot) supervision. Extends
# yolo26-anomaly-v2-queryfilm-softmax.yaml with ONE change: queryfilm_w_fg > 0. This adds a loss
# pushing the foreground occupancy Σ_k A_k (= 1 - null prob) toward the GT-instance union, i.e.
# background pixels are routed to the null slot and foreground to the real queries. Motivation:
# the softmax run collapsed to one working query (q11) while the other queries' UNSUPERVISED
# background attention injected detection noise (alpha grew to ~1.2, amplifying it) — the null
# slot never got a "background belongs to you" signal. This term supplies it; on good (no-defect)
# images F=0 everywhere, so all attention is pushed to null (fewer clean-image false positives).
# Identity-at-init + ONNX-cleanness unchanged (fg_pred is an aux-only sum, training loss only).
# A/B against yolo26-anomaly-v2-queryfilm-softmax.yaml (only diff = queryfilm_w_fg).
# Branch: yoloa_v2_queryfilm.

nc: 80
end2end: True
reg_max: 1
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

anomaly_v2:
  mask_size: 80
  mask_mode: gauss
  sigma_factor: 0.25
  p_drop: 0.5
  seg_branch: false
  bb_layers: [6]                 # memory bank for prior_mode="heatmap" (dormant during training)
  bb_temperature: 3.0
  bb_K: 9
  bb_auto_temperature: true
  bb_calibration_target_score: 0.5
  bb_calibrate: compactness
  fusion_mode: queryfilm
  queryfilm_softmax: true
  queryfilm_k: 16
  queryfilm_dim: 128
  queryfilm_groups: 16
  queryfilm_alpha_init: 1.0e-4
  queryfilm_w_mask: 0.05
  queryfilm_w_obj: 0.10
  queryfilm_w_overlap: 0.01
  queryfilm_w_fg: 0.10      # foreground/background (null-slot) supervision: bg -> null, fg -> queries
  queryfilm_gt_sigma: 0.15

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5, 3, True]]
  - [-1, 2, C2PSA, [1024]]

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, True]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 1, C3k2, [1024, True, 0.5, True]]

  - [[16, 19, 22], 1, Detect, [nc]]
