# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO Anomaly v2 QueryFiLM — softmax + fg/bg + fixed 2D positional encoding (DETR-style). ONLY
# change vs yolo26-anomaly-v2-queryfilm-softmax-fgbg.yaml: queryfilm_pos: true. A fixed (non-learnable)
# 2D sinusoidal pos-enc is added to the attention KEY (feat+pe) — not the pooled value — so each
# query's learnable attention vector can specialize by position as well as content (each query can
# "query a different region"). Motivation: the K=16 softmax run collapsed onto one query; per-query
# vectors already exist (the attn conv filters), but without a spatial prior + multi-instance signal
# they don't differentiate. PE supplies the spatial prior, as in DETR (which pairs learnable object
# queries with a fixed spatial pos-enc on the image features). Parameter-free, resolution-agnostic,
# identity-at-init preserved. CAVEAT: this is region-based (not instance-based) specialization and a
# fixed positional anchor is a weak prior for defects-anywhere — the bar is beating global FiLM (0.5613).
# A/B against yolo26-anomaly-v2-queryfilm-softmax-fgbg.yaml (only diff = queryfilm_pos).
# Branch: yoloa_v2_queryfilm.

nc: 80
end2end: True
reg_max: 1
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

anomaly_v2:
  mask_size: 80
  mask_mode: gauss
  sigma_factor: 0.25
  p_drop: 0.5
  seg_branch: false
  bb_layers: [6]                 # memory bank for prior_mode="heatmap" (dormant during training)
  bb_temperature: 3.0
  bb_K: 9
  bb_auto_temperature: true
  bb_calibration_target_score: 0.5
  bb_calibrate: compactness
  fusion_mode: queryfilm
  queryfilm_softmax: true
  queryfilm_pos: true       # fixed 2D sincos pos-enc on attention keys (DETR-style)
  queryfilm_k: 16
  queryfilm_dim: 128
  queryfilm_groups: 16
  queryfilm_alpha_init: 1.0e-4
  queryfilm_w_mask: 0.05
  queryfilm_w_obj: 0.10
  queryfilm_w_overlap: 0.01
  queryfilm_w_fg: 0.10
  queryfilm_gt_sigma: 0.15

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5, 3, True]]
  - [-1, 2, C2PSA, [1024]]

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, True]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 1, C3k2, [1024, True, 0.5, True]]

  - [[16, 19, 22], 1, Detect, [nc]]
