# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO Anomaly v2 QueryFiLM — softmax-over-queries (Slot-Attention-style) variant of
# yolo26-anomaly-v2-queryfilm.yaml. The ONLY architectural change is queryfilm_softmax: true:
# the K query attention maps compete per pixel via a softmax over K+1 slots (K queries + 1
# null/background sink), with a learnable temperature. This breaks the v0 collapse where one
# greedy query claimed every region and the rest stayed dead (independent sigmoids let queries
# overlap freely). The null slot absorbs unclaimed background so defect queries aren't forced
# to fire on it. Identity-at-init and ONNX-cleanness are preserved (zero-init FiLM head ->
# delta==0 at start; Softmax is a standard op). A/B against yolo26-anomaly-v2-queryfilm.yaml
# (sigmoid v0, same K=16/gauss/p_drop). Branch: yoloa_v2_queryfilm.

nc: 80
end2end: True
reg_max: 1
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

anomaly_v2:
  mask_size: 80
  mask_mode: gauss
  sigma_factor: 0.25
  p_drop: 0.5
  seg_branch: false
  fusion_mode: queryfilm
  queryfilm_softmax: true   # compete across K+1 slots (K queries + null sink); learnable temperature
  queryfilm_k: 16          # number of learned queries
  queryfilm_dim: 128       # query embedding dim D
  queryfilm_groups: 16     # FiLM groups G (must divide P3 channels)
  queryfilm_alpha_init: 1.0e-4  # LayerScale; nonzero so film_mlp gets gradient (see queryfilm.yaml)
  queryfilm_w_mask: 0.05   # Dice+BCE query-mask supervision gain
  queryfilm_w_obj: 0.10    # objectness BCE gain
  queryfilm_w_overlap: 0.01  # collapse guard; partly redundant under softmax but kept for a clean A/B
  queryfilm_gt_sigma: 0.15  # gauss sigma for per-instance GT masks (sharper than the prior)

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5, 3, True]]
  - [-1, 2, C2PSA, [1024]]

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, True]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 1, C3k2, [1024, True, 0.5, True]]

  - [[16, 19, 22], 1, Detect, [nc]]
