# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO Anomaly v2 — softhint (bias) + polygon mask prior, NO mask augmentation.
# Derived from the seg config; zeros out all mask_aug knobs to verify the
# polygon→prior pipeline is correct before re-enabling augs.
# Branch: yoloa_clean.

nc: 80
end2end: True
reg_max: 1
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

anomaly_v2:
  mask_size: 80
  mask_mode: gauss
  sigma_factor: [0.20, 0.40]
  p_drop: 0.5
  # SegBranch + polygon target
  seg_branch: true
  seg_target_polygon: true
  seg_gain: 1.0
  seg_detach: true
  seg_alpha_mode: curriculum
  bb_layers: [6]
  bb_temperature: 5.0
  bb_K: 9
  bb_auto_temperature: false
  bb_calibration_target_score: 0.5
  bb_calibrate: compactness
  mb_queue_capacity: 0
  mb_cached_prior: false
  mb_cached_mask_gate: false
  fusion_mode: bias
  # ALL mask augmentations OFF — verify polygon prior pipeline
  mask_jitter: 0.0
  mask_box_drop_p: 0.0
  mask_distractor_p: 0.0
  mask_distractor_n: 1
  mask_erase_p: 0.0
  mask_warp_p: 0.0
  mask_mixup_p: 0.0
  mask_mixup_alpha: 0.4
  mask_mag_range: [1.0, 1.0]
  # OOD eval
  mvtec_ood_val_freq: 1
  mvtec_ood_categories: null   # null = all 15 MVTec categories
  mvtec_ood_fit_cfg: ../../yoloa_fit_default.yaml

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5, 3, True]]
  - [-1, 2, C2PSA, [1024]]

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, True]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 1, C3k2, [1024, True, 0.5, True]]

  - [[16, 19, 22], 1, Detect, [nc]]
