# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO Anomaly v2 — clsgrad per-scale MUL gate, ITERATIVE fusion warm-start (round 2).
# Fork of yolo26-anomaly-clsgrad-perscale-fload-flr01-mul — IDENTICAL except fusion_load donor:
#   round 1 (mul_v1): warm-start from an ADDITIVE-trained fusion (regime mismatch) -> lr0.1 near-frozen.
#   round 2 (this):   warm-start from mul_v1's OWN last.pt (mul-regime fusion, trained the full 10ep
#                     = most-adapted; last.pt > best.pt here since best.pt may sit at an early-fitness
#                     epoch whose fusion barely moved) -> iterate.
# Since fusion_lr_scale 0.1 barely moves the fusion per run, iterating (warm-start from the previous
# mul round) accumulates the mul-regime adaptation across rounds while keeping each round stable.
# ⚠️ Requires 26m_yoloav2_v8.2_clsgrad_flr01_perscale_mul_v1 to have FINISHED (its last.pt is the donor)
# -> launch with --after that run.
# Branch: yoloa_clean_louis.

nc: 80
end2end: True
reg_max: 1
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

anomaly_v2:
  mask_size: 80
  mask_mode: gauss
  sigma_factor: [0.20, 0.40]
  p_drop: 0.5
  bb_layers: [6]
  fusion_mode: bias
  fusion_target: all_clsgrad       # all-mode forward; fusion module gets cls-path gradients only
  fusion_apply: mul                # p * (1 + tanh(delta)) — bounded multiplicative gate
  fusion_lr_scale: 0.1             # near-frozen, preserve warm-start
  fusion_per_scale: true           # unshared fusion conv across P3/P4/P5 (must match the donor format)
  fusion_load: runs/yoloa_clean/26m_yoloav2_v8.2_clsgrad_flr01_perscale_mul_v1/weights/last.pt
  # aug3 base + mixup re-enabled (aug2 strength) — only diff vs aug3
  mask_jitter: 0.01
  mask_box_drop_p: 0.05
  mask_distractor_p: 0.0         # still OFF
  mask_distractor_n: 1
  mask_erase_p: 0.08
  mask_warp_p: 0.08
  mask_mixup_p: 0.08              # RE-ENABLED: additive other-sample blend
  mask_mixup_alpha: 0.4
  mask_mag_range: [0.7, 1]
  mask_aug_passes: 2             # reproduce v5 double-augment (v7 default is 1)
  # in-dist val: mask-off (vanilla floor) always runs; mask-on prior pass optional
  val_mask_prior: false        # skip the mask-ON (prior) in-dist pass -> ~halves in-dist val time
  # test (cross-dataset MVTec) eval
  test_val_freq: 1
  test_categories: null        # null = all 15 MVTec categories
  test_none_prior: true        # test prior=none — required (fitness = test_metrics(none_prior)/mAP10_50)
  test_heatmap_prior: true     # test prior=heatmap — core fusion signal (optional)
  test_mask_prior: false       # test prior=mask (mask_on)
  test_fit_cfg: ../../yoloa_fit_default.yaml


  # new augs, turned off by default for now
  mask_fragment_p: 0.0
  mask_fragment_n: 4
  mask_bg_blobs_p: 0.0
  mask_bg_blobs_n: 8
  mask_bg_blobs_sigma: [0.03, 0.08]
  mask_coherent_noise_p: 0.0
  mask_coherent_noise_sigma: [0.05, 0.15]
  mask_bg_blobs_amp: [0.05, 0.15]
  mask_coherent_noise_amp: [0.02, 0.06]
  mask_floor: [0.0, 0.0]
  # mask_bg_blobs_amp: [0.08, 0.20]
  # mask_coherent_noise_amp: [0.03, 0.08]
  # mask_floor: [0.02, 0.05]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5, 3, True]]
  - [-1, 2, C2PSA, [1024]]

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, True]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 1, C3k2, [1024, True, 0.5, True]]

  - [[16, 19, 22], 1, Detect, [nc]]
