# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO Anomaly v2 — MoCo FIFO bank, 1M-capacity variant. Identical to
# yolo26-anomaly-v2-film-gauss-mocobank.yaml except mb_queue_capacity (50k -> 1M): the 50k
# queue spreads ~250 patches/class over the multi-class train set, too sparse for contrastive
# top-K scoring (epoch-0 viz showed near-zero defect/normal contrast); 1M gives ~5k/class,
# approaching per-category inference-bank density. Costs ~2 GB fp32 in VRAM + checkpoints and
# a chunked-similarity scoring pass (score_chunk_elems). Initial fill is dense until first
# full, then rotates at capacity/steps per step for epoch-wide coverage.
# Branch: yoloa_v2_queryfilm.

nc: 80
end2end: True
reg_max: 1
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

anomaly_v2:
  mask_size: 80
  mask_mode: gauss
  sigma_factor: 0.25
  p_drop: 0.5
  seg_branch: false
  bb_layers: [6]
  bb_temperature: 5.0            # FIXED beta: auto-calib rails at the 20.0 clamp on queue banks
  bb_K: 9                        # (self-dense rows) and saturates the heatmap; beta-sweep on a
  bb_auto_temperature: false     # dense bottle bank put the defect/good separation optimum at 5
  bb_calibration_target_score: 0.5
  bb_calibrate: compactness      # unused in queue mode (no freeze_memory_bank); kept for parity
  mb_queue_capacity: 1000000     # 1M FIFO slots (~5k patches/class on merge_data_v5; ~2 GB fp32)
  mb_blend_p: 0.5                # P(prior_mode="heatmap") per training batch
  fusion_mode: film
  film_groups: 16
  film_group_dim: 16

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5, 3, True]]
  - [-1, 2, C2PSA, [1024]]

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, True]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 1, C3k2, [1024, True, 0.5, True]]

  - [[16, 19, 22], 1, Detect, [nc]]
