# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Smoke test: minimal Segment(head) config for coco128-seg.
# Validates YOLOAnomalyV2SegModel + v8SegmentationLoss end-to-end.

nc: 80
end2end: True
reg_max: 1
scales:
  n: [0.50, 0.25, 1024]

anomaly_v2:
  mask_size: 80
  mask_mode: gauss
  sigma_factor: [0.20, 0.40]
  p_drop: 0.0
  seg_branch: false
  fusion_mode: bias
  mask_jitter: 0.0
  mask_box_drop_p: 0.0
  mask_distractor_p: 0.0
  mask_erase_p: 0.0
  mask_warp_p: 0.0
  mask_mixup_p: 0.0
  mvtec_ood_val_freq: 0

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5, 3, True]]
  - [-1, 2, C2PSA, [1024]]

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, True]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 1, C3k2, [1024, True, 0.5, True]]

  - [[16, 19, 22], 1, Segment, [nc, 32, 256]]
