# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO Anomaly v2 — cached prior gated by augmented GT mask (mb_cached_mask_gate). Same as
# Train images carry a precomputed per-source-category bank heatmap (runs/temp/
# precompute_mb_heatmaps.py -> <root>/heatmaps_v1/<split>/<stem>.png) as a 4th channel:
# scored on CLEAN images (mosaic/HSV destroy online-query contrast 4x), then transformed
# geometrically with the image like a mask. Per batch: prior_mode="cached" with
# p=mb_blend_p, else the legacy GT gauss path WITH the aug1 structural augmentations.
# bb_layers stay for inference-time bank rebuild (prior_mode="heatmap"); the online FIFO
# queue is disabled (mb_queue_capacity 0). Prior is static (pretrained epoch-0 features).
# Branch: yoloa_v2_queryfilm.

nc: 80
end2end: True
reg_max: 1
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

anomaly_v2:
  mask_size: 80
  mask_mode: gauss
  sigma_factor: [0.15, 0.45]     # per-bbox width randomization (train); midpoint at eval
  p_drop: 0.5
  seg_branch: false
  bb_layers: [6]
  bb_temperature: 5.0            # fixed beta, matches the precompute job
  bb_K: 9
  bb_auto_temperature: false
  bb_calibration_target_score: 0.5
  bb_calibrate: compactness      # unused (no freeze in queue/cached modes); kept for parity
  mb_queue_capacity: 0           # online FIFO queue OFF — prior comes from the cached channel
  mb_cached_prior: true
  mb_cached_mask_gate: true     # cached prior = cached_heatmap * augmented_mask (suppress out-of-box noise)
  mb_blend_p: 0.5                # P(prior_mode="cached") per training batch
  fusion_mode: film
  film_groups: 16
  film_group_dim: 16
  # --- softhint-aug1 weak prior-robustness augments (GT batches only by code gate) ---
  mask_jitter: 0.02
  mask_box_drop_p: 0.1
  mask_distractor_p: 0.25
  mask_distractor_n: 2
  mask_erase_p: 0.15
  mask_warp_p: 0.15
  mask_mixup_p: 0.15
  mask_mixup_alpha: 0.4

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5, 3, True]]
  - [-1, 2, C2PSA, [1024]]

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, True]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 1, C3k2, [1024, True, 0.5, True]]

  - [[16, 19, 22], 1, Detect, [nc]]
