# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO Anomaly v2.2 — SegBranch variant WITHOUT detach on the predicted heatmap.
# Identical to yolo26-anomaly-v2-seg.yaml except: seg_detach: false.
#
# Motivation: in v2.2 the predicted heatmap is detached before fusion, so det loss
# never flows back into SegBranch. Probe (scripts/probe_segbranch_pred.py) on the
# acur checkpoint showed pred has full dynamic range (max≈1, bg≈0) but localizes
# poorly — it learned to "match a rect" not "produce a heatmap that helps detect".
# Removing detach lets the fusion gradient train SegBranch to be detection-useful.
#
# Risk: seg loss (match rect) and det loss (be useful) may compete; may need to
# rebalance seg_gain if training is unstable. Starting with seg_gain=1.0 unchanged.
#
# Invocation example: model=yolo26m-anomaly-v2-seg-graddet.yaml

# Parameters
nc: 80 # number of classes
end2end: True
reg_max: 1
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512] # default (yolo26m)
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# Anomaly v2 specific config — SegBranch with det loss flowing through fusion.
anomaly_v2:
  mask_size: 80
  mask_mode: rect
  sigma_factor: 0.25
  p_drop: 0.5
  seg_branch: true
  seg_gain: 1.0
  seg_detach: false # KEY: let det loss train SegBranch via fusion path

# Backbone (identical to yolo26.yaml)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5, 3, True]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

# Head (identical to yolo26.yaml)
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, C3k2, [512, True]] # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, C3k2, [256, True]] # 16 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]] # cat head P4
  - [-1, 2, C3k2, [512, True]] # 19 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # cat head P5
  - [-1, 1, C3k2, [1024, True, 0.5, True]] # 22 (P5/32-large)

  - [[16, 19, 22], 1, Detect, [nc]] # Detect(P3, P4, P5)
