# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO Anomaly v2 — decoupled binary detection + multi-class defect-type head.
# Detection (box + confidence + matching) is trained binary via a 1-channel anomaly logit;
# the defect type is predicted by a separate head supervised only on matched positives, so the
# multi-class task no longer dilutes confidence (the cause of multi-class missed detections).
# At inference the two fuse into a standard [4 + nc] output (P_anom * softmax(type)/max), so the
# deployed/exported model is an ordinary nc-class detector. See AnomalyMCDetect / AnomalyMCLoss.
# Invocation example: model=yolo26m-anomaly-v2-mc.yaml  (scale 'm')

# Parameters
nc: 80 # number of classes (overridden by the dataset, e.g. nc=35 for merge_data_v5_multiclass_clean)
end2end: True
reg_max: 1
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512] # default (yolo26m)
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# Anomaly v2 specific config (read by YOLOAnomalyV2Model.__init__).
anomaly_v2:
  # Heatmap prior off for this experiment: isolate the detection/type decoupling. p_drop=1.0 keeps
  # the bias fusion exactly passthrough (vanilla YOLO features into both heads) every step.
  mask_size: 80
  mask_mode: rect
  p_drop: 1.0
  seg_branch: false
  # Decoupled type head:
  type_gain: 0.5 # weight of the type cross-entropy (raise toward better type acc, 0.0 = binary-only)
  type_tau: 1.0 # softmax temperature at fusion (small -> sharper / closer to one-hot)

# Backbone (identical to yolo26.yaml)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5, 3, True]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

# Head (identical to yolo26.yaml; only the final Detect -> AnomalyMCDetect)
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, C3k2, [512, True]] # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, C3k2, [256, True]] # 16 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]] # cat head P4
  - [-1, 2, C3k2, [512, True]] # 19 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # cat head P5
  - [-1, 1, C3k2, [1024, True, 0.5, True]] # 22 (P5/32-large)

  - [[16, 19, 22], 1, AnomalyMCDetect, [nc]] # AnomalyMCDetect(P3, P4, P5)
