# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# EVAL-ONLY variant of yolo26-anomaly-v2-queryfilm-softmax-fgbg.yaml: backbone/head/QueryFiLM are
# byte-identical (the fgbg checkpoint loads 1:1), but bb_layers is re-added so a BackboneMemoryBank
# is built at inference. Lets prior_mode="heatmap" feed a memory-bank heatmap into QueryFiLM —
# required by test_predict_visual_qf.py / test_query_knockout.py / test_predict_single_query.py to
# capture and visualize the query attention. seg_branch stays off. NOT for training.
# Branch: yoloa_v2_queryfilm.

nc: 80
end2end: True
reg_max: 1
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

anomaly_v2:
  mask_size: 80
  mask_mode: gauss
  sigma_factor: 0.25
  p_drop: 0.5
  bb_layers: [6]                 # eval-only: build a memory bank for prior_mode="heatmap"
  bb_temperature: 3.0
  bb_K: 9
  bb_auto_temperature: true
  bb_calibration_target_score: 0.5
  bb_calibrate: compactness
  seg_branch: false
  fusion_mode: queryfilm
  queryfilm_softmax: true
  queryfilm_k: 16
  queryfilm_dim: 128
  queryfilm_groups: 16
  queryfilm_alpha_init: 1.0e-4
  queryfilm_w_mask: 0.05
  queryfilm_w_obj: 0.10
  queryfilm_w_overlap: 0.01
  queryfilm_w_fg: 0.10
  queryfilm_gt_sigma: 0.15

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5, 3, True]]
  - [-1, 2, C2PSA, [1024]]

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, True]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 1, C3k2, [1024, True, 0.5, True]]

  - [[16, 19, 22], 1, Detect, [nc]]
