# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO Anomaly v2.2 — graddet variant with lower seg_gain.
# Identical to yolo26-anomaly-v2-seg-graddet.yaml except: seg_gain: 0.3.
#
# Rationale: with seg_detach=false, both seg_loss (match rect target) and det_loss
# (be useful for detection) train SegBranch. At seg_gain=1.0 the seg_loss may
# dominate and keep pred locked to "match rect" shapes. Lowering seg_gain lets
# det_loss pull pred toward detection-useful localizations while seg_loss still
# anchors against degeneracy.
#
# Direct ablation against `yolo26-anomaly-v2-seg-graddet.yaml` (sg=1.0):
#   if sg=0.3 > sg=1.0 -> seg_loss was too dominant, rebalancing helps.
#   if sg=0.3 ≈ sg=1.0 -> seg_gain is not the bottleneck.
#   if sg=0.3 < sg=1.0 -> seg_loss anchoring is essential, don't lower further.
#
# Invocation example: model=yolo26m-anomaly-v2-seg-graddet-sg03.yaml

# Parameters
nc: 80 # number of classes
end2end: True
reg_max: 1
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512] # default (yolo26m)
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# Anomaly v2 specific config — graddet with lower seg_gain.
anomaly_v2:
  mask_size: 80
  mask_mode: rect
  sigma_factor: 0.25
  p_drop: 0.5
  seg_branch: true
  seg_gain: 0.3 # KEY: lower than graddet's 1.0 to let det_loss take more of the steering
  seg_detach: false

# Backbone (identical to yolo26.yaml)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5, 3, True]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

# Head (identical to yolo26.yaml)
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, C3k2, [512, True]] # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, C3k2, [256, True]] # 16 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]] # cat head P4
  - [-1, 2, C3k2, [512, True]] # 19 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # cat head P5
  - [-1, 1, C3k2, [1024, True, 0.5, True]] # 22 (P5/32-large)

  - [[16, 19, 22], 1, Detect, [nc]] # Detect(P3, P4, P5)
