# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO Anomaly v2 — softhint (bias) + pure GT-mask prior, aug3 + mixup isolation.
# Derived from aug3: re-enables mask_mixup_p=0.08 (aug2 strength) as the ONLY diff.
# Purpose: isolate mixup's individual effect against the aug3+imgaug1 control.
# + OOD eval every epoch on 5 MVTec categories.
# Branch: yoloa_v2_queryfilm.

nc: 80
end2end: True
reg_max: 1
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

anomaly_v2:
  mask_size: 80
  mask_mode: gauss
  sigma_factor: [0.20, 0.40]
  p_drop: 0.5
  seg_branch: false
  bb_layers: [6]
  bb_temperature: 5.0
  bb_K: 9
  bb_auto_temperature: false
  bb_calibration_target_score: 0.5
  bb_calibrate: compactness
  fusion_mode: bias
  # aug3 base + mixup re-enabled (aug2 strength) — only diff vs aug3
  mask_jitter: 0.01
  mask_box_drop_p: 0.05
  mask_distractor_p: 0.0         # still OFF
  mask_distractor_n: 1
  mask_erase_p: 0.08
  mask_warp_p: 0.08
  mask_mixup_p: 0.08              # RE-ENABLED: additive other-sample blend
  mask_mixup_alpha: 0.4
  mask_mag_range: [0.7, 1]
  # OOD eval
  mvtec_ood_val_freq: 1
  mvtec_ood_categories: ["bottle", "cable", "capsule", "carpet", "grid"]
  mvtec_ood_fit_cfg: ../../yoloa_fit_default.yaml
  mask_fragment_p: 0.5
  mask_fragment_n: 4
  mask_bg_blobs_p: 0.5
  mask_bg_blobs_n: 8
  mask_bg_blobs_sigma: [0.03, 0.08]
  mask_coherent_noise_p: 0.5
  mask_coherent_noise_sigma: [0.05, 0.15]
  # mask_bg_blobs_amp: [0.05, 0.15]
  # mask_coherent_noise_amp: [0.02, 0.06]
  # mask_floor: [0.01, 0.03]
  mask_bg_blobs_amp: [0.08, 0.20]                                                                                                                                                      
  mask_coherent_noise_amp: [0.03, 0.08]                                                                                                                                                
  mask_floor: [0.02, 0.05]  
  seg_target_polygon: true

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5, 3, True]]
  - [-1, 2, C2PSA, [1024]]

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, True]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 1, C3k2, [1024, True, 0.5, True]]

  - [[16, 19, 22], 1, Detect, [nc]]
