# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO Anomaly v2 SOFT-HINT + PRIOR-ROBUSTNESS AUGMENTATION. Same architecture as
# yolo26-anomaly-v2-softhint.yaml (HeatmapBiasFusion additive prior, no SegBranch), but the
# GT-rendered prior is degraded during training so the model treats it as a soft hint, not gospel:
#   - p_drop 0.5 keeps HALF the batch with NO prior (so it never becomes prior-dependent);
#   - the kept half gets a spectrum of imperfections (mis-localized / missing / false-positive /
#     partial / deformed blobs), each applied with its own probability.
# Augs only touch the fusion prior; query/seg GT (none here) and detection labels are untouched.
# bb_layers is baked in (dormant in training, active for prior_mode="heatmap" at inference) so the
# same file serves train + inference. A/B vs the no-prior baseline yolo26-anomaly-v2-softhint-detonly.yaml.
# Branch: yoloa_v2_queryfilm.

nc: 80
end2end: True
reg_max: 1
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

anomaly_v2:
  mask_size: 80
  mask_mode: gauss
  sigma_factor: [0.15, 0.45]     # per-bbox width randomization (train); midpoint at eval
  p_drop: 0.5                    # 50% of the batch trains with NO prior (kept unchanged)
  seg_branch: false
  bb_layers: [6]                 # memory bank for prior_mode="heatmap" (dormant during training)
  bb_temperature: 3.0
  bb_K: 9
  bb_auto_temperature: true
  bb_calibration_target_score: 0.5
  bb_calibrate: compactness
  # --- prior-robustness augments (applied to the kept-prior 50%, each with its own prob) ---
  mask_jitter: 0.05              # bbox center offset ~U(-j,j) of image (mis-localized prior)
  mask_box_drop_p: 0.3           # per-box drop prob (prior misses some defects)
  mask_distractor_p: 0.5         # prob a sample gets other samples' blobs max-merged in
  mask_distractor_n: 4           #   up to N donors (false-positive hints at wrong places)
  mask_erase_p: 0.3              # zero a random sub-region of the blob (partial coverage)
  mask_warp_p: 0.3               # elastic deformation (irregular blob shape)
  mask_mixup_p: 0.3              # additive blend own + alpha*donor (soft distractor)
  mask_mixup_alpha: 0.5

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5, 3, True]]
  - [-1, 2, C2PSA, [1024]]

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, True]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 1, C3k2, [1024, True, 0.5, True]]

  - [[16, 19, 22], 1, Detect, [nc]]
