# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO Anomaly v2 — SegBranch as a prior-conditioned DENOISER/REFINER (seg_prior_cond).
#
# The redesign: fusion no longer sees the raw prior. Instead the SegBranch sits BETWEEN the
# prior and the fusion --
#     prior ─┐
#            ├─ concat ─► SegBranch ─► refined seg ─► softhint fusion ─► head_b
#  P3/P4 feat ┘
# At TRAIN time the SegBranch input is a coarse bbox-gauss prior corrupted with aug1 noise, and
# it is supervised to reconstruct the CLEAN v6 polygon mask (seg_target_polygon) -- one objective
# = denoise (aug1 -> clean) + refine (box -> true contour). Fusion always consumes the refined
# seg, never the raw/augmented prior, so the train(aug GT) vs deploy(mb-heatmap) distribution gap
# is absorbed by the refiner. At DEPLOY, a per-category memory bank built from normal samples
# produces the heatmap (set the predictor's prior_mode="heatmap") -> SegBranch refines it ->
# fusion -> head_b. aug1 is the train-time surrogate for the mb-heatmap's soft / displaced /
# false-positive noise (distractor ON teaches the refiner to SUPPRESS spurious blobs).
#
# Two-head (two_head: true): head_a (= model[-1]) sees RAW PAN -- the deployable honest floor,
# untouched by the refiner -> the change is safe-by-construction. head_b sees the prior-fused
# features. seg_detach: true keeps the SegBranch a pure denoiser (detection grad never flows back
# into it; it is trained only by its own BCE+Dice seg loss).
#
# Fusion = softhint (bias): P + beta*tanh(conv(seg)), beta init 0 (starts as vanilla YOLO) -- the
# gentlest, most deployable fusion; with a clean refined seg the heavier FiLM gating isn't needed.
# A/B = vs a softhint two-head run WITHOUT the refiner (same fusion -> isolates the refiner).
#
# Data: merge_data_v6_binary (segment, nc=1, polygons). Image-level augs ON (mosaic/HSV/flip/
# affine/mixup) but object_crop OFF (its custom crop risks desyncing polygons). Eval: MVTec 14.
# NOTE: seg_alpha / curriculum is a NO-OP here (fusion always uses the refined seg, never a
# GT/seg blend). Branch: yoloa_v2_twohead.

nc: 80
end2end: True
reg_max: 1
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

anomaly_v2:
  mask_size: 80
  mask_mode: gauss
  sigma_factor: [0.15, 0.45]     # per-bbox width randomization (train); midpoint at eval
  p_drop: 0.0                    # OFF -- two-head split makes per-sample mask dropout redundant
  two_head: true                 # head_a (raw PAN, deploy) + head_b (refined-seg-fused)
  head_b_gain: 1.0
  # --- SegBranch refiner ---
  seg_branch: true
  seg_prior_cond: true           # SegBranch concats the prior -> denoises/refines it
  seg_target_polygon: true       # seg target = v6 polygon union (precise defect shape)
  seg_detach: true               # pure denoiser: det loss never backprops into the SegBranch
  seg_gain: 1.0
  fusion_mode: bias              # softhint: P + beta*tanh(conv(refined_seg)), beta init 0
  # --- memory bank (inference-time mb-heatmap prior_mode="heatmap"); unused during training ---
  bb_layers: [6]
  bb_temperature: 5.0
  bb_K: 9
  bb_auto_temperature: false
  bb_calibration_target_score: 0.5
  bb_calibrate: compactness
  mb_queue_capacity: 0
  mb_cached_prior: false
  mb_cached_mask_gate: false
  # --- aug1 noise model on the SegBranch INPUT prior (mask-level; distinct from image augs) ---
  # distractor/mixup ON: the refiner learns to suppress false-positive / wrong-location blobs.
  mask_jitter: 0.02
  mask_box_drop_p: 0.1
  mask_distractor_p: 0.25
  mask_distractor_n: 2
  mask_erase_p: 0.15
  mask_warp_p: 0.15
  mask_mixup_p: 0.15
  mask_mixup_alpha: 0.4
  mask_blur_sigma_max: 2.0       # soft edges, like the mb-heatmap
  mask_mag_range: [0.7, 1]       # weak peak ~U(0.7,1.0), like the mb-heatmap

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5, 3, True]]
  - [-1, 2, C2PSA, [1024]]

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, True]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 1, C3k2, [1024, True, 0.5, True]]

  - [[16, 19, 22], 1, Detect, [nc]]
