# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO Anomaly v2 FiLM (g16) + PRIOR AUGMENTATION, MILD magnitude [0.7, 1.0].
# Same as yolo26-anomaly-v2-film-prioraug.yaml but mask_mag_range = [0.7, 1.0] instead of
# [0.4, 1.0]. Middle point of the magnitude sweep: prioraug [0.4,1.0] -> mag07 [0.7,1.0] ->
# nomag [1.0,1.0]. Tests whether a gentler peak weakening keeps the weak-prior robustness
# without the over-sensitization (spurious soft-prior-background detections) seen at [0.4,1.0].
# Branch: yoloa_v2_softhint_clean.

nc: 80
end2end: True
reg_max: 1
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

anomaly_v2:
  mask_size: 80
  mask_mode: rect
  sigma_factor: 0.25
  p_drop: 0.5
  bb_layers: [6]
  bb_temperature: 3.0
  bb_K: 9
  bb_auto_temperature: true
  bb_calibration_target_score: 0.5
  bb_calibrate: compactness
  seg_branch: true
  seg_alpha_mode: pinned_one
  seg_gain: 1.0
  seg_detach: true
  # Prior augmentation (training only) -- mild magnitude weakening:
  mask_shuffle_p: 0.0
  mask_noise_std: 0.05         # mild additive noise (imperfect heatmap)
  mask_mag_range: [0.7, 1.0]   # gentler peak scaling (vs [0.4,1.0] in prioraug)
  mask_blur_sigma_max: 2.0     # random Gaussian blur sigma -> soft edges
  fusion_mode: film
  film_groups: 16
  film_group_dim: 16

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5, 3, True]]
  - [-1, 2, C2PSA, [1024]]

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, True]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 1, C3k2, [1024, True, 0.5, True]]

  - [[16, 19, 22], 1, Detect, [nc]]
