# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO Anomaly v2 — polygon-mask prior (maskprior) variant.
# Single diff vs yolo26-anomaly.yaml: seg_target_polygon: true.
#
# Training prior source: polygon union from batch["masks"] instead of bbox→gauss render.
# Detection head unchanged (still bbox loss). SegBranch stays off.
# Requires segment data (e.g. merge_data_v8_binary_seg) — trainer auto-switches task="segment".
#
# A/B partner: yolo26-anomaly.yaml on the SAME segment data (prior=bbox→gauss as control).

nc: 80
end2end: True
reg_max: 1
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

anomaly_v2:
  mask_size: 80
  mask_mode: gauss
  sigma_factor: [0.20, 0.40]
  p_drop: 0.6
  seg_target_polygon: true         # ← ONLY diff: prior = polygon union, not bbox→gauss
  bb_layers: [6]
  fusion_mode: bias
  # aug3 base + mixup re-enabled (aug2 strength)
  mask_jitter: 0.01
  mask_box_drop_p: 0.05
  mask_distractor_p: 0.0
  mask_distractor_n: 1
  mask_erase_p: 0.08
  mask_warp_p: 0.08
  mask_mixup_p: 0.08
  mask_mixup_alpha: 0.4
  mask_mag_range: [0.7, 1]
  mask_aug_passes: 2
  # in-dist val
  val_mask_prior: false
  # test (cross-dataset MVTec) eval
  test_val_freq: 1
  test_categories: null
  test_none_prior: false
  test_heatmap_prior: true

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5, 3, True]]
  - [-1, 2, C2PSA, [1024]]

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, True]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 1, C3k2, [1024, True, 0.5, True]]

  - [[16, 19, 22], 1, Detect, [nc]]
