# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO Anomaly v2 — MoCo-style FIFO memory-bank training prior. Identical to
# yolo26-anomaly-v2-film-gauss-noseg.yaml except mb_queue_capacity/mb_blend_p, so the ONLY
# difference vs that control is the train-time prior source: each batch draws prior_mode=
# "heatmap" (FIFO bank queried by the live model, entries pushed by the EMA encoder) with
# p=mb_blend_p, else the legacy GT gauss mask. Closes the train(GT mask) vs inference
# (memory-bank heatmap) prior distribution gap. Bank mechanics: AnomalyV2Trainer fills the
# queue at on_train_start (one EMA-encoder pass over the train loader, defect boxes excluded),
# then refreshes it every batch end; capacity/steps patches per push -> ~1 epoch of history.
# Branch: yoloa_v2_queryfilm.

nc: 80
end2end: True
reg_max: 1
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

anomaly_v2:
  mask_size: 80
  mask_mode: gauss
  sigma_factor: 0.25
  p_drop: 0.5
  seg_branch: false
  bb_layers: [6]
  bb_temperature: 3.0
  bb_K: 9
  bb_auto_temperature: true      # one-shot calibration after the initial queue fill
  bb_calibration_target_score: 0.5
  bb_calibrate: compactness      # unused in queue mode (no freeze_memory_bank); kept for parity
  mb_queue_capacity: 50000       # FIFO queue slots; 0 = classic frozen-bank behavior
  mb_blend_p: 0.5                # P(prior_mode="heatmap") per training batch
  fusion_mode: film
  film_groups: 16
  film_group_dim: 16

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5, 3, True]]
  - [-1, 2, C2PSA, [1024]]

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, True]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 1, C3k2, [1024, True, 0.5, True]]

  - [[16, 19, 22], 1, Detect, [nc]]
