# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO Anomaly v2 FiLM (g16) + GAUSSIAN prior (mask_mode: gauss).
# Same as yolo26-anomaly-v2-film.yaml but the GT prior is rendered as a smooth 2D Gaussian
# (sigma = box_size * sigma_factor) instead of a hard binary rectangle. A cleaner way to
# soften the prior toward the inference heatmap distribution than the prior-augmentation
# (magnitude/blur/noise) variants: the Gaussian keeps peak=1 at the defect centre (magnitude
# semantics intact, no over-sensitization) but has smooth falloff like a real heatmap.
# Branch: yoloa_v2_softhint_clean.

nc: 80
end2end: True
reg_max: 1
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

anomaly_v2:
  mask_size: 80
  mask_mode: gauss             # smooth 2D Gaussian prior (vs rect in film.yaml)
  sigma_factor: 0.25           # sigma = box_w/h * 0.25
  p_drop: 0.5
  bb_layers: [6]
  bb_temperature: 3.0
  bb_K: 9
  bb_auto_temperature: true
  bb_calibration_target_score: 0.5
  bb_calibrate: compactness
  seg_branch: true
  seg_alpha_mode: pinned_one
  seg_gain: 1.0
  seg_detach: true
  mask_shuffle_p: 0.0
  mask_noise_std: 0.0
  fusion_mode: film
  film_groups: 16
  film_group_dim: 16

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5, 3, True]]
  - [-1, 2, C2PSA, [1024]]

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, True]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 1, C3k2, [1024, True, 0.5, True]]

  - [[16, 19, 22], 1, Detect, [nc]]
