# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO Anomaly v2 — sanity: p_drop=1.0 (mask always dropped during training).
# Identical to yolo26-anomaly-v2.yaml except: p_drop: 1.0.
# Purpose (Phase 0 sanity check): with mask always dropped, fusion is always
#   exact passthrough (2*sigmoid(0)=1) -> model SHOULD be equivalent to
#   vanilla yolo26m baseline. If pd100 mAP differs from your existing baseline
#   (26m_yolo_v5_binary_cm20_v1) by more than noise, something is wrong with
#   the v2 plumbing.
# Invocation example: model=yolo26m-anomaly-v2-pd100.yaml

# Parameters
nc: 80
end2end: True
reg_max: 1
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# Anomaly v2 config — p_drop = 1.0 (mask always dropped)
anomaly_v2:
  mask_size: 80
  mask_mode: rect
  sigma_factor: 0.25
  p_drop: 1.0

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5, 3, True]]
  - [-1, 2, C2PSA, [1024]]

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, True]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 1, C3k2, [1024, True, 0.5, True]]
  - [[16, 19, 22], 1, Detect, [nc]]
