# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO Anomaly v2 — A/B CONTROL for the SegBranch refiner (no refiner).
#
# Byte-for-byte the same as yolo26-anomaly-v2-segrefine-softhint-aug1.yaml EXCEPT the SegBranch
# is OFF: seg_branch/seg_prior_cond/seg_target_polygon removed. The prior here goes STRAIGHT into
# the softhint fusion -- train: the aug1-noised bbox-gauss GT mask; deploy: the mb-heatmap
# (prior_mode="heatmap") -- exactly the "raw prior -> fusion" path the refiner is meant to beat.
# Same two-head (head_a raw / head_b prior-fused), same softhint (bias) fusion, same aug1 mask
# noise, same data (merge_data_v6_binary). The ONLY difference vs the segrefine run is the
# refiner, so head_b mask-on (and the deploy head_b + mb-heatmap number) isolates its
# contribution; head_a mask-OFF should match between the two (shared honest floor).
# Branch: yoloa_v2_twohead.

nc: 80
end2end: True
reg_max: 1
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

anomaly_v2:
  mask_size: 80
  mask_mode: gauss
  sigma_factor: [0.15, 0.45]
  p_drop: 0.0                    # OFF -- two-head split makes per-sample mask dropout redundant
  two_head: true
  head_b_gain: 1.0
  seg_branch: false              # NO refiner -- prior goes straight to fusion (the control)
  fusion_mode: bias              # softhint: P + beta*tanh(conv(prior)), beta init 0
  # --- memory bank (inference-time mb-heatmap prior_mode="heatmap"); unused during training ---
  bb_layers: [6]
  bb_temperature: 5.0
  bb_K: 9
  bb_auto_temperature: false
  bb_calibration_target_score: 0.5
  bb_calibrate: compactness
  mb_queue_capacity: 0
  mb_cached_prior: false
  mb_cached_mask_gate: false
  # --- aug1 noise model on the prior (mask-level; distinct from image augs) ---
  mask_jitter: 0.02
  mask_box_drop_p: 0.1
  mask_distractor_p: 0.25
  mask_distractor_n: 2
  mask_erase_p: 0.15
  mask_warp_p: 0.15
  mask_mixup_p: 0.15
  mask_mixup_alpha: 0.4
  mask_blur_sigma_max: 2.0
  mask_mag_range: [0.7, 1]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5, 3, True]]
  - [-1, 2, C2PSA, [1024]]

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, True]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 1, C3k2, [1024, True, 0.5, True]]

  - [[16, 19, 22], 1, Detect, [nc]]
