# Ultralytics AGPL-3.0 License - https://ultralytics.com/license

# DINOv2-B + DPT depth estimation model
# Replaces the YOLO conv backbone with DINOv2 ViT-B (pretrained self-supervised) and
# uses a DPT decoder. Input resolution must be divisible by 14 (e.g. 518).

nc: 1  # not used for depth but required by parser

backbone:
  - [-1, 1, nn.Identity, []]  # 0 - passthrough; real work happens in the head

head:
  - [-1, 1, DINOv2DPTHead, [vitb, 10.0, False, True]]  # encoder_name=vitb, max_depth=10, freeze=False, pretrained=True
