# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# OSNet backbone + Ultralytics ReID head.
# Zhou et al., "Omni-Scale Feature Learning for Person Re-Identification", ICCV 2019.
# Lightweight ReID-purpose backbone (~2.2M params for x1_0, ~0.6M for x0_5) with
# multi-scale factorized conv streams and a unified aggregation gate.

# Parameters
nc: 751 # number of identity classes (overridden by `data=*.yaml -> nc`)

# No YOLO-style compound scaling — OSNet's own variant arg controls width.
scales:
  n: [1.0, 1.0, 512]
  s: [1.0, 1.0, 512]
  m: [1.0, 1.0, 512]
  l: [1.0, 1.0, 512]
  x: [1.0, 1.0, 512]

# Backbone: single-module OSNetBackbone does stem + 3 stages internally.
# Valid variants: x0_25 (0.1M), x0_5 (0.6M), x0_75 (1.3M), x1_0 (2.2M).
backbone:
  - [-1, 1, OSNetBackbone, ["x1_0"]] # 0 -> 512 ch, H/16, W/16

# Head: standard ReID head (BNNeck + embed + classifier)
head:
  - [-1, 1, ReID, [nc]]
