# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Vision Transformer (ViT-B/16) backbone + Ultralytics ReID head.
# Reference: TransReID (He et al. ICCV'21), CLIP-ReID (Li et al. AAAI'23).
# v1: base ViT-B/16 only — JPM and SIE land in v2.
#
# Input: 224x224 square. The CLS token after final LayerNorm is exposed as a
# [B, 768, 1, 1] tensor so the standard ReID head (BNNeck + classifier) attaches
# without modification.
#
# Pretrained init: pass `pretrained=ViT-B-16.pt` (OpenAI CLIP TorchScript). The
# visual-tower weights are auto-loaded by `load_clip_visual_into` at construction
# time; CLIP's 14x14 position embedding is bicubic-interpolated to match img_size.

nc: 751  # overridden by `data=*.yaml -> nc`

scales:
  # ViT has no compound scaling; we keep a single scale row so the loader is happy.
  l: [1.0, 1.0, 768]

backbone:
  # [from, repeats, module, args]
  # args = [img_size, patch_size, embed_dim, depth, heads]
  - [-1, 1, ViTBackbone, [224, 16, 768, 12, 12]]

head:
  - [-1, 1, ReID, [nc]]
