# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# FastViT-FFN/RepMixer P1-P3 with the accuracy-proven Attn2 P5 repeat. This is the direct merge of
# yolo26-ultravit-repmixer-fastvitffn-cls.yaml and yolo26-ultravit-attn2-cls.yaml: only P5 changes
# from the FastViT-FFN control (MHSABlock repeats 5 -> 8). It intentionally excludes the dinop5 bundle.

nc: 1000

scales:
  n: [0.20, 0.25, 1152]
  s: [0.20, 0.50, 1152]
  m: [0.25, 1.00, 512]
  l: [0.35, 1.00, 512]
  x: [0.35, 1.50, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [96, 3, 2]]
  - [-1, 5, RepUltraViTBlock, [3, True, 0.00001, True]]
  - [-1, 1, Conv, [192, 3, 2]]
  - [-1, 5, RepUltraViTBlock, [3, True, 0.00001, True]]
  - [-1, 1, Conv, [384, 3, 2]]
  - [-1, 20, RepUltraViTBlock, [3, True, 0.00001, True]]
  - [-1, 1, Conv, [1152, 3, 2]]
  - [-1, 8, MHSABlock, [0, 4, True, 0.00001, True, 32]]

head:
  - [-1, 1, Classify, [nc]]
