nc: 80
end2end: True
reg_max: 1
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5, 3, True]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

head:
  # FPN top-down
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, C3k2, [512, True]] # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, C3k2, [256, True]] # 16 (P3/8 - 256ch, 80×80)

  # PAN bottom-up
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]] # cat head P4
  - [-1, 2, C3k2, [512, True]] # 19 (P4/16 - 512ch, 40×40)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # cat head P5
  - [-1, 1, C3k2, [1024, True, 0.5, True]] # 22 (P5/32 - 1024ch, 20×20)

  # Fuse all scales to P3 resolution
  - [19, 1, Conv, [256, 1, 1]]                   # 23: P4 512→256ch
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 24: 40×40 → 80×80
  - [22, 1, Conv, [256, 1, 1]]                   # 25: P5 1024→256ch
  - [-1, 1, nn.Upsample, [None, 4, "nearest"]]   # 26: 20×20 → 80×80
  - [[16, 24, 26], 1, WeightedFusion, [256, 3]]  # 27: fuse all at 80×80
  - [-1, 1, C3k2, [256, True]]                   # 28: refine

  - [[28], 1, Detect, [nc]] # Single-scale Detect


module:
  init: |
    import torch
    import torch.nn as nn
    import torch.nn.functional as F

    class WeightedFusion(nn.Module):
      """Learnable weighted fusion of multi-scale features."""
      def __init__(self, channels, num_inputs=3):
          super().__init__()
          self.weights = nn.Parameter(torch.ones(num_inputs) / num_inputs)
          self.conv = nn.Conv2d(channels, channels, 1)
      
      def forward(self, x):
          weights = F.softmax(self.weights, dim=0)
          out = sum(w * f for w, f in zip(weights, x))
          return self.conv(out)
  parse: |
    if m is WeightedFusion:
      c2 = args[0]