# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO26-UltraViT-cls, combined Lane B bundle: RepMixer stages 1-3 with the FastViT-exact ConvFFN
# (fastvit_ffn=True: DW7x7+BN at input width before the 1x1 PW expansion) + dinop5 MHSA stage 4
# (head_dim 64, qkv/proj bias, token SwiGLU, 4 storage tokens, no conv FFN, RoPE excluded).
# Backbone rows 0-8 match yolo26-ultravit-repmixer-fastvitffn-dinop5-deim_mal_deimv2Neck.yaml
# (the T4-gated Lane B deploy config, both gates passed 2026-07-12), so cls/distilled weights
# cover 100% of the det backbone. Blocks in ultralytics/nn/modules/vit_blocks.py.
#
# n is unsupported: head_dim 64 does not divide n's 288-wide P5 (288/64 = 4.5), MHSABlock
# asserts at build. The family is s-x.

# Parameters
nc: 1000 # number of classes

scales:
  # [depth, width, max_channels]
  s: [0.20, 0.50, 1152] # 8.3 M params
  m: [0.25, 1.00, 512] # 12.6 M params
  l: [0.35, 1.00, 512] # 17.9 M params
  x: [0.35, 1.50, 512] # 38.0 M params

# UltraViT backbone: RepMixer stages 1-3 (FastViT ConvFFN) + dinop5 MHSA stage 4, strides 4/8/16/32
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0 P1/2 stem
  - [-1, 1, Conv, [96, 3, 2]] # 1 P2/4 stem
  - [-1, 5, RepUltraViTBlock, [3, True, 0.00001, True]] # 2 stage1 P2/4
  - [-1, 1, Conv, [192, 3, 2]] # 3 P3/8 downsample
  - [-1, 5, RepUltraViTBlock, [3, True, 0.00001, True]] # 4 stage2 P3/8
  - [-1, 1, Conv, [384, 3, 2]] # 5 P4/16 downsample
  - [-1, 20, RepUltraViTBlock, [3, True, 0.00001, True]] # 6 stage3 P4/16
  - [-1, 1, Conv, [1152, 3, 2]] # 7 P5/32 downsample
  - [-1, 5, MHSABlock, [0, 4, True, 0.00001, False, 64, False, True, True, True, 4]] # 8 stage4 P5/32 dinop5

# Head
head:
  - [-1, 1, Classify, [nc]] # 9 AdaptiveAvgPool + Conv1x1 + Linear
