# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLO26 object detection model with P3/8 - P5/32 outputs
# Variant: rep-fpn-rep-sres-strip with P5 order swapped: SPPF -> StripAttn -> C2PSA
# (champion strip config runs C2PSA -> StripAttn). Hypothesis: gating BEFORE full
# attention lets C2PSA repair any small-object signal the coarse axial gate suppresses
# (strip loses -0.60 APs when it is the last op before the head), while the head now
# reads a clean C2PSA output. Same modules, same params/speed as strip — pure reorder.
# P4 unchanged (no C2PSA there). Head indices identical: layer 12 is still the final
# backbone P5 output.

# Parameters
nc: 80 # number of classes
end2end: True # whether to use end-to-end mode
reg_max: 1 # DFL bins
scale_args: [rep_e, head_n] # names for scales entries beyond [depth, width, max_channels]
scales: # model compound scaling constants, i.e. 'model=yolo26n.yaml' will call yolo26.yaml with scale 'n'
  # [depth, width, max_channels, rep_e, head_n]
  n: [0.50, 0.25, 1024, 0.5, 2]
  s: [0.50, 0.50, 1024, 0.5, 3]
  m: [0.50, 1.00, 512, 0.28125, 3]
  l: [1.00, 1.00, 512, 0.3125, 2]
  x: [1.00, 1.50, 512, 0.3125, 3]

# YOLO26n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2Rep, [256, False, rep_e]] # 2 - rep block
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2Rep, [512, False, rep_e]] # 4 - rep block
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, StripAttn, []] # 7 - strip gate at P4
  - [-1, 1, Conv, [1024, 3, 2]] # 8-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5, 3, True]] # 10
  - [-1, 1, StripAttn, []] # 11 - strip gate at P5, BEFORE C2PSA
  - [-1, 2, C2PSA, [1024]] # 12

# YOLO26n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 7], 1, Concat, [1]]
  - [-1, head_n, C3k2Rep, [512, True, rep_e]] # 15

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, head_n, C3k2Rep, [256, True, rep_e]] # 18

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 15], 1, Concat, [1]]
  - [-1, 2, C3k2Rep, [512, True, rep_e]] # 21

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 2, C3k2Rep, [1024, True, rep_e, True]] # 24
  - [[-1, 12], 1, ScaledAdd, []] # 25: scaled residual from backbone P5

  - [[18, 21, 25], 1, Detect, [nc]]
