# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO26-UltraViT-cls, cross-covariance attention variant: the stage-4 attention is cross-covariance (channel)
# attention (XCiT, arXiv:2106.09681) instead of token self-attention. XCA transposes q,k,v so the attention map
# is head_dim x head_dim (32x32) rather than N x N, making it INVARIANT to the token count. A backbone pretrained
# @224 (49 P5 tokens) then frozen and transferred to 640 detection (400 tokens) therefore meets no length-coupled
# softmax dilution, the frozen-jump failure that a token-SDPA block suffers. XCA also drops the N x N matmul, so it
# is net-cheaper at high resolution (the l/x sizes with the thinnest latency margin benefit most). A learnable
# per-head temperature scales the channel map. Backbone still == yolo26-ultravit.yaml layers 0-8.

# Parameters
nc: 1000 # number of classes

scales:
  # [depth, width, max_channels]
  n: [0.20, 0.25, 1152] # 3.24 M params
  s: [0.20, 0.50, 1152] # 8.28 M params
  m: [0.25, 1.00, 512] # 12.60 M params
  l: [0.35, 1.00, 512] # 17.90 M params
  x: [0.35, 1.50, 512] # 37.97 M params

# UltraViT backbone: RepMixer stages 1-3 + XCA channel attention stage 4, strides 4/8/16/32
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0 P1/2 stem
  - [-1, 1, Conv, [96, 3, 2]] # 1 P2/4 stem
  - [-1, 5, UltraViTBlock, [3, True, 0.00001]] # 2 stage1 P2/4
  - [-1, 1, Conv, [192, 3, 2]] # 3 P3/8 downsample
  - [-1, 5, UltraViTBlock, [3, True, 0.00001]] # 4 stage2 P3/8
  - [-1, 1, Conv, [384, 3, 2]] # 5 P4/16 downsample
  - [-1, 20, UltraViTBlock, [3, True, 0.00001]] # 6 stage3 P4/16
  - [-1, 1, Conv, [1152, 3, 2]] # 7 P5/32 downsample
  - [-1, 5, MHSABlock, [0, 4, True, 0.00001, True, 32, True]] # 8 stage4 P5/32 (xca=True)

# Head
head:
  - [-1, 1, Classify, [nc]] # 9 AdaptiveAvgPool + Conv1x1 + Linear
