# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license
# yolo26-reid-2psa with last_stride=1 (BoT-style higher-resolution feature map for ReID).
#
# Identical to yolo26-reid-2psa.yaml EXCEPT the final backbone downsample Conv is stride=1
# instead of stride=2, so the C3k2 + 2x C2PSA blocks operate at P4/16 instead of P5/32.
#   imgsz=384 -> 24x24 feature grid (576 locations) vs 12x12 (144) for the /32 stack.
# Rationale (research-driven): the BoT ResNet-50 baseline (R1=0.945) uses last_stride 2->1 to
# keep a finer 16x8 map, and our imgsz sweep showed 288->384 (9x9->12x12) = +4.6pp R1 monotonic,
# i.e. final-feature-map resolution is the binding constraint. This raises resolution WITHOUT
# adding capacity (so it should not overfit the way GeM/Non-Local/IBN/3psa did).
#
# NOTE: C2PSA attention is O(N^2) in spatial tokens; 144->576 tokens ~= 16x attention memory.
# Expect OOM at the /32 champion's imgsz=384 batch=64 on 32GB. Start lower (e.g. imgsz=256-320,
# batch 24-48) to confirm the resolution gain, then scale imgsz/batch up to the memory limit.
# Pretrained yolo26l-cls.pt / MSMT-2psa weights load unchanged (the destrided Conv keeps its shape).

nc: 751 # overridden by data=*.yaml -> nc
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 1]]   # last_stride=1 (was stride 2): keep P4/16 resolution
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 2, C2PSA, [1024]]
  - [-1, 2, C2PSA, [1024]]        # extra attention block

head:
  - [-1, 1, ReID, [nc]]
