# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO26-UltraViT-cls, A3 ablation: identical to yolo26-ultravit-cls.yaml but the stage-4 MHSA drops
# its conditional position encoding (CPE, the zero-init depthwise 7x7 before attention). D4 showed the
# zero-init CPE is net-harmful under frozen 224->640 detection transfer (post-hoc zeroing on the CE
# ckpt = +1.37pp ul33 macro, 7/8 datasets): its 7x7 receptive field covers 100% of the 7x7 train grid
# but only ~35% of the 20x20 det grid, so the learned local prior goes stale at the transfer resolution.
# Removing self.pe also deletes the only length-dependent module in the block, leaving pure conv (stem +
# RepMixer, shape-agnostic) + length-agnostic SDPA, which is exactly what conv/DINOv3 frozen backbones
# rely on to scale to larger detection resolutions. Backbone still == yolo26-ultravit.yaml layers 0-8.

# Parameters
nc: 1000 # number of classes

scales:
  # [depth, width, max_channels]
  n: [0.20, 0.25, 1152] # 3.24 M params
  s: [0.20, 0.50, 1152] # 8.28 M params
  m: [0.25, 1.00, 512] # 12.60 M params
  l: [0.35, 1.00, 512] # 17.90 M params
  x: [0.35, 1.50, 512] # 37.97 M params

# UltraViT backbone: RepMixer stages 1-3 + MHSA stage 4 (no CPE), strides 4/8/16/32
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0 P1/2 stem
  - [-1, 1, Conv, [96, 3, 2]] # 1 P2/4 stem
  - [-1, 5, UltraViTBlock, [3, True, 0.00001]] # 2 stage1 P2/4
  - [-1, 1, Conv, [192, 3, 2]] # 3 P3/8 downsample
  - [-1, 5, UltraViTBlock, [3, True, 0.00001]] # 4 stage2 P3/8
  - [-1, 1, Conv, [384, 3, 2]] # 5 P4/16 downsample
  - [-1, 20, UltraViTBlock, [3, True, 0.00001]] # 6 stage3 P4/16
  - [-1, 1, Conv, [1152, 3, 2]] # 7 P5/32 downsample
  - [-1, 5, MHSABlock, [0, 4, True, 0.00001, True, 32, False]] # 8 stage4 P5/32 (cpe=False)

# Head
head:
  - [-1, 1, Classify, [nc]] # 9 AdaptiveAvgPool + Conv1x1 + Linear
