nc: 80
end2end: True
reg_max: 1
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5, 3, True]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

head:
  # FPN top-down only (no PAN bottom-up: no P4/P5 detect heads to feed)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, C3k2, [512, True]] # 13 (P4/16 top-down)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, C3k2, [256, True]] # 16 (P3/8 - 80×80)

  # Fuse all scales to P3 resolution
  - [13, 1, Conv, [256, 1, 1]]                   # 17: P4 top-down 512→256ch
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 18: 40×40 → 80×80
  - [10, 1, Conv, [256, 1, 1]]                   # 19: P5 backbone 1024→256ch
  - [-1, 1, nn.Upsample, [None, 4, "nearest"]]   # 20: 20×20 → 80×80
  - [[16, 18, 20], 1, WeightedFusion, [256, 3]]  # 21: fuse all at 80×80
  - [-1, 1, C3k2, [256, True]]                   # 22: refine

  - [[22], 1, Detect, [nc]] # Single-scale Detect
