# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO26-FastViT object detection model with P3/8 - P5/32 outputs.
# Backbone (layers 0-8) is byte-identical to yolo26-fastvit-cls.yaml so that
# fastvit-cls weights transfer name-for-name into layers 0-8 via intersect_dicts.
# SPPF (9) + C2PSA (10) added with c2=1024 (matching yolo26.yaml) so head/neck
# is byte-exact to yolo26.yaml — keeps params/speed comparable to conv det at
# matched scale and avoids per-layer dim drift in cls->det weight transfer.

# Parameters
nc: 80 # number of classes
end2end: True # whether to use end-to-end mode
reg_max: 1 # DFL bins
scales:
  # [depth, width, max_channels]
  s: [1.0, 0.50, 1024]
  l: [5.0, 0.75, 1024]
  x: [5.0, 1.125, 1024] # matches yolo26-fastvit-cls.yaml x scale for cls->det backbone transfer

# FastViT backbone: 4 stages @ strides 4/8/16/32 + det-specific SPPF + C2PSA
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [96, 3, 2]] # 0 P1/2 stem
  - [-1, 1, Conv, [96, 3, 2]] # 1 P2/4 stem
  - [-1, 2, FastViTBlock, [3]] # 2 stage1 P2/4
  - [-1, 1, Conv, [192, 3, 2]] # 3 P3/8 downsample
  - [-1, 2, FastViTBlock, [3]] # 4 stage2 P3/8     <- head P3 skip target
  - [-1, 1, Conv, [384, 3, 2]] # 5 P4/16 downsample
  - [-1, 2, FastViTBlock, [3]] # 6 stage3 P4/16    <- head P4 skip target
  - [-1, 1, Conv, [768, 3, 2]] # 7 P5/32 downsample
  - [-1, 1, MHSABlock, [6, 4]] # 8 stage4 P5/32 (heads=6, mlp_ratio=4)
  - [-1, 1, SPPF, [1024, 5, 3, True]] # 9
  - [-1, 2, C2PSA, [1024]] # 10                    <- head P5 skip target

# Head (byte-identical to yolo26.yaml head)
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, C3k2, [512, True]] # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, C3k2, [256, True]] # 16 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]] # cat head P4
  - [-1, 2, C3k2, [512, True]] # 19 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # cat head P5
  - [-1, 1, C3k2, [1024, True, 0.5, True]] # 22 (P5/32-large)

  - [[16, 19, 22], 1, Detect, [nc]] # Detect(P3, P4, P5)
