nc: 80
end2end: True
reg_max: 1
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]         # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]        # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] # 2
  - [-1, 1, Conv, [256, 3, 2]]        # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 4 (backbone P3)
  - [-1, 1, Conv, [512, 3, 2]]        # 5-P4/16
  - [-1, 2, C3k2, [512, True]]        # 6 (backbone P4)
  - [-1, 1, Conv, [1024, 3, 2]]       # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]       # 8
  - [-1, 1, SPPF, [1024, 5, 3, True]] # 9
  - [-1, 2, C2PSA, [1024]]            # 10 (backbone P5)

head:
  # Step 1: Project P5 to 256ch, upsample to P4 resolution
  - [10, 1, Conv, [256, 1, 1]]                   # 11: P5 1024→256ch
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 12: 20×20 → 40×40

  # Step 2: Project backbone P4 to 256ch, weighted fuse with upsampled P5
  - [6, 1, Conv, [256, 1, 1]]                    # 13: P4 512→256ch
  - [[13, 12], 1, WeightedFusion, [256, 2]]      # 14: fused P4 (40×40)
  - [-1, 1, C3k2, [256, True]]                   # 15: refine fused P4
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 16: 40×40 → 80×80

  # Step 3: Project backbone P3 to 256ch, weighted fuse with upsampled fused-P4
  - [4, 1, Conv, [256, 1, 1]]                    # 17: P3 512→256ch
  - [[17, 16], 1, WeightedFusion, [256, 2]]      # 18: fused P3 (80×80)
  - [-1, 2, C3k2, [384, True]]                   # 19: final refinement

  - [[19], 1, Detect, [nc]]


module:
  init: |
    import torch
    import torch.nn as nn
    import torch.nn.functional as F

    class WeightedFusion(nn.Module):
      """Learnable weighted fusion of multi-scale features."""
      def __init__(self, channels, num_inputs=2):
          super().__init__()
          self.weights = nn.Parameter(torch.ones(num_inputs) / num_inputs)
          self.conv = nn.Conv2d(channels, channels, 1)
      
      def forward(self, x):
          weights = F.softmax(self.weights, dim=0)
          out = sum(w * f for w, f in zip(weights, x))
          return self.conv(out)
  parse: |
    if m is WeightedFusion:
      c2 = args[0]