# Ultralytics AGPL-3.0 License - https://ultralytics.com/license

# YOLO26-UltraViT-FracRoPE object detection model with P3/8 - P5/32 outputs.
# Only change vs yolo26-ultravit.yaml: layer 8 uses FracRoPE2D instead of MHSABlock.
# FracRoPE2D adds fractional-coordinate 2D rotary position embedding on Q/K.
# Backbone layers 0-8 match yolo26-ultravit-fracrope-cls.yaml, so cls/distilled weights
# transfer by name into the det backbone via intersect_dicts.

# Parameters
nc: 80 # number of classes
end2end: True # whether to use end-to-end mode
reg_max: 1 # DFL bins
scales:
  # [depth, width, max_channels]
  n: [0.20, 0.25, 1152]
  s: [0.20, 0.50, 1152]
  m: [0.25, 1.00, 512]
  l: [0.35, 1.00, 512]
  x: [0.35, 1.50, 512]

# UltraViT backbone: RepMixer stages 1-3 + FracRoPE2D stage 4, strides 4/8/16/32
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0 P1/2 stem
  - [-1, 1, Conv, [96, 3, 2]] # 1 P2/4 stem
  - [-1, 5, UltraViTBlock, [3, True, 0.00001]] # 2 stage1 P2/4
  - [-1, 1, Conv, [192, 3, 2]] # 3 P3/8 downsample
  - [-1, 5, UltraViTBlock, [3, True, 0.00001]] # 4 stage2 P3/8
  - [-1, 1, Conv, [384, 3, 2]] # 5 P4/16 downsample
  - [-1, 20, UltraViTBlock, [3, True, 0.00001]] # 6 stage3 P4/16
  - [-1, 1, Conv, [1152, 3, 2]] # 7 P5/32 downsample
  - [-1, 5, FracRoPE2D, [0, 4, True, 0.00001, True, 32]] # 8 stage4 P5/32

# Head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, C3k2, [512, True]] # 11

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, C3k2, [256, True]] # 14 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 11], 1, Concat, [1]] # cat head P4
  - [-1, 2, C3k2, [512, True]] # 17 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 8], 1, Concat, [1]] # cat backbone P5
  - [-1, 1, C3k2, [1024, True, 0.5, True]] # 20 (P5/32-large)

  - [[14, 17, 20], 1, Detect, [nc]] # Detect(P3, P4, P5)
