# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLO26 object detection model with P3/8 - P5/32 outputs
# Variant of yolo26-rep-fpn-simple-sres with FastViT PatchEmbed downsampling.
# Each stride-2 downsampling Conv is replaced by FastViTDownsample: a reparameterizable large-kernel
# depthwise conv (k=7, s=2) + a small-kernel reparam branch, followed by a 1x1 MobileOne pointwise block.
# Both branches collapse to plain convs at inference via model.fuse(). The stem (3->64) stays a Conv
# since depthwise grouping requires c2 % c1 == 0.

# Parameters
nc: 80 # number of classes
end2end: True # whether to use end-to-end mode
reg_max: 1 # DFL bins
scales: # model compound scaling constants, i.e. 'model=yolo26n.yaml' will call yolo26.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO26n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2 (stem stays Conv)
  - [-1, 1, FastViTDownsample, [128]] # 1-P2/4
  - [-1, 2, C3k2Simple, [256, False, 0.5]] # 2 - simple block, e=0.5
  - [-1, 1, FastViTDownsample, [256]] # 3-P3/8
  - [-1, 2, C3k2Simple, [512, False, 0.5]] # 4 - simple block, e=0.5
  - [-1, 1, FastViTDownsample, [512]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, FastViTDownsample, [1024]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5, 3, True]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

# YOLO26n head
head:
  # C3k2Rep args: [c2, c3k, e, attn, g, shortcut, identity]; identity=False -> RepConvN
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 3, C3k2Rep, [512, True]  # increase depth

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 3, C3k2Rep, [256, True]]  # increase depth

  - [-1, 1, FastViTDownsample, [256]]
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 2, C3k2Rep, [512, True]]  # increase depth

  - [-1, 1, FastViTDownsample, [512]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 2, C3k2Rep, [1024, True, 0.5, True]] # 22
  - [[-1, 10], 1, ScaledAdd, []]  # 23: scaled residual from backbone P5

  - [[16, 19, 23], 1, Detect, [nc]]
