# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO26-UltraViT-StaticRoPE object detection model with P3/8 - P5/32 outputs.
# Identical to yolo26-ultravit.yaml except the stage-4 P5 attention block is RoPEMHSABlock
# (axial 2D RoPE with [-1,1]-normalized patch coords, DINOv3 arXiv:2508.10104), a resolution-
# independent relative-position variant. Training uses the dynamic [-1,1] RoPE with box jitter;
# fuse()/export bakes the destination grid's cos/sin into constant buffers (folded static form
# is the ncnn/tflite-legal elementwise op set). Backbone (layers 0-8) stays byte-compatible with
# yolo26-ultravit-cls.yaml except the swapped P5 block, so RepMixer stage weights transfer by name.
# Head is byte-identical to yolo26.yaml (end2end, reg_max=1, c3k=True rows), skip indices P3=4, P4=6, P5=8.
# Blocks in ultralytics/nn/modules/vit_blocks.py: UltraViTBlock args [mlp_ratio, silu, ls],
# RoPEMHSABlock args [num_heads, mlp_ratio, silu, ls, conv_ffn, head_dim] (same signature as MHSABlock).
# num_heads=0 is a sentinel: head_dim=32 pins per-head width and derives heads per scale (n 9, s 18, m/l 16, x 24).

# Parameters
nc: 80 # number of classes
end2end: True # whether to use end-to-end mode
reg_max: 1 # DFL bins
scales:
  # [depth, width, max_channels]
  n: [0.20, 0.25, 1152] # 2.80 M params
  s: [0.20, 0.50, 1152] # 10.84 M params
  m: [0.25, 1.00, 512] # 22.06 M params
  l: [0.35, 1.00, 512] # 27.36 M params
  x: [0.35, 1.50, 512] # 61.20 M params

# UltraViT backbone: RepMixer stages 1-3 + RoPE-MHSA stage 4, strides 4/8/16/32
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0 P1/2 stem
  - [-1, 1, Conv, [96, 3, 2]] # 1 P2/4 stem
  - [-1, 5, UltraViTBlock, [3, True, 0.00001]] # 2 stage1 P2/4
  - [-1, 1, Conv, [192, 3, 2]] # 3 P3/8 downsample
  - [-1, 5, UltraViTBlock, [3, True, 0.00001]] # 4 stage2 P3/8    <- head P3 skip target
  - [-1, 1, Conv, [384, 3, 2]] # 5 P4/16 downsample
  - [-1, 20, UltraViTBlock, [3, True, 0.00001]] # 6 stage3 P4/16   <- head P4 skip target
  - [-1, 1, Conv, [1152, 3, 2]] # 7 P5/32 downsample
  - [-1, 5, RoPEMHSABlock, [0, 4, True, 0.00001, True, 32]] # 8 stage4 P5/32 <- head P5 skip target

# Head (byte-identical to yolo26.yaml head, ultravit skip indices)
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, C3k2, [512, True]] # 11

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, C3k2, [256, True]] # 14 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 11], 1, Concat, [1]] # cat head P4
  - [-1, 2, C3k2, [512, True]] # 17 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 8], 1, Concat, [1]] # cat backbone P5
  - [-1, 1, C3k2, [1024, True, 0.5, True]] # 20 (P5/32-large)

  - [[14, 17, 20], 1, Detect, [nc]] # Detect(P3, P4, P5)
