# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO26 UltraViT RepMixer/FastViT-FFN backbone with RTDETR MAL DfineLoss head.
# Backbone rows 0-8 match `yolo26-ultravit-repmixer-fastvitffn-cls.yaml` from encoder-experiments:
# RepUltraViTBlock stages 1-3 with FastViT ConvFFN, plus base MHSABlock stage 4.
# Head/loss follow `yolo26-rtdetr_mal_dfineloss.yaml`, with P3/P4/P5 sources rewired to UltraViT layers 4/6/8.

# Parameters
nc: 80 # number of classes
end2end: True # whether to use end-to-end mode
reg_max: 1 # DFL bins
scales: # model compound scaling constants, i.e. 'model=YOLO26n.yaml' will call YOLO26.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.20, 0.25, 1152]
  s: [0.20, 0.50, 1152]
  m: [0.25, 1.00, 512]
  l: [0.35, 1.00, 512]
  x: [0.35, 1.50, 512]

# UltraViT backbone: RepMixer stages 1-3 (FastViT ConvFFN) + MHSA stage 4, strides 4/8/16/32
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0 P1/2 stem
  - [-1, 1, Conv, [96, 3, 2]] # 1 P2/4 stem
  - [-1, 5, RepUltraViTBlock, [3, True, 0.00001, True]] # 2 stage1 P2/4
  - [-1, 1, Conv, [192, 3, 2]] # 3 P3/8 downsample
  - [-1, 5, RepUltraViTBlock, [3, True, 0.00001, True]] # 4 stage2 P3/8 feature
  - [-1, 1, Conv, [384, 3, 2]] # 5 P4/16 downsample
  - [-1, 20, RepUltraViTBlock, [3, True, 0.00001, True]] # 6 stage3 P4/16 feature
  - [-1, 1, Conv, [1152, 3, 2]] # 7 P5/32 downsample
  - [-1, 5, MHSABlock, [0, 4, True, 0.00001, True, 32]] # 8 stage4 P5/32 feature

# RTDETR head from yolo26-rtdetr_mal_dfineloss.yaml
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, C3k2, [512, True]] # 11

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, C3k2, [256, True]] # 14 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 11], 1, Concat, [1]] # cat head P4
  - [-1, 2, C3k2, [512, True]] # 17 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 8], 1, Concat, [1]] # cat backbone P5
  - [-1, 1, C3k2, [1024, True, 0.5, True]] # 20 (P5/32-large)

  # RTDETRDecoder - ALL positional arguments must match __init__ signature
  # [nc, ch, hd, nq, ndp, nh, ndl, d_ffn, dropout, act, eval_idx, nd, label_noise_ratio, box_noise_scale, learnt_init_query]
  - [[14, 17, 20], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 6, 1024, 0.0, "relu", -1, 100, 0.5, 1.0, False, False]]

loss:
  gamma: 1.5
  alpha: 0.75
  use_fl: False
  use_vfl: False
  use_mal: True
  use_union_set: False
  loss_gain: {class: 1, bbox: 5, giou: 2, fgl: 0, ddf: 0}
  matcher:
    cost_gain: {class: 2, bbox: 5, giou: 2}
    use_fl: True
    alpha: 0.25
    gamma: 2.0
