# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO26-reid with IBN-a (Pan ECCV'18) in early stem/downsample convs.
# IBN mixes InstanceNorm and BatchNorm on channel halves; in BoT's R50-IBN this
# adds roughly +5 mAP over plain R50. IBN sits in layers that process low/mid
# semantic features (stems and P2/P3/P4 downsamples). Stage-5 (P5) downsample
# and heavy C3k2 blocks keep plain BN, matching the IBN-a paper.

nc: 751
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, ConvIBN, [64, 3, 2]] # 0-P1/2       (IBN on stem)
  - [-1, 1, ConvIBN, [128, 3, 2]] # 1-P2/4      (IBN on first downsample)
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, ConvIBN, [256, 3, 2]] # 3-P3/8      (IBN on second downsample)
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, ConvIBN, [512, 3, 2]] # 5-P4/16     (IBN on third downsample)
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32       (plain BN in deepest stage per IBN-a)
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 2, C2PSA, [1024]] # 9

head:
  - [-1, 1, ReID, [nc]]
