# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Lane B P5 hybrid, family s-x (n unsupported: head_dim 64 does not divide n's 288-wide P5). Retains Attn2 ConvFFN
# and depth with DINO-style biases, registers, and 64-wide heads.

nc: 1000

scales:
  s: [0.20, 0.50, 1152]
  m: [0.25, 1.00, 512]
  l: [0.35, 1.00, 512]
  x: [0.35, 1.50, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [96, 3, 2]]
  - [-1, 5, RepUltraViTBlock, [3, True, 0.00001, True]]
  - [-1, 1, Conv, [192, 3, 2]]
  - [-1, 5, RepUltraViTBlock, [3, True, 0.00001, True]]
  - [-1, 1, Conv, [384, 3, 2]]
  - [-1, 20, RepUltraViTBlock, [3, True, 0.00001, True]]
  - [-1, 1, Conv, [1152, 3, 2]]
  - [-1, 8, MHSABlock, [0, 4, True, 0.00001, True, 64, False, True, True, False, 4]]

head:
  - [-1, 1, Classify, [nc]]
