# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO26 with YOLOF-inspired Dilated Encoder neck (CVPR 2021).
#
# Key idea (YOLOF — You Only Look One-level Feature, CVPR 2021):
#   FPN's cross-scale paths introduce complexity that can be replaced by
#   processing a single top-level feature with dilated convolutions.
#   Stacking bottleneck blocks at dilation rates 2, 4, 6, 8 builds a set of
#   receptive fields that cover small→large objects without explicit multi-scale
#   fusion — eliminating PAFPN's bottom-up path entirely.
#
# Neck design:
#   1. DilatedEncoder on P5:  4 × DilatedBottleneck (d = 2, 4, 6, 8)
#      → encodes multi-scale context in a single feature level
#   2. Top-down FPN decode only (no bottom-up path):
#      enc_p5  → upsample → concat(P4_bb) → C3k2 → P4
#      P4      → upsample → concat(P3_bb) → C3k2 → P3
#   Backbone is unchanged.

nc: 80
end2end: True
reg_max: 1
scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# Backbone: identical to yolo26.yaml
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]              # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]             # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]      # 2
  - [-1, 1, Conv, [256, 3, 2]]             # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]      # 4  ← P3 backbone
  - [-1, 1, Conv, [512, 3, 2]]             # 5-P4/16
  - [-1, 2, C3k2, [512, True]]             # 6  ← P4 backbone
  - [-1, 1, Conv, [1024, 3, 2]]            # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]            # 8
  - [-1, 1, SPPF, [1024, 5, 3, True]]     # 9
  - [-1, 2, C2PSA, [1024]]                 # 10 ← P5 backbone

head:
  # ── Dilated Encoder: multi-scale context from a single level ────────────────
  # 4 bottlenecks with d = 2, 4, 6, 8 encode receptive fields for all object sizes
  - [-1, 1, DilatedEncoder, [1024]]        # 11: enc_p5 (same resolution as P5)

  # ── Top-down FPN decode only (no bottom-up path) ────────────────────────────
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 12
  - [[-1, 6], 1, Concat, [1]]              # 13: cat backbone P4
  - [-1, 2, C3k2, [512, True]]             # 14: P4 (P4/16-medium)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 15
  - [[-1, 4], 1, Concat, [1]]              # 16: cat backbone P3
  - [-1, 2, C3k2, [256, True]]             # 17: P3 (P3/8-small)

  - [[17, 14, 11], 1, Detect, [nc]]        # Detect(P3, P4, P5)
