nc: 80
end2end: True
reg_max: 1
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 4
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]] # 6
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]] # 8
  - [-1, 1, SPPF, [1024, 5, 3, True]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

head:
  # FPN top-down (project to 256ch for efficiency)
  - [10, 1, Conv, [256, 1, 1]]                   # 11: P5 1024→256
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 12: → 40×40
  - [6, 1, Conv, [256, 1, 1]]                    # 13: P4 512→256
  - [[-1, 12], 1, Concat, [1]]                   # 14: 512ch
  - [-1, 1, C3k2, [256, True]]                   # 15: FPN P4 (256ch)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 16: → 80×80
  - [4, 1, Conv, [256, 1, 1]]                    # 17: P3 512→256
  - [[-1, 16], 1, Concat, [1]]                   # 18: 512ch
  - [-1, 1, C3k2, [256, True]]                   # 19: FPN P3 (256ch, 80×80)

  # Lite PAN bottom-up (depthwise + add, no heavy C3k2)
  - [-1, 1, DWConv, [256, 3, 2]]                 # 20: 80×80 → 40×40
  - [[-1, 15], 1, Add, []]                       # 21: + FPN P4
  - [-1, 1, Conv, [256, 1, 1]]                   # 22: PAN P4 (256ch)

  - [-1, 1, DWConv, [256, 3, 2]]                 # 23: 40×40 → 20×20
  - [[-1, 11], 1, Add, []]                       # 24: + projected P5
  - [-1, 1, Conv, [256, 1, 1]]                   # 25: PAN P5 (256ch)

  # Fuse all to P3
  - [22, 1, nn.Upsample, [None, 2, "nearest"]]   # 26: PAN P4 → 80×80
  - [25, 1, nn.Upsample, [None, 4, "nearest"]]   # 27: PAN P5 → 80×80
  - [[19, 26, 27], 1, FastFusion, [256, 3]]      # 28: weighted fusion

  - [[28], 1, Detect, [nc]]


module:
  init: |
    import torch
    import torch.nn as nn

    class Add(nn.Module):
      """Element-wise addition."""
      def forward(self, x):
          return sum(x)

    class FastFusion(nn.Module):
      """BiFPN-style fast normalized fusion."""
      def __init__(self, channels, num_inputs=3, eps=1e-4):
          super().__init__()
          self.eps = eps
          self.weights = nn.Parameter(torch.ones(num_inputs))
          self.conv = nn.Conv2d(channels, channels, 1)
      
      def forward(self, x):
          w = torch.relu(self.weights)
          w = w / (w.sum() + self.eps)
          out = sum(wi * xi for wi, xi in zip(w, x))
          return self.conv(out)
  parse: |
    if m is Add:
      c2 = ch[0]
    if m is FastFusion:
      c2 = args[0]