# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Classification counterpart of yolo26s-ultravit-repmixer-fastvitffn-attn2-sfix.yaml.

nc: 1000

scales:
  s: [0.20, 0.50, 1024]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [96, 3, 2]]
  - [-1, 5, RepUltraViTBlock, [3, True, 0.00001, True]]
  - [-1, 1, Conv, [192, 3, 2]]
  - [-1, 5, RepUltraViTBlock, [3, True, 0.00001, True]]
  - [-1, 1, Conv, [384, 3, 2]]
  - [-1, 20, RepUltraViTBlock, [3, True, 0.00001, True]]
  - [-1, 1, Conv, [1152, 3, 2]]
  - [-1, 8, MHSABlock, [0, 4, True, 0.00001, True, 32]]

head:
  - [-1, 1, Classify, [nc]]
