# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# UltraViT with a zero-initialized P5 conditional positional encoding for a T4 reference benchmark.

nc: 80
end2end: True
reg_max: 1

scales:
  n: [0.20, 0.25, 1152]
  s: [0.20, 0.50, 1152]
  m: [0.25, 1.00, 512]
  l: [0.35, 1.00, 512]
  x: [0.35, 1.50, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [96, 3, 2]]
  - [-1, 5, UltraViTBlock, [3, True, 0.00001]]
  - [-1, 1, Conv, [192, 3, 2]]
  - [-1, 5, UltraViTBlock, [3, True, 0.00001]]
  - [-1, 1, Conv, [384, 3, 2]]
  - [-1, 20, UltraViTBlock, [3, True, 0.00001]]
  - [-1, 1, Conv, [1152, 3, 2]]
  - [-1, 5, MHSABlock, [0, 4, True, 0.00001, True, 32, False, False, False, False, 0, True]]

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, True]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 11], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 8], 1, Concat, [1]]
  - [-1, 1, C3k2, [1024, True, 0.5, True]]
  - [[14, 17, 20], 1, Detect, [nc]]
