# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO26-FastViT-cls with det-aligned SPPF + C2PSA: yolo26-fastvit-cls.yaml + SPPF at index 9
# and C2PSA at index 10 so backbone layers 0-10 match yolo26-fastvit.yaml name-for-name for
# full cls→det weight transfer.

nc: 1000
scales:
  # [depth, width, max_channels]
  s: [1.0, 0.50, 1024]
  l: [5.0, 0.75, 1024]
  x: [5.0, 1.125, 1024]

# FastViT backbone: 4 stages @ strides 4/8/16/32 with downsample conv between stages
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [96, 3, 2]] # 0 P1/2  stem conv1 (96*width channels)
  - [-1, 1, Conv, [96, 3, 2]] # 1 P2/4  stem conv2
  - [-1, 2, FastViTBlock, [3]] # 2 stage1 @ P2/4  (depth*n blocks, mlp_ratio=3)
  - [-1, 1, Conv, [192, 3, 2]] # 3 P3/8  downsample
  - [-1, 2, FastViTBlock, [3]] # 4 stage2 @ P3/8
  - [-1, 1, Conv, [384, 3, 2]] # 5 P4/16  downsample
  - [-1, 2, FastViTBlock, [3]] # 6 stage3 @ P4/16
  - [-1, 1, Conv, [768, 3, 2]] # 7 P5/32  downsample
  - [-1, 1, MHSABlock, [6, 4]] # 8 stage4 @ P5/32  heads=6, mlp_ratio=4
  - [-1, 1, SPPF, [1024, 5, 3, True]] # 9  det-aligned
  - [-1, 2, C2PSA, [1024]] # 10

head:
  - [-1, 1, Classify, [nc]]
