# Ultralytics AGPL-3.0 License - https://ultralytics.com/license

# YOLO26 Stereo 3D Detection with siamese (weight-shared) backbone
# A standard 3ch backbone runs on L/R images separately (batch trick: [2B,3,H,W]),
# features are split at the tap point for cost volume, then left-only features
# continue through the neck/head for 2D detection.
# Benefits: 100% pretrained weight compatibility, clean left-only 2D features.
# Usage: model=yolo26s-s3d.yaml

# Parameters
nc: 3
stereo: true
siamese: true
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

training:
  loss_weights:
    lr_distance: 2.0
    depth: 3.0
    dimensions: 1.0
    orientation: 1.0

mean_dims:
  Car: [3.88, 1.63, 1.53]
  Pedestrian: [0.88, 0.60, 1.73]
  Cyclist: [1.72, 0.60, 1.77]

# YOLO26 backbone -- standard 3ch convs (siamese: shared weights for L/R)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]               # 0-P1/2  standard conv (no groups)
  - [-1, 1, Conv, [128, 3, 2]]              # 1-P2/4  tap point for cost volume
  - [-1, 2, C3k2, [256, False, 0.25]]       # 2
  - [-1, 1, Conv, [256, 3, 2]]              # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]              # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]             # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5, 3, True]]       # 9
  - [-1, 2, C2PSA, [1024]]                  # 10

# YOLO26 head — cost volume bypasses P3, goes only to depth branches
head:
  # Top-down FPN
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]]              # 13
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, True]]              # 16 (P3/8, clean — no cost vol)

  # Stereo cost volume (separate, NOT merged into P3)
  - [1, 1, StereoCostVolume, [64, 48, 24]]  # 17: [B, 64, H/8, W/8]

  # Bottom-up PAN from clean P3
  - [16, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]]              # 20 (P4/16)
  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 1, C3k2, [1024, True, 0.5, True]]  # 23 (P5/32)

  # Head: [P3, P4, P5, cost_vol] — cost vol only feeds depth branches
  - [[16, 20, 23, 17], 1, Stereo3DDetHead, [nc]]
