# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO26-UltraViT-attn2: base yolo26-ultravit with a deeper P5 MHSA stage.
# ONLY change vs yolo26-ultravit.yaml: layer-8 MHSABlock repeat 5 -> 8, i.e. +1 effective
# P5 attention block per size (n/s/m 1->2, l/x 2->3). Deploy-gate bench arm: tests whether
# the added P5 attention capacity (motivated by conv-x-attn distill 0.4276 = #1) still clears
# conv det@640 latency at every size. m (base margin -0.2%) is the binding latency constraint.
# Backbone 0-8 stays byte-identical to yolo26-ultravit-cls.yaml name-for-name (repeat count
# does not change tensor names), so cls/distilled weights transfer via intersect_dicts.

# Parameters
nc: 80 # number of classes
end2end: True # whether to use end-to-end mode
reg_max: 1 # DFL bins
scales:
  # [depth, width, max_channels]
  n: [0.20, 0.25, 1152]
  s: [0.20, 0.50, 1152]
  m: [0.25, 1.00, 512]
  l: [0.35, 1.00, 512]
  x: [0.35, 1.50, 512]

# UltraViT backbone: RepMixer stages 1-3 + MHSA stage 4, strides 4/8/16/32
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0 P1/2 stem
  - [-1, 1, Conv, [96, 3, 2]] # 1 P2/4 stem
  - [-1, 5, UltraViTBlock, [3, True, 0.00001]] # 2 stage1 P2/4
  - [-1, 1, Conv, [192, 3, 2]] # 3 P3/8 downsample
  - [-1, 5, UltraViTBlock, [3, True, 0.00001]] # 4 stage2 P3/8    <- head P3 skip target
  - [-1, 1, Conv, [384, 3, 2]] # 5 P4/16 downsample
  - [-1, 20, UltraViTBlock, [3, True, 0.00001]] # 6 stage3 P4/16   <- head P4 skip target
  - [-1, 1, Conv, [1152, 3, 2]] # 7 P5/32 downsample
  - [-1, 8, MHSABlock, [0, 4, True, 0.00001, True, 32]] # 8 stage4 P5/32 (+1 block per size) <- head P5 skip target

# Head (byte-identical to yolo26.yaml head, ultravit skip indices)
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, C3k2, [512, True]] # 11

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, C3k2, [256, True]] # 14 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 11], 1, Concat, [1]] # cat head P4
  - [-1, 2, C3k2, [512, True]] # 17 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 8], 1, Concat, [1]] # cat backbone P5
  - [-1, 1, C3k2, [1024, True, 0.5, True]] # 20 (P5/32-large)

  - [[14, 17, 20], 1, Detect, [nc]] # Detect(P3, P4, P5)
