# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO26 with Slim-Neck (GSConv / VoV-GSCSP) neck.
#
# Key idea (Slim-Neck, JRTIP 2024):
#   GSConv = standard conv on half channels + 5×5 DWConv on those halves + channel shuffle.
#   Costs ~60-70% of an equivalent standard convolution.
#   VoV-GSCSP replaces CSP (C3k2) blocks in the neck with GSBottleneck chains.
#   The paper's key finding: lightweighting ONLY the neck — not the backbone — gives
#   the best accuracy/speed tradeoff. Backbone is kept identical to yolo26.yaml.

nc: 80
end2end: True
reg_max: 1
scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# Backbone: identical to yolo26.yaml — NOT lightweighted per Slim-Neck paper
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]              # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]             # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.5]]      # 2
  - [-1, 1, Conv, [256, 3, 2]]             # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.5]]      # 4
  - [-1, 1, Conv, [512, 3, 2]]             # 5-P4/16
  - [-1, 2, C3k2, [512, True]]             # 6
  - [-1, 1, Conv, [1024, 3, 2]]            # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]            # 8
  - [-1, 1, SPPF, [1024, 5, 3, True]]     # 9
  - [-1, 2, C2PSA, [1024]]                 # 10

# Head: same PAFPN topology as yolo26.yaml, C3k2 → VoVGSCSP in neck
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]              # cat backbone P4
  - [-1, 3, VoVGSCSP, [512, True]]         # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]              # cat backbone P3
  - [-1, 3, VoVGSCSP, [256, True]]         # 16 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]             # cat head P4
  - [-1, 3, VoVGSCSP, [512, True]]         # 19 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]             # cat head P5
  - [-1, 2, VoVGSCSP, [1024, True, 0.5]]  # 22 (P5/32-large)

  - [[16, 19, 22], 1, Detect, [nc]]        # Detect(P3, P4, P5)

