# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO26 with a DAMO-YOLO GiraffeNeckV2 (RepGFPN) neck and a single-conv ZeroHead
# Model docs: https://docs.ultralytics.com/models/yolo26
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
end2end: True # whether to use end-to-end mode
reg_max: 1 # DFL bins
scales: # model compound scaling constants, i.e. 'model=yolo26-gfpnn.yaml' will call yolo26-gfpn.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO26 backbone (unchanged)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 4 -> P3 feature (x2)
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]] # 6 -> P4 feature (x1)
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5, 3, True]] # 9
  - [-1, 2, C2PSA, [1024]] # 10 -> P5 feature (x0)

# GiraffeNeckV2 (RepGFPN) neck + ZeroHead
head:
  # node x3 (P5 intermediate): cat(x0, down(x1))
  - [6, 1, Conv, [512, 3, 2]] # 11 down P4 -> P5 (bu_conv13)
  - [[10, 11], 1, Concat, [1]] # 12
  - [-1, 2, C3k2, [1024, True]] # 13 merge_3 -> x3

  # node x4 (P4 intermediate): cat(x1, down(x2), up(x3))
  - [13, 1, nn.Upsample, [None, 2, "nearest"]] # 14 up x3 -> P4
  - [4, 1, Conv, [512, 3, 2]] # 15 down P3 -> P4 (bu_conv24)
  - [[6, 15, 14], 1, Concat, [1]] # 16
  - [-1, 2, C3k2, [512, True]] # 17 merge_4 -> x4

  # node x5 (P3 out): cat(x2, up(x4))
  - [17, 1, nn.Upsample, [None, 2, "nearest"]] # 18 up x4 -> P3
  - [[4, 18], 1, Concat, [1]] # 19
  - [-1, 2, C3k2, [256, True]] # 20 merge_5 -> x5 (P3/8-small)

  # node x7 (P4 out): cat(x4, down(x5))
  - [20, 1, Conv, [256, 3, 2]] # 21 down P3out -> P4 (bu_conv57)
  - [[17, 21], 1, Concat, [1]] # 22
  - [-1, 2, C3k2, [512, True]] # 23 merge_7 -> x7 (P4/16-medium)

  # node x6 (P5 out): cat(x3, down(x4), down(x7))
  - [17, 1, Conv, [512, 3, 2]] # 24 down x4 -> P5 (bu_conv46)
  - [23, 1, Conv, [512, 3, 2]] # 25 down x7 -> P5 (bu_conv76)
  - [[13, 24, 25], 1, Concat, [1]] # 26
  - [-1, 1, C3k2, [1024, True, 0.5, True]] # 27 merge_6 -> x6 (P5/32-large)

  - [[20, 23, 27], 1, DetectZero, [nc]] # 28 Detect(P3, P4, P5)