nc: 80
end2end: True
reg_max: 1
log_regression: True
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5, 3, True]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

head:
  # FPN top-down
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]] # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, True]] # 16

  # Fast normalized fusion
  - [13, 1, Conv, [256, 1, 1]]                   # 17
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 18
  - [10, 1, Conv, [256, 1, 1]]                   # 19
  - [-1, 1, nn.Upsample, [None, 4, "nearest"]]   # 20
  - [[16, 18, 20], 1, FastFusion, [256]]         # 21
  - [-1, 1, C3k2, [256, True]]        # 22

  - [[22], 1, Detect, [nc]]


module:
  init: |
    import torch
    import torch.nn as nn

    class Add(nn.Module):
      def forward(self, x):
          return sum(x)

    class FastFusion(nn.Module):
      """BiFPN-style fast normalized fusion - lighter than softmax."""
      def __init__(self, channels, num_inputs=3, eps=1e-4):
          super().__init__()
          self.eps = eps
          # Learnable weights, initialized to 1
          self.weights = nn.Parameter(torch.ones(num_inputs))
          
      def forward(self, x):
          # Fast normalized fusion: w_i / (sum(w_j) + eps)
          # ReLU ensures non-negative weights
          w = torch.relu(self.weights)
          norm = w.sum() + self.eps
          out = sum(wi * xi for wi, xi in zip(w, x)) / norm
          return out
  parse: |
    if m is Add:
      c2 = ch[0]
    if m is FastFusion:
      c2 = args[0]