# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Single-scale P3 detection via WeightedFusion.
# Compensated trim: keep P3->P4 bottom-up refine (most objects), drop PAN P5 leg,
# refine P5 fusion branch cheaply at native 20x20 before upsampling.

# Parameters
nc: 80 # number of classes
end2end: True # whether to use end-to-end mode
reg_max: 1 # DFL bins
scales: # model compound scaling constants, i.e. 'model=yolo26n.yaml' will call yolo26.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO26n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5, 3, True]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

# YOLO26n head
head:
  # FPN top-down
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, C3k2, [512, True]] # 13 (P4/16 top-down)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, C3k2, [256, True]] # 16 (P3/8 - 80×80)

  # Bottom-up P3->P4 only (no P5 leg)
  - [-1, 1, Conv, [256, 3, 2]] # 17: P3 -> 40×40
  - [[-1, 13], 1, Concat, [1]] # 18
  - [-1, 2, C3k2, [512, True]] # 19 (P4 refined)

  # P5 fusion branch: cheap refine at native 20×20
  - [10, 1, Conv, [256, 1, 1]] # 20: P5 1024→256ch
  - [-1, 2, C3k2, [256, True]] # 21: refine at 20×20 (1/16 cost of 80×80)
  - [-1, 1, nn.Upsample, [None, 4, "nearest"]] # 22: 20×20 → 80×80

  # P4 fusion branch
  - [19, 1, Conv, [256, 1, 1]] # 23: P4 512→256ch
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 24: 40×40 → 80×80

  - [[16, 24, 22], 1, WeightedFusion, [256, 3]] # 25: fuse all at 80×80
  - [-1, 1, C3k2, [256, True]] # 26: refine

  - [[26], 1, Detect, [nc]] # Single-scale Detect
