# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLO26 object detection model with P3/8 - P5/32 outputs
# Variant: strip-ctx + strip gates on the P3 and P4 detect inputs (post ctx injection).
# P3/P4 neck outputs have no attention; the ctx skip only adds backbone content.
# StripAttn here self-recalibrates the fused neck features with their own axial
# context. P5 untouched (already C2PSA + PSABlock + ctx residual).

# Parameters
nc: 80 # number of classes
end2end: True # whether to use end-to-end mode
reg_max: 1 # DFL bins
scales: # model compound scaling constants, i.e. 'model=yolo26n.yaml' will call yolo26.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO26n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2Rep, [256, False, 0.5]] # 2 - rep block, e=0.5
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2Rep, [512, False, 0.5]] # 4 - rep block, e=0.5
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, StripAttn, []] # 7 - strip gate at P4
  - [-1, 1, Conv, [1024, 3, 2]] # 8-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5, 3, True]] # 10
  - [-1, 2, C2PSA, [1024]] # 11
  - [-1, 1, StripAttn, []] # 12 - strip gate at P5 (global context source)

# YOLO26n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 7], 1, Concat, [1]]
  - [-1, 3, C3k2Rep, [512, True]] # 15 - increase depth

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 3, C3k2Rep, [256, True]] # 18 - increase depth

  - [12, 1, Conv, [256, 1, 1]] # 19 - project global ctx to P3 width
  - [-1, 1, nn.Upsample, [None, 4, "nearest"]] # 20
  - [[18, -1], 1, ScaledAdd, []] # 21 - inject global ctx into P3 out
  - [-1, 1, StripAttn, []] # 22 - strip gate on P3 neck output

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 15], 1, Concat, [1]]
  - [-1, 2, C3k2Rep, [512, True]] # 25

  - [12, 1, Conv, [512, 1, 1]] # 26 - project global ctx to P4 width
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 27
  - [[25, -1], 1, ScaledAdd, []] # 28 - inject global ctx into P4 out
  - [-1, 1, StripAttn, []] # 29 - strip gate on P4 neck output

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 2, C3k2Rep, [1024, True, 0.5, True]] # 32
  - [[-1, 12], 1, ScaledAdd, []] # 33: scaled residual from backbone P5

  - [[22, 29, 33], 1, Detect, [nc]]
