# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license
# yolo26-reid with 3 stacked C2PSA blocks (extends 2psa champion)

nc: 751 # overridden by data=*.yaml -> nc
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 2, C2PSA, [1024]]
  - [-1, 2, C2PSA, [1024]]
  - [-1, 2, C2PSA, [1024]]

head:
  - [-1, 1, ReID, [nc]]
