# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO26-cls-attn with det-aligned SPPF: yolo26-cls-attn.yaml + SPPF at index 9 so backbone
# layers 0-10 match yolo26-attn.yaml name-for-name for full cls→det weight transfer.

nc: 1000
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] # 2  c3k=False, attn=False
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 4  c3k=False, attn=False
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True, 0.5, True]] # 6  c3k=True, attn=True
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True, 0.5, True]] # 8  c3k=True, attn=True
  - [-1, 1, SPPF, [1024, 5, 3, True]] # 9  det-aligned
  - [-1, 2, C2PSA, [1024]] # 10

head:
  - [-1, 1, Classify, [nc]]
