# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLO26 object detection model with P3/8 - P5/32 outputs
# Variant: rep-fpn-rep-sres-moga + head_repdw: MogaGate (MogaNet ICLR 2024) at
# backbone P4 and P5 (after C2PSA). Mid-order local context (parallel DW 3x3 d={1,2,3},
# RF 3-7) with SiLU gating + feature decomposition. A/B against StripAttn: mid-order vs axial.
# Per-scale constants (scale_args): `rep_e` = rep-block expansion (dense RepConv cost
# grows as (c2*width*rep_e)^2, so wider scales use smaller rep_e) and `head_n` = FPN
# head repeats for layers 15/18 (baseline yolo26 uses 2). Values from a joint
# head_n x rep_e sweep = max capacity with speed >= same-scale yolo26 baseline
# (interleaved median-of-3+, b16 fp16, fused, GPU 3). Constraints found:
# - rep width (c2*width*rep_e) should be a multiple of 16 (tensor-core alignment;
#   x at 264ch collapsed to 375 img/s)
# - head attn channels must divide PSABlock num_heads=c//64 (e=0.4375 at l/x -> 336ch,
#   5 heads, crash)
#
# Joint sweep results (b16 fp16, img/s, vs same-scale yolo26 baseline):
#   scale  pick            params(fused)  GFLOPs   this   base   margin  runner-up
#   n      d2 e0.5          2.7M            6.8    3633   3736   -2.8%   d3 e0.5: 3458
#   s      d3 e0.5         11.0M           28.4    (trained champion, mAP 0.4788 vs 0.4755)
#   m      d3 e0.28125     19.5M           68.3    1016    987   +2.9%   d2 e0.3125: 1008
#   l      d2 e0.3125      24.1M           93.3     801    780   +2.7%   d3 e0.3125: 773 (fails)
#   x      d3 e0.3125      55.7M          217.2     450    438   +2.7%   d2 e0.375: 397 (fails)
# n still cannot reach baseline: depth-2 head recovers 5% of the 7.4% gap, the last
# -2.8% is the strip convs + non-bottleneck rep blocks at tiny width.

# Parameters
nc: 80 # number of classes
end2end: True # whether to use end-to-end mode
reg_max: 1 # DFL bins
head_repdw: True # pure-rep DW 3x3 in both o2m and o2o cls branches
scale_args: [rep_e, head_n] # names for scales entries beyond [depth, width, max_channels]
scales: # model compound scaling constants, i.e. 'model=yolo26n.yaml' will call yolo26.yaml with scale 'n'
  # [depth, width, max_channels, rep_e, head_n]
  n: [0.50, 0.25, 1024, 0.5, 2] # best available; still -2.8% vs yolo26n (strip convs + rep blocks dominate at tiny width)
  s: [0.50, 0.50, 1024, 0.5, 3] # trained champion, do not change
  m: [0.50, 1.00, 512, 0.28125, 3] # 1016 vs base 987 img/s
  l: [1.00, 1.00, 512, 0.3125, 2] # 801 vs base 780 img/s
  x: [1.00, 1.50, 512, 0.3125, 3] # 450 vs base 438 img/s

# YOLO26n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2Rep, [256, False, rep_e]] # 2 - rep block
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2Rep, [512, False, rep_e]] # 4 - rep block
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, MogaGate, []] # 7 - moga gate at P4
  - [-1, 1, Conv, [1024, 3, 2]] # 8-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5, 3, True]] # 10
  - [-1, 2, C2PSA, [1024]] # 11
  - [-1, 1, MogaGate, []] # 12 - moga gate at P5

# YOLO26n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 7], 1, Concat, [1]]
  - [-1, head_n, C3k2Rep, [512, True, rep_e]] # 15

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, head_n, C3k2Rep, [256, True, rep_e]] # 18

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 15], 1, Concat, [1]]
  - [-1, 2, C3k2Rep, [512, True, rep_e]] # 21

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 2, C3k2Rep, [1024, True, rep_e, True]] # 24
  - [[-1, 12], 1, ScaledAdd, []] # 25: scaled residual from backbone P5

  - [[18, 21, 25], 1, Detect, [nc]]
