# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO26 with Asymptotic Feature Pyramid Network (AFPN) neck — graduated channels.
#
# Key idea (AFPN, IEEE SMC 2023 / IEEE TCSVT 2024):
#   Stage 1 — fuse only adjacent levels P3+P4
#   Stage 2 — incorporate P5 through its adjacent neighbour P4
#   No direct P3↔P5 connection; avoids large semantic gaps.
#
# Channel strategy (vs yolo26-afpn.yaml which uses uniform 256):
#   Each output level keeps the same graduated widths as baseline PAFPN
#   (P3=256, P4=512, P5=1024 base) so capacity is fully preserved.
#   Inter-scale inputs are projected to the target level's width before fusion.
#
# Neck flow:
#   proj_p3 = Conv(P3_bb, 256)   [P3_bb shares ch with P4_bb; this halves it]
#
#   Stage 1:
#     P3_1 = AFPNFuse(proj_p3[256],  up(Conv(P4_bb,256)))  → C3k2 → 256
#     P4_1 = AFPNFuse(P4_bb[512],    Conv(proj_p3,512,↓2)) → C3k2 → 512
#
#   Stage 2:
#     P4_2 = AFPNFuse(P4_1[512],  up(Conv(P5_bb,512)))     → C3k2 → 512  (P4 out)
#     P5_2 = AFPNFuse(P5_bb[1024], Conv(P4_1,1024,↓2))    → C3k2 → 1024 (P5 out)
#     P3_2 = AFPNFuse(P3_1[256],  up(Conv(P4_2,256)))      → C3k2 → 256  (P3 out)

nc: 80
end2end: True
reg_max: 1
scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]              # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]             # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]      # 2
  - [-1, 1, Conv, [256, 3, 2]]             # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]      # 4  ← P3 backbone (512*w)
  - [-1, 1, Conv, [512, 3, 2]]             # 5-P4/16
  - [-1, 2, C3k2, [512, True]]             # 6  ← P4 backbone (512*w)
  - [-1, 1, Conv, [1024, 3, 2]]            # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]            # 8
  - [-1, 1, SPPF, [1024, 5, 3, True]]     # 9
  - [-1, 2, C2PSA, [1024]]                 # 10 ← P5 backbone (1024*w, capped by max_ch)

head:
  # ── Project P3 backbone → 256-base (P3_bb has same ch as P4_bb; halve it) ──
  - [4,  1, Conv, [256, 1, 1]]             # 11: proj_p3  (256 base)

  # ── Stage 1: Fuse P3 + P4 (adjacent levels only) ───────────────────────────
  # P3_1 = fuse(proj_p3[256], up(Conv(P4_bb, 256)))
  - [6,  1, Conv, [256, 1, 1]]             # 12: proj_p4→256 for P3-scale fusion
  - [12, 1, nn.Upsample, [None, 2, "nearest"]]   # 13: up → P3 scale
  - [[11, 13], 1, AFPNFuse, [256, 2]]      # 14: P3_1
  - [-1,  2, C3k2, [256, True]]            # 15: P3_1 refined

  # P4_1 = fuse(P4_bb[512], Conv(proj_p3, 512, ↓2))
  - [11, 1, Conv, [512, 3, 2]]             # 16: proj_p3→512 (stride-2 down)
  - [[6, 16], 1, AFPNFuse, [512, 2]]       # 17: P4_1
  - [-1,  2, C3k2, [512, True]]            # 18: P4_1 refined

  # ── Stage 2: Incorporate P5 (only via adjacent P4) ─────────────────────────
  # P4_2 = fuse(P4_1[512], up(Conv(P5_bb, 512)))  →  P4 output
  - [10, 1, Conv, [512, 1, 1]]             # 19: proj_p5→512 for P4-scale fusion
  - [19, 1, nn.Upsample, [None, 2, "nearest"]]   # 20: up → P4 scale
  - [[18, 20], 1, AFPNFuse, [512, 2]]      # 21: P4_2
  - [-1,  2, C3k2, [512, True]]            # 22: P4_2 refined  ← P4 out

  # P5_2 = fuse(P5_bb[1024], Conv(P4_1, 1024, ↓2))  →  P5 output
  - [18, 1, Conv, [1024, 3, 2]]            # 23: down P4_1→1024 (stride-2)
  - [[10, 23], 1, AFPNFuse, [1024, 2]]     # 24: P5_2
  - [-1,  1, C3k2, [1024, True, 0.5, True]] # 25: P5_2 refined  ← P5 out

  # P3_2 = fuse(P3_1[256], up(Conv(P4_2, 256)))  →  P3 output
  - [22, 1, Conv, [256, 1, 1]]             # 26: proj_p4_2→256 for P3-scale fusion
  - [26, 1, nn.Upsample, [None, 2, "nearest"]]   # 27: up → P3 scale
  - [[15, 27], 1, AFPNFuse, [256, 2]]      # 28: P3_2
  - [-1,  2, C3k2, [256, True]]            # 29: P3_2 refined  ← P3 out

  - [[29, 22, 25], 1, Detect, [nc]]        # Detect(P3, P4, P5)
