# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLO26 object detection model with P3/8 - P5/32 outputs
# Variant: rep-fpn-rep-sres with strip-pooling attention (SPNet/ZipDepth) at backbone
# P4 (new) and P5 (after C2PSA). Global axial context via H/W strip pooling + symmetric
# sigmoid gate; near-zero cost (O(C^2*(H+W))).
# Rep-block expansion `rep_e` scales per model size (4th scales entry): dense RepConv
# cost grows as (c2*width*rep_e)^2, so wider scales use smaller rep_e. Values = max
# capacity with speed >= same-scale yolo26 baseline (interleaved median-of-3, b16 fp16,
# fused, GPU 3). NOTE: this config also has FPN head depth 3 vs baseline's 2 (layers
# 15/18) — the sweep varied only rep_e with that extra depth held fixed, so speed
# margins are net of the deeper head. Next rep_e step up fails at every scale
# (m 0.3125: 967<985; x 0.334: 433<437). Prefer rep widths (c2*width*rep_e) that are
# multiples of 16 — tensor-core alignment; x at 264ch collapsed to 375 img/s.
#
# Benchmarks (b16 fp16, img/s, vs same-scale yolo26 baseline):
#   scale  rep_e    params(fused)  GFLOPs   this   base   margin
#   n      0.5       2.8M           n/a     3457   3694   -6.4%  <- see note below
#   s      0.5      11.0M          28.4     (trained champion, mAP 0.4788 vs 0.4755)
#   m      0.28125  19.5M          68.3     1013    985   +2.8%
#   l      0.3125   24.8M          96.8      774    754   +2.7%
#   x      0.3125   55.7M         217.2      448    437   +2.5%

# Parameters
nc: 80 # number of classes
end2end: True # whether to use end-to-end mode
reg_max: 1 # DFL bins
scale_args: [rep_e] # names for scales entries beyond [depth, width, max_channels]
scales: # model compound scaling constants, i.e. 'model=yolo26n.yaml' will call yolo26.yaml with scale 'n'
  # [depth, width, max_channels, rep_e]
  n: [0.50, 0.25, 1024, 0.5] # ~6% slower than yolo26n at any rep_e — fixed extras (strip convs, head depth 3) dominate at this width; consider reducing head depth to 2 at n to reach parity
  s: [0.50, 0.50, 1024, 0.5]
  m: [0.50, 1.00, 512, 0.28125] # 1013 vs base 985 img/s
  l: [1.00, 1.00, 512, 0.3125] # 774 vs base 754 img/s
  x: [1.00, 1.50, 512, 0.3125] # 448 vs base 437 img/s

# YOLO26n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2Rep, [256, False, rep_e]] # 2 - rep block
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2Rep, [512, False, rep_e]] # 4 - rep block
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, StripAttn, []] # 7 - strip gate at P4
  - [-1, 1, Conv, [1024, 3, 2]] # 8-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5, 3, True]] # 10
  - [-1, 2, C2PSA, [1024]] # 11
  - [-1, 1, StripAttn, []] # 12 - strip gate at P5

# YOLO26n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 7], 1, Concat, [1]]
  - [-1, 3, C3k2Rep, [512, True, rep_e]] # 15 - increase depth

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 3, C3k2Rep, [256, True, rep_e]] # 18 - increase depth

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 15], 1, Concat, [1]]
  - [-1, 2, C3k2Rep, [512, True, rep_e]] # 21

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 2, C3k2Rep, [1024, True, rep_e, True]] # 24
  - [[-1, 12], 1, ScaledAdd, []] # 25: scaled residual from backbone P5

  - [[18, 21, 25], 1, Detect, [nc]]
