# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO26 classification with IBN-a in early stem/downsample convs.
# Used for cls-pretraining a yolo26s-IBN backbone on ImageNet, so that the
# ReID finetune inherits proper IBN statistics (BoT R50-IBN's +5 mAP trick).

nc: 1000
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, ConvIBN, [64, 3, 2]] # 0-P1/2
  - [-1, 1, ConvIBN, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, ConvIBN, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, ConvIBN, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32 — plain BN in deepest stage per IBN-a
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 2, C2PSA, [1024]] # 9

head:
  - [-1, 1, Classify, [nc]]
