# Ultralytics YOLO26 - Single-scale P3 with direct fusion (no PAN)

nc: 80
end2end: True
reg_max: 1
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]         # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]        # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]        # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 4
  - [-1, 1, Conv, [512, 3, 2]]        # 5-P4/16
  - [-1, 2, C3k2, [512, True]]        # 6
  - [-1, 1, Conv, [1024, 3, 2]]       # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]       # 8
  - [-1, 1, SPPF, [1024, 5, 3, True]] # 9
  - [-1, 2, C2PSA, [1024]]            # 10

head:
  # Direct fusion to P3 - skip full PAN
  # P5 (10) → project + upsample 4× to 80×80
  - [10, 1, C3k2, [384, True]]                  # 11: P5 project to 256ch
  - [-1, 1, nn.Upsample, [None, 4, "nearest"]]  # 12: 20×20 → 80×80

  # P4 (6) → project + upsample 2× to 80×80  
  - [6, 1, C3k2, [384, True]]                   # 13: P4 project to 256ch
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 14: 40×40 → 80×80

  # P3 (4) → project to 256ch
  - [4, 1, C3k2, [384, True]]                   # 15: P3 project to 256ch

  # Fuse all at 80×80
  - [[15, 14, 12], 1, Concat, [1]]              # 16: concat (768ch)
  - [-1, 2, C3k2, [384, True]]                  # 17: fuse to 256ch

  - [[17], 1, Detect, [nc]]


module:
  init: |
    import torch
    import torch.nn as nn
    import torch.nn.functional as F

    class WeightedFusion(nn.Module):
      """Learnable weighted fusion of multi-scale features."""
      def __init__(self, channels, num_inputs=3):
          super().__init__()
          self.weights = nn.Parameter(torch.ones(num_inputs) / num_inputs)
          self.conv = nn.Conv2d(channels, channels, 1)
      
      def forward(self, x):
          weights = F.softmax(self.weights, dim=0)
          out = sum(w * f for w, f in zip(weights, x))
          return self.conv(out)
  parse: |
    if m is WeightedFusion:
      c2 = args[0]