# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO26 with Asymptotic Feature Pyramid Network (AFPN) neck.
#
# Key idea (AFPN, IEEE SMC 2023 / IEEE TCSVT 2024):
#   Standard PAFPN connects non-adjacent levels (P3↔P5) through P4, degrading
#   information at each hop. AFPN replaces this with two asymptotic stages:
#     Stage 1 — fuse only adjacent levels P3+P4
#     Stage 2 — incorporate P5 through its adjacent neighbour P4
#   This eliminates large semantic gaps while keeping all cross-scale paths short.
#
# Neck design:
#   1. Project backbone P3/P4/P5 to a common channel width (256 base).
#   2. Stage 1: AFPNFuse(proj_p3, up(proj_p4)) → P3_1
#              AFPNFuse(proj_p4, down(proj_p3)) → P4_1
#   3. Stage 2: AFPNFuse(P4_1, up(proj_p5))    → P4_2  (P4 output)
#              AFPNFuse(proj_p5, down(P4_1))   → P5_2  (P5 output)
#              AFPNFuse(P3_1,   up(P4_2))      → P3_2  (P3 output)
#   Each fused feature is refined by a C3k2 block.

nc: 80
end2end: True
reg_max: 1
scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]              # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]             # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]      # 2
  - [-1, 1, Conv, [256, 3, 2]]             # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]      # 4  ← P3 features
  - [-1, 1, Conv, [512, 3, 2]]             # 5-P4/16
  - [-1, 2, C3k2, [512, True]]             # 6  ← P4 features
  - [-1, 1, Conv, [1024, 3, 2]]            # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]            # 8
  - [-1, 1, SPPF, [1024, 5, 3, True]]     # 9
  - [-1, 2, C2PSA, [1024]]                 # 10 ← P5 features

head:
  # ── Project backbone features to common channel width ──────────────────────
  - [4,  1, Conv, [256, 1, 1]]             # 11: proj_p3  (P3/8)
  - [6,  1, Conv, [256, 1, 1]]             # 12: proj_p4  (P4/16)
  - [10, 1, Conv, [256, 1, 1]]             # 13: proj_p5  (P5/32)

  # ── Stage 1: Fuse P3 + P4 (adjacent levels only) ───────────────────────────
  # P3_1 = fuse(proj_p3, upsample(proj_p4))
  - [12, 1, nn.Upsample, [None, 2, "nearest"]]   # 14: up_p4 → P3 scale
  - [[11, 14], 1, AFPNFuse, [256, 2]]             # 15: P3_1
  - [-1,  2, C3k2, [256, True]]                   # 16: P3_1 refined

  # P4_1 = fuse(proj_p4, downsample(proj_p3))
  - [11, 1, Conv, [256, 3, 2]]                    # 17: down_p3 → P4 scale
  - [[12, 17], 1, AFPNFuse, [256, 2]]             # 18: P4_1
  - [-1,  2, C3k2, [256, True]]                   # 19: P4_1 refined

  # ── Stage 2: Incorporate P5 (via adjacent P4, not directly to P3) ──────────
  # P4_2 = fuse(P4_1, upsample(proj_p5))  →  P4 output
  - [13, 1, nn.Upsample, [None, 2, "nearest"]]   # 20: up_p5 → P4 scale
  - [[19, 20], 1, AFPNFuse, [256, 2]]             # 21: P4_2
  - [-1,  2, C3k2, [256, True]]                   # 22: P4_2 refined  ← P4 out

  # P5_2 = fuse(proj_p5, downsample(P4_1))  →  P5 output
  - [19, 1, Conv, [256, 3, 2]]                    # 23: down_p4_1 → P5 scale
  - [[13, 23], 1, AFPNFuse, [256, 2]]             # 24: P5_2
  - [-1,  1, C3k2, [256, True]]                   # 25: P5_2 refined  ← P5 out

  # P3_2 = fuse(P3_1, upsample(P4_2))  →  P3 output
  - [22, 1, nn.Upsample, [None, 2, "nearest"]]   # 26: up_p4_2 → P3 scale
  - [[16, 26], 1, AFPNFuse, [256, 2]]             # 27: P3_2
  - [-1,  2, C3k2, [256, True]]                   # 28: P3_2 refined  ← P3 out

  - [[28, 22, 25], 1, Detect, [nc]]               # Detect(P3, P4, P5)
