# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO26-FastViT-cls: FastViT (arXiv:2303.14189) RepMixer stages 1-3 + MHSA stage 4.
# Blocks in ultralytics/nn/modules/vit_blocks.py, resolved by parse_model in ultralytics/nn/tasks.py.
#
# Export validation (2026-04-23 R3.3, RTX PRO 6000 Blackwell, imgsz=224):
#   PASS: TorchScript, ONNX opset17, OpenVINO, CoreML (.mlpackage ~0.5× ONNX size), TFLite fp32, NCNN, MNN
#   PASS: TensorRT fp16, s=1.948 ms, l=2.652 ms bs=1 (both ≤1.5× yolo26s-cls conv baseline 1.83 ms)
#   FAIL: PaddlePaddle "Model not supported yet" (RepMixer conversion gap, same failure on all RepMixer students)
#   FAIL: RKNN (rknn-toolkit2 AutoUpdate downgrades torch 2.9→2.4, cu12.8→12.1); run in isolated venv
#   ONNX node counts: s=228 (fewer than conv baseline 234), l=804

# Parameters
nc: 1000 # number of classes

scales:
  # [depth, width, max_channels]
  s: [1.0, 0.50, 1024] # 5.05 M params; TRT fp16 bs=1 1.948 ms
  l: [5.0, 0.75, 1024] # 14.77 M params; TRT fp16 bs=1 2.652 ms
  x: [5.0, 1.125, 1024] # 30.98 M params, 17.0 GFLOPs@224; l width x1.5 (conv l->x convention), scale-matched to conv-x 29.64M / attn-x 32.61M

# FastViT backbone: 4 stages @ strides 4/8/16/32 with downsample conv between stages
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [96, 3, 2]] # 0 P1/2  stem conv1 (96*width channels)
  - [-1, 1, Conv, [96, 3, 2]] # 1 P2/4  stem conv2
  - [-1, 2, FastViTBlock, [3]] # 2 stage1 @ P2/4  (depth*n blocks, mlp_ratio=3)
  - [-1, 1, Conv, [192, 3, 2]] # 3 P3/8  downsample
  - [-1, 2, FastViTBlock, [3]] # 4 stage2 @ P3/8
  - [-1, 1, Conv, [384, 3, 2]] # 5 P4/16  downsample
  - [-1, 2, FastViTBlock, [3]] # 6 stage3 @ P4/16
  - [-1, 1, Conv, [768, 3, 2]] # 7 P5/32  downsample
  - [-1, 1, MHSABlock, [6, 4]] # 8 stage4 @ P5/32  heads=6, mlp_ratio=4

# Head
head:
  - [-1, 1, Classify, [nc]] # 9 AdaptiveAvgPool + Conv1x1 + Linear
