# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO27-DETR-DEIM object detection model with P3/8 - P5/32 outputs.
# YOLO26-style CSP trunk + FPN/PAN with a DeimDecoder head for m/l scales.
# Per-scale decoder depth is resolved at parse time via `scale_args`.
#
# Scale summary:
#   m: ndl=3
#   l: ndl=4
# Task: detect. DeimDecoder is named so the dispatch routes this model to YOLODETR.

# Parameters
nc: 80 # number of classes

scales:
  # [depth, width, max_channels]
  m: [1.00, 1.00, 512]
  l: [1.00, 1.00, 512]

# Per-scale variables resolved into module args as string tokens (see parse_model in tasks.py).
scale_args:
  m: {ndl: 3}
  l: {ndl: 4}

# YOLO26 CSP backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5, 3, True]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

# YOLO26 FPN/PAN + DeimDecoder
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, C3k2, [512, True]] # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, C3k2, [256, True]] # 16 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]] # cat head P4
  - [-1, 2, C3k2, [512, True]] # 19 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # cat head P5
  - [-1, 1, C3k2, [1024, True, 0.5, True]] # 22 (P5/32-large)

  # DeimDecoder. Args (ch is auto-filled from `from` refs). Positional order:
  # [nc, hd, nq, ndp, nh, ndl, d_ffn, dropout, act, eval_idx, nd, label_noise_ratio, box_noise_scale,
  #  learnt_init_query, query_select_method, reg_max, reg_scale, layer_scale, mlp_act,
  #  o2m_topk_mode, use_gateway, share_bbox_head, share_score_head]. `ndl` is resolved per scale via `scale_args`.
  - [[16, 19, 22], 1, DeimDecoder, [nc, 256, 300, [3, 6, 3], 8, ndl, 2048, 0.0, "silu", -1, 100, 0.5, 1.0, False, "default", 32, 4.0, 1.0, "silu", "unshared", True, False, False]]
