# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO27xxl-DETR inference config: DINOv3-ViT-B/16 + STA backbone with DeimDecoder head (ndl=4).
# Task: detect. See yolo27xxl-detr-ndl6.yaml for the full 6-layer decoder variant.

nc: 80 # number of classes

backbone:
  # [from, repeats, module, args]
  # DINOv3-ViT + STA backbone wrapper. First arg (320) is output channels for the parser.
  # Args: [out_ch, name, interaction_indexes, patch_size, use_sta, conv_inplane, hidden_dim, split]
  - [-1, 1, DEIMDINOv3STAs, [320, dinov3_vitb16, [5, 8, 11], 16, True, 96, 320, True]] # 0
  - [0, 1, Index, [320, 1]] # 1 P3
  - [0, 1, Index, [320, 2]] # 2 P4
  - [0, 1, Index, [320, 3]] # 3 P5

head:
  # HybridEncoder head: input_proj + AIFI + FPN/PAN. hidden_dim=256.
  # input_proj is Conv (not Identity) because backbone outputs 320, not 256.
  - [3, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 4 input_proj.2
  - [-1, 1, AIFI, [1024, 8]]
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 6 Y5, lateral_convs.0

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [2, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 8 input_proj.1
  - [[-2, -1], 1, Add, []]
  - [-1, 1, RepNCSPELAN5, [256, 512, 160, 4]] # 10 fpn_blocks.0
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 11 Y4, lateral_convs.1

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [1, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 13 input_proj.0
  - [[-2, -1], 1, Add, []]
  - [-1, 1, RepNCSPELAN5, [256, 512, 160, 4]] # 15 X3, fpn_blocks.1

  - [-1, 1, SCDown, [256, 3, 2, False]] # 16 downsample_convs.0
  - [[-1, 11], 1, Add, []]
  - [-1, 1, RepNCSPELAN5, [256, 512, 160, 4]] # 18 F4, pan_blocks.0

  - [-1, 1, SCDown, [256, 3, 2, False]] # 19 downsample_convs.1
  - [[-1, 6], 1, Add, []]
  - [-1, 1, RepNCSPELAN5, [256, 512, 160, 4]] # 21 F5, pan_blocks.1

  # DeimDecoder (defaults explicit). Args:
  # [nc, hd, nq, ndp, nh, ndl, d_ffn, dropout, act, eval_idx, nd, label_noise_ratio, box_noise_scale,
  #  learnt_init_query, query_select_method, reg_max, reg_scale, layer_scale, mlp_act,
  #  o2m_topk_mode, use_gateway, share_bbox_head, share_score_head]
  - [[15, 18, 21], 1, DeimDecoder, [nc, 256, 300, [3, 6, 3], 8, 4, 2048, 0.0, "silu", -1, 100, 0.5, 1.0, False, "default", 32, 4.0, 1.0, "silu", "unshared", True, False, False]]
