# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO27m-DETR object detection model: same L-scale backbone, but ndl=2 decoder and imgsz=512 deployment.
# Strategy: re-use the L source weights (yolo26L_rtdetr_obj365_KD.pt) and shrink compute at inference via
# (a) deeper decoder truncation (6 source layers -> 2) and (b) smaller default input resolution (640 -> 512).
# No separate training run is needed; this is a deployment trick that exchanges some mAP for ~3-4x lower FLOPs.
# Task: detect. RTDETRDecoderV2 is named so the dispatch routes this model to YOLODETR.

# Parameters
nc: 80 # number of classes
scales:
  # [depth, width, max_channels] - identical to L; "m" here is a deployment label, not a scaling row.
  m: [1.00, 1.00, 512]

# YOLO26 CSP backbone (identical to L)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5, 3, True]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

# YOLO26 FPN/PAN + RTDETRDecoder (identical FPN/PAN, decoder uses ndl=2)
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, C3k2, [512, True]] # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, C3k2, [256, True]] # 16 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]] # cat head P4
  - [-1, 2, C3k2, [512, True]] # 19 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # cat head P5
  - [-1, 1, C3k2, [1024, True, 0.5, True]] # 22 (P5/32-large)

  # RTDETRDecoderV2. Args (ch is auto-filled from `from` refs). Positional order:
  # [nc, hd, nq, ndp, nh, ndl, d_ffn, dropout]. Trailing constructor defaults are omitted.
  # ndl=2: aggressive truncation from the 6-layer source training for the m-tier deployment.
  # eval_idx=-1 (default) means inference reads from layer 1 (the new last layer).
  - [[16, 19, 22], 1, RTDETRDecoderV2, [nc, 256, 300, 4, 8, 2, 1024, 0.0]]
