# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO27-DETR-Efficient object detection model with P3/8 - P5/32 outputs.
# YOLO26-style CSP trunk + RTDETRDecoderEfficient head, unified across n/s scales.
# Per-scale decoder differences (ndl, efficient_ms) are resolved at parse time via `scale_args`.
#
# Scale summary (source YAMLs from origin/detr_decoder, both trained with 6 decoder layers):
#   n: ndl=3, efficient_ms=True   - yolo26-rtdetr_efficient_efms_mal_dfineloss.yaml (truncated 6 -> 3, round-robin)
#   s: ndl=3, efficient_ms=False  - yolo26-rtdetr_efficient_mal_dfineloss.yaml      (truncated 6 -> 3, multi-scale)
# Task: detect. RTDETRDecoderEfficient is named so the dispatch routes this model to YOLODETR
# and YOLODETRDetectionModel.init_criterion selects DfineLoss with V2-style zeroed FGL/DDF gains.

# Parameters
nc: 80 # number of classes

scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]

# Per-scale variables resolved into module args as string tokens (see parse_model in tasks.py).
scale_args:
  n: {ndl: 3, efficient_ms: True}
  s: {ndl: 3, efficient_ms: False}

# YOLO26 CSP backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5, 3, True]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

# YOLO26 FPN/PAN + RTDETRDecoderEfficient
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, C3k2, [512, True]] # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, C3k2, [256, True]] # 16 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]] # cat head P4
  - [-1, 2, C3k2, [512, True]] # 19 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # cat head P5
  - [-1, 1, C3k2, [1024, True, 0.5, True]] # 22 (P5/32-large)

  # RTDETRDecoderEfficient. Args (ch is auto-filled from `from` refs). Positional order:
  # [nc, hd, nq, ndp, nh, ndl, d_ffn, dropout, act, eval_idx, nd, label_noise_ratio, box_noise_scale,
  #  learnt_init_query, efficient_ms]. `ndl` and `efficient_ms` are resolved per scale via `scale_args`.
  - [[16, 19, 22], 1, RTDETRDecoderEfficient, [nc, 256, 300, 4, 8, ndl, 2048, 0.0, "silu", -1, 100, 0.5, 1.0, False, efficient_ms]]
