# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO27x-DETR: layer-by-layer YAML for a ViT (embed_dim=384, depth=12, heads=6,
# ffn_ratio=6, swiglu FFN) plus Spatial Tuning Adapter backbone. The ViT depth, STA stem,
# and per-scale fusion are expressed as individual YAML rows. Task: detect.
#
# Requires four ViT modules from ultralytics/nn/modules/vit_blocks.py:
#   VITPatchStem       (c1, c2, patch_size, n_registers): Conv2d patch embed + prepend cls
#                      and n_registers register tokens; emits (B, 1 + n_registers + HW, c2).
#   VITBlock           (dim, num_heads, ffn_ratio, ffn_layer, ls_init): pre-norm SA + LS +
#                      FFN (mlp | swiglu | swiglu64) on (B, N, dim) tokens; RoPE built inside
#                      forward from N (square-grid assumption).
#   VITTokenToSpatial  (dim, n_registers): LayerNorm on (B, N, dim), drop the leading
#                      1 + n_registers tokens, reshape to (B, dim, H/patch, W/patch).
#   VITDownsample2x    (): F.interpolate(scale_factor=0.5, mode="bilinear") on (B, C, H, W).
#
# Parser plumbing (ultralytics/nn/tasks.py): VITPatchStem lives in base_modules, and VITBlock
# + VITTokenToSpatial are dim-preserving so the parser injects `dim = ch[f]` as the first
# init arg. VITDownsample2x is a plain fall-through (dim-preserving, no channel change).

nc: 80 # number of classes

backbone:
  # [from, repeats, module, args]
  # Row 0 holds the raw input so the STA branch can reach it via `from: 0` after the
  # parser resets ch on i == 0.
  - [-1, 1, nn.Identity, []] # 0 input capture

  # ── ViT branch (embed_dim=384, depth=12, heads=6, ffn_ratio=6, swiglu FFN) ──
  # Patch embed + prepend 1 cls + 4 register tokens. Emits token tensor (B, 1+4+HW, 384).
  - [-1, 1, VITPatchStem, [384, 16, 4]] # 1

  # 12 transformer blocks, chunked to expose the interaction outputs at 5/8/11.
  - [-1, 5, VITBlock, [6, 6, "swiglu", 1.0e-5]] # 2  vit blocks 0..4
  - [-1, 1, VITBlock, [6, 6, "swiglu", 1.0e-5]] # 3  vit block 5   (snapshot → P3)
  - [-1, 2, VITBlock, [6, 6, "swiglu", 1.0e-5]] # 4  vit blocks 6..7
  - [-1, 1, VITBlock, [6, 6, "swiglu", 1.0e-5]] # 5  vit block 8   (snapshot → P4)
  - [-1, 2, VITBlock, [6, 6, "swiglu", 1.0e-5]] # 6  vit blocks 9..10
  - [-1, 1, VITBlock, [6, 6, "swiglu", 1.0e-5]] # 7  vit block 11  (snapshot → P5)

  # Tokens → spatial: LayerNorm + strip cls/registers + reshape to (B, 384, H/16, W/16).
  - [3, 1, VITTokenToSpatial, [4]] # 8  vit /16 from block 5
  - [5, 1, VITTokenToSpatial, [4]] # 9  vit /16 from block 8
  - [7, 1, VITTokenToSpatial, [4]] # 10 vit /16 from block 11

  # Pyramid resample: ViT is uniformly at /16, produce /8, /16, /32.
  - [8, 1, nn.Upsample, [None, 2, "bilinear"]] # 11 vit_P3 at /8
  # row 9 is unchanged                          → vit_P4 at /16 (used directly below)
  - [10, 1, VITDownsample2x, []] # 12 vit_P5 at /32

  # ── STA branch (Spatial Tuning Adapter, from raw input at row 0) ──
  - [0, 1, ConvSyncBN, [64, 3, 2, None, 1, 1, False]] # 13 stem conv (act=False)
  - [-1, 1, nn.GELU, []] # 14
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]] # 15 stem pool → /4
  - [-1, 1, ConvSyncBN, [128, 3, 2, None, 1, 1, False]] # 16 c2 → /8
  - [-1, 1, nn.GELU, []] # 17
  - [-1, 1, ConvSyncBN, [256, 3, 2, None, 1, 1, False]] # 18 c3 → /16
  - [-1, 1, nn.GELU, []] # 19
  - [-1, 1, ConvSyncBN, [256, 3, 2, None, 1, 1, False]] # 20 c4 → /32

  # ── Fusion (Concat ViT + STA per scale, then 1×1 Conv+BN) ──
  - [[11, 16], 1, Concat, [1]] # 21 concat vit_P3 + spm_c2
  - [-1, 1, ConvSyncBN, [256, 1, 1, None, 1, 1, False]] # 22 P3 out
  - [[9, 18], 1, Concat, [1]] # 23 concat vit_P4 + spm_c3
  - [-1, 1, ConvSyncBN, [256, 1, 1, None, 1, 1, False]] # 24 P4 out
  - [[12, 20], 1, Concat, [1]] # 25 concat vit_P5 + spm_c4
  - [-1, 1, ConvSyncBN, [256, 1, 1, None, 1, 1, False]] # 26 P5 out

head:
  # HybridEncoder head: input_proj + AIFI + FPN/PAN. hidden_dim=256.
  # Backbone P3/P4/P5 are at rows 22/24/26 (compare with yolo27x-detr.yaml rows 1/2/3).
  - [26, 1, nn.Identity, []] # 27 input_proj.2 (P5)
  - [-1, 1, AIFI, [1024, 8]] # 28
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 29 Y5, lateral_convs.0

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 30
  - [24, 1, nn.Identity, []] # 31 input_proj.1 (P4)
  - [[-2, -1], 1, Add, []] # 32
  - [-1, 1, RepNCSPELAN5, [256, 512, 160, 4]] # 33 fpn_blocks.0
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 34 Y4, lateral_convs.1

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 35
  - [22, 1, nn.Identity, []] # 36 input_proj.0 (P3)
  - [[-2, -1], 1, Add, []] # 37
  - [-1, 1, RepNCSPELAN5, [256, 512, 160, 4]] # 38 X3, fpn_blocks.1

  - [-1, 1, SCDown, [256, 3, 2, False]] # 39 downsample_convs.0
  - [[-1, 34], 1, Add, []] # 40
  - [-1, 1, RepNCSPELAN5, [256, 512, 160, 4]] # 41 F4, pan_blocks.0

  - [-1, 1, SCDown, [256, 3, 2, False]] # 42 downsample_convs.1
  - [[-1, 29], 1, Add, []] # 43
  - [-1, 1, RepNCSPELAN5, [256, 512, 160, 4]] # 44 F5, pan_blocks.1

  # DeimDecoder (defaults explicit). Args:
  # [nc, hd, nq, ndp, nh, ndl, d_ffn, dropout, act, eval_idx, nd, label_noise_ratio, box_noise_scale,
  #  learnt_init_query, query_select_method, reg_max, reg_scale, layer_scale, mlp_act,
  #  o2m_topk_mode, use_gateway, share_bbox_head, share_score_head]
  - [[38, 41, 44], 1, DeimDecoder, [nc, 256, 300, [3, 6, 3], 8, 6, 2048, 0.0, "silu", -1, 100, 0.5, 1.0, False, "default", 32, 4.0, 1.0, "silu", "unshared", True, False, False]] # 45
