# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO27-DETR object detection model with P3/8 - P5/32 outputs.
# YOLO26-style CSP trunk + RTDETRDecoderV2 head, unified across n/s/m/l scales.
# Per-scale decoder differences (ndl, efficient_ms) are resolved at parse time via `scale_args`.
#
# Scale summary (source weights / deployment intent):
#   n: ndl=3, efficient_ms=True   - source yolo26N_eff_rtdetr_coco.pt    (COCO, imgsz=480)
#   s: ndl=3, efficient_ms=False  - source yolo26S_rtdetr_obj365.pt      (truncated 6 -> 3, imgsz=512)
#   m: ndl=2, efficient_ms=False  - source yolo26L_rtdetr_obj365_KD.pt   (truncated 6 -> 2, imgsz=512, L-scale backbone reused as a deployment label)
#   l: ndl=4, efficient_ms=False  - source yolo26L_rtdetr_obj365.pt      (truncated 6 -> 4)
# Task: detect. RTDETRDecoderV2 is named so the dispatch routes this model to YOLODETR.

# Parameters
nc: 80 # number of classes

scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [1.00, 1.00, 512]
  l: [1.00, 1.00, 512]

# Per-scale variables resolved into module args as string tokens (see parse_model in tasks.py).
scale_args:
  n: {ndl: 3, efficient_ms: True}
  s: {ndl: 3, efficient_ms: False}
  m: {ndl: 2, efficient_ms: False}
  l: {ndl: 4, efficient_ms: False}

# YOLO26 CSP backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5, 3, True]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

# YOLO26 FPN/PAN + RTDETRDecoderV2
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, C3k2, [512, True]] # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, C3k2, [256, True]] # 16 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]] # cat head P4
  - [-1, 2, C3k2, [512, True]] # 19 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # cat head P5
  - [-1, 1, C3k2, [1024, True, 0.5, True]] # 22 (P5/32-large)

  # RTDETRDecoderV2. Args (ch is auto-filled from `from` refs). Positional order:
  # [nc, hd, nq, ndp, nh, ndl, d_ffn, dropout, act, eval_idx, nd, label_noise_ratio, box_noise_scale,
  #  learnt_init_query, efficient_ms]. `ndl` and `efficient_ms` are resolved per scale via `scale_args`.
  - [[16, 19, 22], 1, RTDETRDecoderV2, [nc, 256, 300, 4, 8, ndl, 1024, 0.0, "relu", -1, 100, 0.5, 1.0, False, efficient_ms]]
