# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO12 Enhanced object detection model with P3/8 - P5/32 outputs using EnhancedC2f
# Model docs: https://docs.ultralytics.com/models/yolo12
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo12n.yaml' will call yolo12.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # 272 layers, 2,602,288 params, 6.7 GFLOPs
  s: [0.50, 0.50, 1024] # 272 layers, 9,284,096 params, 21.7 GFLOPs
  m: [0.50, 1.00, 512]  # 292 layers, 20,199,168 params, 68.1 GFLOPs
  l: [1.00, 1.00, 512]  # 488 layers, 26,450,784 params, 89.7 GFLOPs
  x: [1.00, 1.50, 512]  # 488 layers, 59,210,784 params, 200.3 GFLOPs

# YOLO12n Enhanced backbone - STRATEGIC PLACEMENT
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]     # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]    # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] # 2
  - [-1, 1, Conv, [256, 3, 2]]    # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 4
  - [-1, 1, Conv, [512, 3, 2]]    # 5-P4/16
  - [-1, 2, C3k2, [512, False, 0.25]] # 6 (transition)
  - [-1, 2, EnhancedC2f, [512, False]] # 7 ENHANCED (semantic start)
  - [-1, 1, Conv, [1024, 3, 2]]   # 8-P5/32
  - [-1, 2, EnhancedC2f, [1024, False]] # 9 ENHANCED
  - [-1, 2, EnhancedC2f, [1024, False]] # 10 ENHANCED

# YOLO12n Enhanced head - STRATEGIC PLACEMENT
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 11 P5->P4
  - [[-1, 7], 1, Concat, [1]]                  # 12 cat backbone P4
  - [-1, 1, C3k2, [512, False, 0.25]]          # 13
  - [-1, 1, EnhancedC2f, [512, False]]         # 14 ENHANCED

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 15 P4->P3
  - [[-1, 4], 1, Concat, [1]]                  # 16 cat backbone P3
  - [-1, 2, C3k2, [256, False, 0.25]]          # 17

  - [-1, 1, Conv, [256, 3, 2]]                 # 18 P3->P4
  - [[-1, 14], 1, Concat, [1]]                 # 19
  - [-1, 1, C3k2, [512, False, 0.25]]          # 20
  - [-1, 1, EnhancedC2f, [512, False]]         # 21 ENHANCED

  - [-1, 1, Conv, [512, 3, 2]]                 # 22 P4->P5
  - [[-1, 10], 1, Concat, [1]]                 # 23
  - [-1, 2, EnhancedC2f, [1024, False]]        # 24 FULLY ENHANCED

  - [[17, 21, 24], 1, Detect, [nc]]            # 25 Detect(P3, P4, P5)
