# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Stereo CenterNet Medium - Based on YOLOv11m
# Stereo 3D Object Detection model

# Parameters
nc: 3  # Number of classes (Car, Pedestrian, Cyclist)
stereo: true  # Stereo mode flag
input_channels: 6  # 6-channel input (RGB left + RGB right)

# Mean dimensions per class [L, W, H] in meters
mean_dims:
  Car: [3.88, 1.63, 1.53]
  Pedestrian: [0.88, 0.60, 1.73]
  Cyclist: [1.72, 0.60, 1.77]

# Backbone (6-channel input, based on YOLOv11m)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2: [B, 6, 384, 1280] -> [B, 64, 192, 640]
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]  # 2
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]  # 4
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 2, C3k2, [512, True]]  # 6
  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]  # 8
  - [-1, 1, SPPF, [1024, 5]]  # 9
  - [-1, 2, C2PSA, [1024]]  # 10

# Head (neck + detection head)
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 11
  - [[-1, 6], 1, Concat, [1]]  # 12: cat backbone P4
  - [-1, 2, C3k2, [512, False]]  # 13
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 14
  - [[-1, 4], 1, Concat, [1]]  # 15: cat backbone P3
  - [-1, 2, C3k2, [256, False]]  # 16 (P3/8)
  - [-1, 1, Stereo3DDetHeadYOLO11, [nc, 256]]  # 17
