# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license
#
# v4-D2: Full combination — C3k2@P2 (B1) + LiteConv (A1) + asymmetric elastic (C3)
# Maximum v4 FLOPs reduction: P2=C3k2, remaining SC_ELAN_LSKA_TSCG stages use
# LiteConv with asymmetric elastic width (P3-neck e=0.375, deeper e=0.5).
# Uses SC_ELAN_LSKA_TSCG_E with ContextAwareLiteConv internally via _Lite+E combo.
# Since _Lite doesn't support `e`, we use SC_ELAN_LSKA_TSCG_E here and note that
# the Lite variant should be considered if D1 proves the DW5x5 is indeed redundant.
#
# Implementation note: This config uses SC_ELAN_LSKA_TSCG_E (elastic width, full RepConv)
# + C3k2@P2 + asymmetric widths. If A-phase confirms Lite is safe, a D2-lite variant
# can be made by combining LiteConv+E in a future module.

nc: 80
scales:
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3k2, [256, False, 0.25]] # P2 — C3k2 (from B1)
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, SC_ELAN_LSKA_TSCG_E, [512, 512, 512, 1, 23, 4, 0.5]] # P3 — original width
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 2, SC_ELAN_LSKA_TSCG_E, [512, 512, 512, 1, 23, 4, 0.5]] # P4 — original width
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]
  - [-1, 2, C2PSA, [1024]]

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, SC_ELAN_LSKA_TSCG_E, [512, 512, 512, 1, 23, 4, 0.5]] # P4 neck — original

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, SC_ELAN_LSKA_TSCG_E, [256, 256, 256, 1, 23, 4, 0.375]] # P3 neck — narrow

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 2, SC_ELAN_LSKA_TSCG_E, [512, 512, 512, 1, 23, 4, 0.5]] # P4 down — original

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 2, C3k2, [1024, True]]

  - [[16, 19, 22], 1, DetectCAI, [nc, 32, 0.10, 0.40, 0.90]]
