# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license
#
# SC-ELAN v3 cross variant:
# - Keep Phase-3B structure (SA-LSKA + TSCG + P3-FRM)
# - Replace DetectCAI-Soft with DetectCAIv3

nc: 80
scales:
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]                                  # 0
  - [-1, 1, Conv, [128, 3, 2]]                                 # 1
  - [-1, 2, SC_ELAN_LSKA_TSCG, [256, 256, 256, 1, 7, 4]]      # 2  P3: k=7
  - [-1, 1, Conv, [256, 3, 2]]                                 # 3
  - [-1, 2, SC_ELAN_LSKA_TSCG, [512, 512, 512, 1, 11, 4]]     # 4  P4: k=11
  - [-1, 1, Conv, [512, 3, 2]]                                 # 5
  - [-1, 2, SC_ELAN_LSKA_TSCG, [512, 512, 512, 1, 23, 4]]     # 6  P5: k=23
  - [-1, 1, Conv, [1024, 3, 2]]                                # 7
  - [-1, 2, C3k2, [1024, True]]                                # 8
  - [-1, 1, SPPF, [1024, 5]]                                   # 9
  - [-1, 2, C2PSA, [1024]]                                     # 10

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]                 # 11
  - [[-1, 6], 1, Concat, [1]]                                  # 12
  - [-1, 2, SC_ELAN_LSKA_TSCG, [512, 512, 512, 1, 11, 4]]     # 13 Neck P4: k=11

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]                 # 14
  - [[-1, 4], 1, Concat, [1]]                                  # 15
  - [-1, 2, SC_ELAN_LSKA_TSCG, [256, 256, 256, 1, 7, 4]]      # 16 Neck P3: k=7
  - [-1, 1, P3_FRM, [256]]                                     # 17 P3 Feature Refinement

  - [-1, 1, Conv, [256, 3, 2]]                                 # 18
  - [[-1, 13], 1, Concat, [1]]                                 # 19
  - [-1, 2, SC_ELAN_LSKA_TSCG, [512, 512, 512, 1, 11, 4]]     # 20 Neck P4 down: k=11

  - [-1, 1, Conv, [512, 3, 2]]                                 # 21
  - [[-1, 10], 1, Concat, [1]]                                 # 22
  - [-1, 2, C3k2, [1024, True]]                                # 23

  # DetectCAIv3 args:
  # [nc, cai_embed, cai_alpha, cai_beta, cai_momentum,
  #  cai_gamma_tail, cai_gamma_detail, cai_gamma_uncert,
  #  cai_beta_min_ratio, cai_beta_max_ratio, cai_gate_min, cai_gate_max,
  #  cai_warmup_steps, cai_level_gain]
  - [[17, 20, 23], 1, DetectCAIv3, [nc, 32, 0.10, 0.40, 0.90, 0.35, 0.25, 0.20, 0.80, 1.50, 0.70, 1.60, 1000, [1.15, 1.00, 0.90]]]
