# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license
#
# v4-A1: Global SC_ELAN_LSKA_TSCG_Lite (no DW5x5 context branch) + P1d CAI
# Hypothesis: LSKA(k=23) already provides long-range context, so the rbr_context
# branch inside ContextAwareRepConv is redundant. Removing it saves ~15-20% FLOPs
# per SC_ELAN block while LSKA compensates for context quality.

nc: 80
scales:
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, SC_ELAN_LSKA_TSCG_Lite, [256, 256, 256, 1, 23, 4]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, SC_ELAN_LSKA_TSCG_Lite, [512, 512, 512, 1, 23, 4]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 2, SC_ELAN_LSKA_TSCG_Lite, [512, 512, 512, 1, 23, 4]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]
  - [-1, 2, C2PSA, [1024]]

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, SC_ELAN_LSKA_TSCG_Lite, [512, 512, 512, 1, 23, 4]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, SC_ELAN_LSKA_TSCG_Lite, [256, 256, 256, 1, 23, 4]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 2, SC_ELAN_LSKA_TSCG_Lite, [512, 512, 512, 1, 23, 4]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 2, C3k2, [1024, True]]

  - [[16, 19, 22], 1, DetectCAI, [nc, 32, 0.10, 0.40, 0.90]]
