# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license
#
# v4-C1: Global elastic width e=0.375 — all SC_ELAN stages use narrower hidden dim
# hidden_ch = max(8, int(c2 * 0.375)) instead of c2 * 0.5 (original).
# Cuts SC_ELAN internal compute by ~44% while keeping full LSKA+TSCG+RepConv.

nc: 80
scales:
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, SC_ELAN_LSKA_TSCG_E, [256, 256, 256, 1, 23, 4, 0.375]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, SC_ELAN_LSKA_TSCG_E, [512, 512, 512, 1, 23, 4, 0.375]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 2, SC_ELAN_LSKA_TSCG_E, [512, 512, 512, 1, 23, 4, 0.375]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]
  - [-1, 2, C2PSA, [1024]]

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, SC_ELAN_LSKA_TSCG_E, [512, 512, 512, 1, 23, 4, 0.375]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, SC_ELAN_LSKA_TSCG_E, [256, 256, 256, 1, 23, 4, 0.375]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 2, SC_ELAN_LSKA_TSCG_E, [512, 512, 512, 1, 23, 4, 0.375]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 2, C3k2, [1024, True]]

  - [[16, 19, 22], 1, DetectCAI, [nc, 32, 0.10, 0.40, 0.90]]
