# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license
#
# SC-ELAN v3 draft:
# - Keep the strongest structural base from v2-P1d (LSKA23 + TSCG).
# - Replace DetectCAI with DetectCAIv3:
#   dynamic beta routing + warmup + gate clipping (training only).

nc: 80
scales:
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, SC_ELAN_LSKA_TSCG, [256, 256, 256, 1, 23, 4]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, SC_ELAN_LSKA_TSCG, [512, 512, 512, 1, 23, 4]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 2, SC_ELAN_LSKA_TSCG, [512, 512, 512, 1, 23, 4]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]
  - [-1, 2, C2PSA, [1024]]

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, SC_ELAN_LSKA_TSCG, [512, 512, 512, 1, 23, 4]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, SC_ELAN_LSKA_TSCG, [256, 256, 256, 1, 23, 4]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 2, SC_ELAN_LSKA_TSCG, [512, 512, 512, 1, 23, 4]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 2, C3k2, [1024, True]]

  # DetectCAIv3 args:
  # [nc, cai_embed, cai_alpha, cai_beta, cai_momentum,
  #  cai_gamma_tail, cai_gamma_detail, cai_gamma_uncert,
  #  cai_beta_min_ratio, cai_beta_max_ratio, cai_gate_min, cai_gate_max,
  #  cai_warmup_steps, cai_level_gain]
  - [[16, 19, 22], 1, DetectCAIv3, [nc, 32, 0.10, 0.40, 0.90, 0.35, 0.25, 0.20, 0.80, 1.50, 0.70, 1.60, 1000, [1.15, 1.00, 0.90]]]
