# YOLOv9

# parameters
nc: 80  # number of classes
ch: 6
dual_stream: True
siamese: True
synchronize: [[2,32],[3,33],[4,34],[5,35],[6,36],[7,37],[8,38],[9,39],[10,40],[16,46],[17,47],[18,48],[19,49],[20,50],[21,51],[22,52],[23,53],[24,54],[25,55],[26,56],[27,57],[28,58],[29,59],[30,60]]
# gelan backbone

backbone:
  - [ -1, 1, Silence, [] ] #0
  - [-1, 1, Input, [0]] #1
  - [-1, 1, Conv, [64, 3, 2]]  # 2-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 3-P2/4
  - [-1, 1, RepNCSPELAN4, [256, 128, 64, 2]]  # 4
  - [-1, 1, ADown, [256]]  # 5-P3/8
  - [-1, 1, RepNCSPELAN4, [512, 256, 128, 2]]  # 6
  - [-1, 1, ADown, [512]]  # 7-P4/16
  - [-1, 1, RepNCSPELAN4, [1024, 512, 256, 2]]  # 8
  - [-1, 1, ADown, [1024]]  # 9-P5/32
  - [-1, 1, RepNCSPELAN4, [1024, 512, 256, 2]]  # 10

  - [2, 1, CBLinear, [[64]]] # 11
  - [4, 1, CBLinear, [[64, 128]]] # 12
  - [6, 1, CBLinear, [[64, 128, 256]]] # 13
  - [8, 1, CBLinear, [[64, 128, 256, 512]]] # 14
  - [10, 1, CBLinear, [[64, 128, 256, 512, 1024]]] # 15

  - [1, 1, Conv, [64, 3, 2]]  # 16-P1/2
  - [[11, 12, 13, 14, 15, -1], 1, CBFuse, [[0, 0, 0, 0, 0]]] # 17
  - [-1, 1, Conv, [128, 3, 2]]  # 18-P2/4
  - [[ 12, 13, 14, 15,-1], 1, CBFuse, [[1, 1, 1, 1]]] # 19
  - [-1, 1, RepNCSPELAN4, [256, 128, 64, 2]]  # 20
  - [-1, 1, ADown, [256]]  # 21-P3/8
  - [[13, 14,15,-1], 1, CBFuse, [[2, 2, 2]]] # 22
  - [-1, 1, RepNCSPELAN4, [512, 256, 128, 2]]  # 23
  - [-1, 1, ADown, [512]]  # 24-P4/16
  - [[14,15, -1], 1, CBFuse, [[3, 3]]] # 25
  - [-1, 1, RepNCSPELAN4, [1024, 512, 256, 2]]  # 26
  - [-1, 1, ADown, [1024]]  # 27-P5/32
  - [[15, -1], 1, CBFuse, [[4]]] # 28
  - [-1, 1, RepNCSPELAN4, [1024, 512, 256, 2]]  # 29
  - [-1, 1, SPPELAN, [512, 256]]  # 30

#gellan backbone 2
  - [0, 1, Input, [1]]  #31
  - [-1, 1, Conv, [64, 3, 2]]  # 1-P1/2 #32
  - [-1, 1, Conv, [128, 3, 2]]  # 2-P2/4 #33
  - [-1, 1, RepNCSPELAN4, [256, 128, 64, 2]]  # 34
  - [-1, 1, ADown, [256]]  #35 4-P3/8
  - [-1, 1, RepNCSPELAN4, [512, 256, 128, 2]]  # 36
  - [-1, 1, ADown, [512]]  #37 6-P4/16
  - [-1, 1, RepNCSPELAN4, [1024, 512, 256, 2]]  # 38
  - [-1, 1, ADown, [1024]]  #39 8-P5/32
  - [-1, 1, RepNCSPELAN4, [1024, 512, 256, 2]]  # 40

  - [32, 1, CBLinear, [[64]]] # 41
  - [34, 1, CBLinear, [[64, 128]]] # 42
  - [36, 1, CBLinear, [[64, 128, 256]]] # 43
  - [38, 1, CBLinear, [[64, 128, 256, 512]]] # 44
  - [40, 1, CBLinear, [[64, 128, 256, 512, 1024]]] # 45

  - [31, 1, Conv, [64, 3, 2]]  # 15-P1/2 #46
  - [[41, 42, 43, 44,45, -1], 1, CBFuse, [[0, 0, 0, 0, 0]]] # 47
  - [-1, 1, Conv, [128, 3, 2]]  # 17-P2/4 #48
  - [[ 42, 43, 44,45, -1], 1, CBFuse, [[1, 1, 1, 1]]] # 49
  - [-1, 1, RepNCSPELAN4, [256, 128, 64, 2]]  # 50
  - [-1, 1, ADown, [256]]  # 51-P3/8
  - [[ 43, 44,45, -1], 1, CBFuse, [[2, 2, 2]]] # 52
  - [-1, 1, RepNCSPELAN4, [512, 256, 128, 2]]  # 53
  - [-1, 1, ADown, [512]]  # 54-P4/16
  - [[ 44,45, -1], 1, CBFuse, [[3, 3]]] # 55
  - [-1, 1, RepNCSPELAN4, [1024, 512, 256, 2]]  # 56
  - [-1, 1, ADown, [1024]]  # 57-P5/32
  - [[45, -1], 1, CBFuse, [[4]]] # 58
  - [-1, 1, RepNCSPELAN4, [1024, 512, 256, 2]]  # 59
  - [-1, 1, SPPELAN, [512, 256]]  # 60

#concat features both backbone
  - [[30, 60], 1, FeatureFusionBlock, []]  # 61 former 29, 59
  - [[26,56], 1,  FeatureFusionBlock, []]  # 62 former 25, 55
  - [[23,53], 1,  FeatureFusionBlock, []]  # 63 former 22, 52

# gelan head
head:
  - [61, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 62], 1, Concat, [1]]  # cat backbone P4
  - [-1, 1, RepNCSPELAN4, [512, 512, 256, 2]]  # 66 former 32
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 63], 1, Concat, [1]]  # cat backbone P3
  - [-1, 1, RepNCSPELAN4, [256, 256, 128, 2]]  # 69 former 35 (P3/8-small)

  - [-1, 1, ADown, [256]]
  - [[-1, 66], 1, Concat, [1]]  # cat head P4
  - [-1, 1, RepNCSPELAN4, [512, 512, 256, 2]]  # 72 former 38 (P4/16-medium)

  - [-1, 1, ADown, [512]]
  - [[-1, 61], 1, Concat, [1]]  # cat head P5
  - [-1, 1, RepNCSPELAN4, [512, 1024, 512, 2]]  # 75 former 41 (P5/32-large)

   # detect
  - [[69, 72, 75], 1, Detect, [nc]]  # Detect(P3, P4, P5)
